{"name":"Flag ","text":" When drawing your hand, +1 Card. "},
{"name":"Horn ","text":" Once per turn, when you discard a Border Guard from play, you may put it onto your deck. "},
{"name":"Key ","text":" At the start of your turn, +Cost|1. "},
{"name":"Lantern ","text":" Your Border Guards reveal 3 cards and discard 2. (It takes all 3 being Actions to take the Horn.) "},
{"name":"Treasure Chest ","text":" At the start of your Buy phase, gain a Gold. "},
{"name":"The Earth's Gift ","text":" You may discard a Treasure to gain a card costing up to Cost|4. "},
{"name":"The Field's Gift ","text":" +1 Action<br>+Cost|1<br>''(Keep this until Clean-up.)'' "},
{"name":"The Flame's Gift ","text":" You may trash a card from your hand. "},
{"name":"The Forest's Gift ","text":" +1 Buy<br>+Cost|1<br>''(Keep this until Clean-up.)'' "},
{"name":"The Moon's Gift ","text":" Look through your discard pile. You may put a card from it onto your deck. "},
{"name":"The Mountain's Gift ","text":" Gain a Silver. "},
{"name":"The River's Gift ","text":" +1 Card at the end of this turn.<br>''(Keep this until Clean-up.)'' "},
{"name":"The Sea's Gift ","text":" +1 Card "},
{"name":"The Sky's Gift ","text":" You may discard 3 cards to gain a Gold. "},
{"name":"The Sun's Gift ","text":" Look at the top 4 cards of your deck. Discard any number of them and put the rest back in any order. "},
{"name":"The Swamp's Gift ","text":" Gain a Will-o'-Wisp from its pile. "},
{"name":"The Wind's Gift ","text":" +2 Cards<br>Discard 2 cards. "},
{"name":"Abandoned Mine ","text":" +Cost|1 "},
{"name":"Acting Troupe ","text":" +4 Villagers<br>Trash this. "},
{"name":"Adventurer ","text":" Reveal cards from your deck until you reveal 2 Treasure cards. Put those Treasure cards into your hand and discard the other revealed cards. "},
{"name":"Advisor ","text":" +1 Action<br>Reveal the top 3 cards of your deck. The player to your left chooses one of them. Discard that card and put the rest into your hand. "},
{"name":"Alchemist ","text":" +2 Cards<br>+1 Action<hr>When you discard this from play, if you have a Potion in play, you may put this onto your deck. "},
{"name":"Altar ","text":" Trash a card from your hand. Gain a card costing up to Cost|5. "},
{"name":"Ambassador ","text":" Reveal a card from your hand. Return up to 2 copies of it from your hand to the Supply. Then each other player gains a copy of it. "},
{"name":"Amulet ","text":" Now and at the start of your next turn, choose one: +Cost|1; or trash a card from your hand; or gain a Silver. "},
{"name":"Apothecary ","text":" +1 Card<br>+1 Action<br>Reveal the top 4 cards of your deck. Put the Coppers and Potions into your hand. Put the rest back in any order. "},
{"name":"Apprentice ","text":" +1 Action<br>Trash a card from your hand. +1 Card per Cost|1 it costs. +2 Cards if it has Cost|P in its cost. "},
{"name":"Archive ","text":" +1 Action<br>Set aside the top 3 cards of your deck face down (you may look at them). Now and at the start of your next two turns, put one into your hand. "},
{"name":"Armory ","text":" Gain a card onto your deck costing up to Cost|4. "},
{"name":"Artificer ","text":" +1 Card<br>+1 Action<br>+Cost|1<br>Discard any number of cards. You may gain a card onto your deck costing exactly Cost|1 per card discarded. "},
{"name":"Artisan ","text":" Gain a card to your hand costing up to Cost|5.<br>Put a card from your hand onto your deck. "},
{"name":"Avanto ","text":" +3 Cards<br>You may play an Sauna from your hand. "},
{"name":"Bag of Gold ","text":" +1 Action<br>Gain a Gold onto your deck.<br>''(This is not in the Supply)'' "},
{"name":"Baker ","text":" +1 Card<br>+1 Action<br>+1 Coffers<hr>Setup: Each player get +1 Coffers. "},
{"name":"Band of Misfits ","text":" Play this as if it were a cheaper Action card in the Supply costing. This is that card until it leaves play. "},
{"name":"Bandit Camp ","text":" +1 Card<br>+2 Actions<br>Gain a Spoils from the Spoils pile. "},
{"name":"Bandit ","text":" Gain a Gold. Each other player reveals the top 2 cards of their deck, trashes a revealed Treasure other than Copper, and discards the rest. "},
{"name":"Bank ","text":" When you play this, it’s worth Cost|1 per Treasure card you have in play (counting this). "},
{"name":"Bard ","text":" +Cost|2<br>Receive a Boon. "},
{"name":"Baron ","text":" +1 Buy<br>You may discard an Estate for +Cost|4. If you don't, gain an Estate. "},
{"name":"Bat ","text":" Trash up to 2 cards from your hand. If you trashed at least one, exchange this for a Vampire.<br>''(This is not in the Supply.)'' "},
{"name":"Bazaar ","text":" +1 Card<br>+2 Actions<br>+Cost|1 "},
{"name":"Beggar ","text":" Gain 3 Coppers to your hand.<hr>When another player plays an Attack card, you may first discard this to gain 2 Silvers, putting one onto your deck. "},
{"name":"Bishop ","text":" +Cost|1<br>+VP|1<br>Trash a card from your hand. +VP|1 per Cost|2 it costs (round down). Each other player may trash a card from their hand. "},
{"name":"Black Market ","text":" +Cost|2<br> Reveal the top 3 cards of the Black Market deck. Play any number of Treasures from your hand. You may buy one of the revealed cards. Put the rest on the bottom of the Black Market deck in any order.<hr>Setup: Make a Black Market deck out of different unused Kingdom cards. "},
{"name":"Blessed Village ","text":" +1 Card<br>+2 Actions<hr>When you gain this, take a Boon. Receive it now or at the start of your next turn. "},
{"name":"Border Guard ","text":" +1 Action<br>Reveal the top 2 cards of your deck. Put one into your hand and discard the other. If both were Actions, take the Lantern or Horn. "},
{"name":"Border Village ","text":" +1 Card<br>+2 Actions<hr>When you gain this, gain a cheaper card. "},
{"name":"Bridge Troll ","text":" Each other player takes their –Cost|1 token. Now and at the start of your next turn: +1 Buy.<hr>While this is in play, cards cost Cost|1 less on your turns, but not less than Cost|0. "},
{"name":"Bridge ","text":" +1 Buy<br>+Cost|1<br>This turn, cards (everywhere) cost Cost|1 less, but not less than Cost|0. "},
{"name":"Bureaucrat ","text":" Gain a Silver onto your deck. Each other player reveals a Victory card from their hand and puts it onto their deck (or reveals a hand with no Victory cards). "},
{"name":"Bustling Village ","text":" +1 Card<br>+3 Actions<br>Look through your discard pile. You may reveal a Settlers from it and put it into your hand. "},
{"name":"Butcher ","text":" +2 Coffers<br>You may trash a card from your hand. If you do, remove any number of tokens from your Coffers and gain a card, costing up to the cost of the trashed card plus Cost|1 per token removed. "},
{"name":"Cache ","text":" Cost|3|l<hr>When you gain this, gain 2 Coppers. "},
{"name":"Candlestick Maker ","text":" +1 Action<br>+1 Buy<br>+1 Coffers "},
{"name":"Capital ","text":" Cost|6|l<br>+1 Buy<hr>When you discard this from play, take Debt|6, and then you may pay off Debt "},
{"name":"Caravan Guard ","text":" +1 Card<br>+1 Action<br>At the start of your next turn, +Cost|1.<hr>When another player plays an Attack card, you may first play this from your hand.<br>''(+1 Action has no effect if it's not your turn.)'' "},
{"name":"Caravan ","text":" +1 Card<br>+1 Action<br>At the start of your next turn, +1 Card. "},
{"name":"Cargo Ship ","text":" +Cost|2<br>Once this turn, when you gain a card, you may set it aside face up (on this). At the start of your next turn, put it into your hand. "},
{"name":"Cartographer ","text":" +1 Card<br>+1 Action<br>Look at the top 4 cards of your deck. Discard any number of them, then put the rest back in any order. "},
{"name":"Catacombs ","text":" Look at the top 3 cards of your deck. Choose one: Put them into your hand; or discard them and +3 Cards.<hr>When you trash this, gain a cheaper card. "},
{"name":"Catapult ","text":" +Cost|1<br>Trash a card from your hand. If it costs Cost|3 or more, each other player gains a Curse. If it's a Treasure, each other player discards down to 3 cards in hand. "},
{"name":"Cellar ","text":" +1 Action<br>Discard any number of cards, then draw that many. "},
{"name":"Cemetery ","text":" VP|2|l<hr>When you gain this, trash up to 4 cards from your hand.<br>''Heirloom: Haunted Mirror'' "},
{"name":"Champion ","text":" +1 Action<br>For the rest of the game, when another player plays an Attack card, it doesn't affect you, and when you play an Action, +1 Action.<br>''(This stays in play. This is not in the Supply.)'' "},
{"name":"Chancellor ","text":" +Cost|2<br>You may immediately put your deck into your discard pile. "},
{"name":"Changeling ","text":" Trash this. Gain a copy of a card you have in play.<hr>In games using this, when you gain a card costing Cost|3 or more, you may exchange it for a Changeling. "},
{"name":"Chapel ","text":" Trash up to 4 cards from your hand. "},
{"name":"Chariot Race ","text":" +1 Action<br>Reveal the top card of your deck and put it into your hand. The player to your left reveals the top card of their deck. If your card costs more, +Cost|1 and +VP|1. "},
{"name":"Charm ","text":" When you play this, choose one: +1 Buy and +Cost|2; or the next time you buy a card this turn, you may also gain a differently named card with the same cost. "},
{"name":"City Quarter ","text":" +2 Actions<br>Reveal your hand. +1 Card per Action card revealed. "},
{"name":"City ","text":" +1 Card<br>+2 Actions<br>If there are one or more empty Supply piles, +1 Card. If there are two or more, +1 Buy and +Cost|1 "},
{"name":"Cobbler ","text":" At the start of your next turn, gain a card to your hand costing up to Cost|4. "},
{"name":"Coin of the Realm ","text":" Cost|1|l<br>When you play this, put it on your Tavern mat.<hr>Directly after you finish playing an Action card, you may call this, for +2 Actions. "},
{"name":"Colony ","text":" VP|10|l "},
{"name":"Conclave ","text":" +Cost|2<br>You may play an action card from your hand that you don't have a copy of in play. If you do, +1 Action. "},
{"name":"Conspirator ","text":" +Cost|2<br>If you’ve played 3 or more Actions this turn (counting this), +1 Card and +1 Action. "},
{"name":"Contraband ","text":" Cost|3|l<br>+1 Buy<br>When you play this, the player to your left names a card. You can’t buy that card this turn. "},
{"name":"Coppersmith ","text":" Copper produces an extra Cost|1 this turn. "},
{"name":"Copper ","text":" Cost|1|l "},
{"name":"Council Room ","text":" +4 Cards<br>+1 Buy<br>Each other player draws a card. "},
{"name":"Counterfeit ","text":" Cost|1|l<br>+1 Buy<br>When you play this, you may play a Treasure from your hand twice. If you do, trash that Treasure. "},
{"name":"Counting House ","text":" Look through your discard pile, reveal any number of Coppers from it, and put them into your hand. "},
{"name":"Count ","text":" Choose one: Discard 2 cards; or put a card from your hand onto your deck; or gain a Copper.<br>Choose one: +Cost|3; or trash your hand; or gain a Duchy. "},
{"name":"Courtier ","text":" Reveal a card from your hand. For each type it has (Action, Attack, etc.), choose one: +1 Action; or +1 Buy; or +Cost|3; or gain a Gold. The choices must be different. "},
{"name":"Courtyard ","text":" +3 Cards<br>Put a card from your hand onto your deck. "},
{"name":"Crossroads ","text":" Reveal your hand. +1 Card per Victory card revealed. If this is the first time you played a Crossroads this turn, +3 Actions. "},
{"name":"Crown ","text":" If it's your Action phase, you may play an Action from your hand twice. If it's your Buy phase, you may play a Treasure from your hand twice. "},
{"name":"Crumbling Castle ","text":" VP|1|l<hr>When you gain or trash this, +VP|1 and gain a Silver. "},
{"name":"Crypt ","text":" Set aside any number of Treasures you have in play, face down (under this). While any remain, at the start of each of your turns, put one of them into your hand. "},
{"name":"Cultist ","text":" +2 Cards. Each other player gains a Ruins. You may play a Cultist from your hand.<hr>When you trash this, +3 Cards. "},
{"name":"Cursed Gold ","text":" Cost|3|l<br>When you play this, gain a Curse. "},
{"name":"Cursed Village ","text":" +2 Actions<br>Draw until you have 6 cards in hand.<hr>When you gain this, receive a Hex. "},
{"name":"Curse ","text":" VP|-1|l "},
{"name":"Cutpurse ","text":" +Cost|2<br>Each other player discards a Copper (or reveals a hand with no Copper). "},
{"name":"Dame Anna ","text":" You may trash up to 2 cards from your hand. Each other player reveals the top 2 cards of their deck, trashes one of them costing from Cost|3 to Cost|6, and discards the rest. If a Knight is trashed by this, trash this. "},
{"name":"Dame Josephine ","text":"Each other player reveals the top 2 cards of their deck, trashes one of them costing from Cost|3 to Cost|6, and discards the rest. If a Knight is trashed by this, trash this.<hr>VP|2|l "},
{"name":"Dame Molly ","text":" +2 Actions<br>Each other player discards the top 2 cards of their deck, and trashes one of them costing from Cost|3 to Cost|6. If a Knight is trashed by this, trash this. "},
{"name":"Dame Natalie ","text":" You may gain a card costing up to Cost|3. Each other player reveals the top 2 cards of their deck, trashes one of them costing from Cost|3 to Cost|6, and discards the rest. If a Knight is trashed by this, trash this. "},
{"name":"Dame Sylvia ","text":" +Cost|2<br>Each other player reveals the top 2 cards of their deck, trashes one of them costing from Cost|3 to Cost|6, and discards the rest. If a Knight is trashed by this, trash this. "},
{"name":"Death Cart ","text":" +Cost|5<br>You may trash an Action card from your hand. If you don’t, trash this.<hr>When you gain this, gain 2 Ruins. "},
{"name":"Den of Sin ","text":" At the start of your next turn, +2 Cards.<hr>This is gained to your hand (instead of your discard pile). "},
{"name":"Develop ","text":" Trash a card from your hand. Gain two cards onto your deck, with one costing exactly Cost|1 more than it, and one costing exactly Cost|1 less than it, in either order. "},
{"name":"Devil's Workshop ","text":" If the number of cards you've gained this turn is:<br>2+, gain an Imp from its pile;<br>1, gain a card costing up to Cost|4;<br>0, gain a Gold. "},
{"name":"Diadem ","text":" Cost|2|l<br>When you play this, +Cost|1 per unused Action you have (Action, not Action card).<br>''(This is not in the Supply)'' "},
{"name":"Diplomat ","text":" +2 Cards<br>If you have 5 or fewer cards in hand (after drawing), +2 Actions.<hr>When another player plays an Attack card, you may first reveal this from a hand of 5 or more cards, to draw 2 cards then discard 3. "},
{"name":"Disciple ","text":" You may play an Action card from your hand twice. Gain a copy of it.<hr>When you discard this from play, you may exchange it for a Teacher.<br>''(This is not in the Supply.)'' "},
{"name":"Dismantle ","text":" Trash a card from your hand. If it costs Cost|1 or more, gain a cheaper card and a Gold. "},
{"name":"Distant Lands ","text":" Put this on your Tavern mat.<hr>Worth VP|4 if on your Tavern mat at the end of the game (otherwise worth VP|0). "},
{"name":"Doctor ","text":"Name a card. Reveal the top 3 cards of your deck. Trash the matches. Put the rest back in any order.<hr>When you buy this, you may overpay for it. For each Cost|1 you overpaid, look at the top card of your deck; trash it, discard it, or put it back. "},
{"name":"Druid ","text":" +1 Buy<br>Receive one of the set-aside Boons (leaving it there).<hr>Setup: Set aside the top 3 Boons face up. "},
{"name":"Ducat ","text":" +1 Coffers<br>+1 Buy<hr>When you gain this, you may trash a Copper from your hand. "},
{"name":"Duchess ","text":" +Cost|2. Each player (including you) looks at the top card of their deck and may discard it.<hr>In games using this, when you gain a Duchy, you may gain a Duchess. "},
{"name":"Duchy ","text":" VP|3|l "},
{"name":"Duke ","text":"Worth VP|1 per Duchy you have. "},
{"name":"Dungeon ","text":" +1 Action<br>Now and at the start of your next turn: +2 Cards, then discard 2 cards. "},
{"name":"Duplicate ","text":" Put this on your Tavern mat.<hr>When you gain a card costing up to Cost|6, you may call this, to gain a copy of that card. "},
{"name":"Embargo ","text":" +Cost|2<br>Trash this. Add an Embargo token to a Supply pile. (For the rest of the game, when a player buys a card from that pile, they gain a Curse.)"},
{"name":"Embassy ","text":" +5 Cards<br>Discard 3 cards.<hr>When you gain this, each other player gains a Silver. "},
{"name":"Emporium ","text":" +1 Card<br>+1 Action<br>+Cost|1<hr>When you gain this, if you have at least 5 Action cards in play, +VP|2. "},
{"name":"Encampment ","text":" +2 Cards<br>+2 Actions<br>You may reveal a Gold or Plunder from your hand. If you do not, set this aside, and return it to the Supply at the start of Clean-up. "},
{"name":"Enchantress ","text":" Until your next turn, the first time each other player plays an Action card on their turn, they get +1 Card and +1 Action instead of following its instructions.<br>At the start of your next turn, +2 Cards. "},
{"name":"Engineer ","text":" Gain a card costing up to Cost|4. You may trash this. If you do, gain a card costing up to Cost|4. "},
{"name":"Envoy ","text":" Reveal the top 5 cards of your deck. The player to your left chooses one. Discard that one and put the rest into your hand. "},
{"name":"Estate ","text":" VP|1|l "},
{"name":"Exorcist ","text":" Trash a card from your hand. Gain a cheaper Spirit from one of the Spirit piles. "},
{"name":"Expand ","text":" Trash a card from your hand. Gain a card costing up to Cost|3 more than it. "},
{"name":"Experiment ","text":" +2 Cards<br>+1 Action<br>Return this to the Supply.<hr>When you gain this, gain another Experiment (that doesn't come with another). "},
{"name":"Explorer ","text":" You may reveal a Province from your hand. If you do, gain a Gold to your hand. If you don't, gain a Silver to your hand. "},
{"name":"Fairgrounds ","text":" Worth VP|2 per 5 differently named cards you have (round down). "},
{"name":"Faithful Hound ","text":" +2 Cards<hr>When you discard this other than during Clean-up, you may set it aside, and put it into your hand at end of turn. "},
{"name":"Familiar ","text":" +1 Card<br>+1 Action<br>Each other player gains a Curse. "},
{"name":"Farmers' Market ","text":" +1 Buy<br>If there are VP|4 or more on the Farmers' Market Supply pile, take them and trash this. Otherwise, add VP|1 to the pile and then +Cost|1 per VP|1 on the pile. "},
{"name":"Farming Village ","text":" +2 Actions<br>Reveal cards from your deck until you reveal a Treasure or Action card. Put that card into your hand and discard the rest. "},
{"name":"Farmland ","text":" VP|2|l<hr>When you buy this, trash a card from your hand and gain a card costing exactly Cost|2 more than it. "},
{"name":"Feast ","text":" Trash this card. Gain a card costing up to Cost|5. "},
{"name":"Feodum ","text":" Worth VP|1 per 3 Silvers you have (round down).<hr>When you trash this, gain 3 Silvers. "},
{"name":"Festival ","text":" +2 Actions<br>+1 Buy<br>+Cost|2 "},
{"name":"Fishing Village ","text":" +2 Actions<br>+Cost|1<br>At the start of your next turn: +1 Action and +Cost|1. "},
{"name":"Flag Bearer ","text":" +Cost|2<hr>When you gain or trash this, take the Flag. "},
{"name":"Followers ","text":" +2 Cards<br>Gain an Estate. Each other player gains a Curse and discards down to 3 cards in hand.<br>''(This is not in the Supply)'' "},
{"name":"Fool's Gold ","text":" Worth Cost|1 if it's the first time you played a Fool's Gold this turn, otherwise worth Cost|4.<hr>When another player gains a Province, you may trash this from your hand, to gain a Gold onto your deck. "},
{"name":"Fool ","text":" If you aren't the player with Lost in the Woods, take it, take 3 Boons, and receive the Boons in any order.<br>''Heirloom: Lucky Coin'' "},
{"name":"Forager ","text":" +1 Action<br>+1 Buy<br>Trash a card from your hand, then +Cost|1 per differently named Treasure in the trash. "},
{"name":"Forge ","text":" Trash any number of cards from your hand. Gain a card with cost exactly equal to the total cost in Cost of the trashed cards. "},
{"name":"Fortress ","text":" +1 Card<br>+2 Actions<hr>When you trash this, put it into your hand. "},
{"name":"Fortune Teller ","text":" +Cost|2<br>Each other player reveals cards from the top of their deck until they reveal a Victory card or a Curse. They put it on top and discard the rest. "},
{"name":"Fortune ","text":"8 "},
{"name":"Forum ","text":" +3 Cards<br>+1 Action<br>Discard 2 cards<hr>When you buy this, +1 Buy. "},
{"name":"Fugitive ","text":" +2 Cards<br>+1 Action<br>Discard a card.<hr>When you discard this from play, you may exchange it for a Disciple.<br>''(This is not in the Supply.)'' "},
{"name":"Gardens ","text":" Worth VP|1 per 10 cards you have (round down). "},
{"name":"Gear ","text":" +2 Cards<br>Set aside up to 2 cards from your hand face down (under this). At the start of your next turn, put them into your hand. "},
{"name":"Ghost Ship ","text":" +2 Cards. Each other player with 4 or more cards in hand puts cards from their hand onto their deck until they have 3 cards in hand. "},
{"name":"Ghost Town ","text":" At the start of your next turn, +1 Card and +1 Action.<hr>This is gained to your hand (instead of your discard pile). "},
{"name":"Ghost ","text":" Reveal cards from your deck until you reveal an Action. Discard the other cards and set aside the Action. At the start of your next turn, play it twice.<br>''(This is not in the Supply.)'' "},
{"name":"Giant ","text":" Turn your Journey token over (it starts face up). Then if it's face down, +Cost|1. If it's face up, +Cost|5, and each other player reveals the top card of his deck, trashes it if it costs from Cost|3 to Cost|6, and otherwise discards it and gains a Curse. "},
{"name":"Gladiator ","text":" +Cost|2<br>Reveal a card from your hand. The player to your left may reveal a copy from their hand. If they do not, +Cost|1 and trash a Gladiator from the Supply. "},
{"name":"Goat ","text":" Cost|1|l<br>When you play this, you may trash a card from your hand. "},
{"name":"Gold ","text":" Cost|3|l "},
{"name":"Golem ","text":" Reveal cards from your deck until you reveal 2 Action cards other than Golems. Discard the other cards, then play the Action cards in either order. "},
{"name":"Goons ","text":" +1 Buy<br>+Cost|2<br>Each other player discards down to 3 cards in hand.<hr>While this is in play, when you buy a card, +VP|1. "},
{"name":"Governor ","text":" +1 Action<br>Choose one; you get the version in parentheses: +1 (+3) Cards; or each player gains a Silver (Gold); or each player may trash a card from their hand and gain a card costing exactly Cost|1 (Cost|2) more. "},
{"name":"Grand Castle ","text":" VP|5|l<hr>When you gain this, reveal your hand. +VP|1 per Victory card in your hand and/or in play. "},
{"name":"Grand Market ","text":" +1 Card<br>+1 Action<br>+1 Buy<br>+Cost|2.<hr>You can’t buy this if you have any Coppers in play. "},
{"name":"Graverobber ","text":" Choose one: Gain a card from the trash costing from Cost|3 to Cost|6, onto your deck; or trash an Action card from your hand and gain a card costing up to Cost|3 more than it. "},
{"name":"Great Hall ","text":" +1 Card<br>+1 Action<hr>VP|1|l "},
{"name":"Groundskeeper ","text":" +1 Card<br>+1 Action<hr>While this is in play, when you gain a Victory card, +VP|1. "},
{"name":"Guardian ","text":" Until your next turn, when another player plays an Attack card, it doesn't affect you. At the start of your next turn, +Cost|1.<hr>This is gained to your hand (instead of your discard pile). "},
{"name":"Guide ","text":" +1 Card<br>+1 Action<br>Put this on your Tavern mat.<hr>At the start of your turn, you may call this, to discard your hand and draw 5 cards. "},
{"name":"Haggler ","text":" +Cost|2<br>While this is in play, when you buy a card, gain a cheaper non-Victory card. "},
{"name":"Hamlet ","text":" +1 Card<br>+1 Action<br>You may discard a card for +1 Action. You may discard a card for +1 Buy. "},
{"name":"Harbinger ","text":" +1 Card<br>+1 Action<br>Look through your discard pile. You may put a card from it onto your deck. "},
{"name":"Harem ","text":" Cost|2|l<hr>VP|2|l "},
{"name":"Harvest ","text":" Reveal the top 4 cards of your deck, then discard them. +Cost|1 per differently named card revealed. "},
{"name":"Haunted Castle ","text":" VP|2|l<hr>When you gain this during your turn, gain a Gold, and each other player with 5 or more cards in hand puts 2 cards from their hand onto their deck. "},
{"name":"Haunted Mirror ","text":" Cost|1|l<hr>When you trash this, you may discard an Action card, to gain a Ghost from its pile. "},
{"name":"Haunted Woods ","text":" Until your next turn, when any other player buys a card, they puts their hand onto their deck in any order. At the start of your next turn:<br>+3 Cards "},
{"name":"Haven ","text":" +1 Card<br>+1 Action<br>Set aside a card from your hand face down (under this). At the start of your next turn, put it into your hand. "},
{"name":"Herald ","text":" +1 Card<br>+1 Action<br>Reveal the top card of your deck. If it's an Action, play it.<hr>When you buy this, you may overpay for it. For each Cost|1 you overpaid, look through your discard pile and put a card from it onto your deck. "},
{"name":"Herbalist ","text":" +1 Buy<br>+Cost|1<hr>When you discard this from play, you may put one of your Treasures from play onto your deck. "},
{"name":"Hermit ","text":" Look through your discard pile. You may trash a non-Treasure card from your discard pile or hand. Gain a card costing up to Cost|3.<hr>When you discard this from play, if you didn’t buy any cards this turn, trash this and gain a Madman from the Madman pile. "},
{"name":"Hero ","text":" +Cost|2<br>Gain a Treasure.<hr>When you discard this from play, you may exchange it for a Champion.<br>''(This is not in the Supply.)'' "},
{"name":"Hideout ","text":" +1 Card<br>+2 Actions<br>Trash a card from your hand. If it's a Victory card, gain a Curse. "},
{"name":"Highway ","text":" +1 Card<br>+1 Action<hr>While this is in play, cards cost Cost|1 less, but not less than Cost|0. "},
{"name":"Hireling ","text":" At the start of each of your turns for the rest of the game:<br>+1 Card<br>''(This stays in play.)'' "},
{"name":"Hoard ","text":" Cost|2|l<hr>While this is in play, when you buy a Victory card, gain a Gold. "},
{"name":"Horn of Plenty ","text":" When you play this, gain a card costing up to Cost|1 per differently named card you have in play (counting this). If it’s a Victory card, trash this. "},
{"name":"Horse Traders ","text":" +1 Buy<br>+Cost|3<br>Discard 2 cards.<hr>When another player plays an Attack card, you may first set this aside from your hand. If you do, then at the start of your next turn, +1 Card and return this to your hand. "},
{"name":"Hovel ","text":" When you buy a Victory card, you may trash this from your hand. "},
{"name":"Humble Castle ","text":" Cost|1|l<hr>Worth VP|1 per Castle you have. "},
{"name":"Hunting Grounds ","text":" +4 Cards<hr>When you trash this, gain a Duchy or 3 Estates. "},
{"name":"Hunting Party ","text":" +1 Card<br>+1 Action<br>Reveal your hand. Reveal cards from your deck until you reveal one that isn’t a copy of one in your hand. Put it into your hand and discard the rest. "},
{"name":"Idol ","text":" Cost|2|l<br>When you play this, if you then have an odd number of Idols in play, receive a Boon; if an even number, each other player gains a Curse. "},
{"name":"Ill-Gotten Gains ","text":" Cost|1|l<br>When you play this, you may gain a Copper to your hand.<hr>When you gain this, each other player gains a Curse. "},
{"name":"Improve ","text":" +Cost|2<br>At the start of Clean-up, you may trash an Action card you would discard from play this turn, to gain a card costing exactly Cost|1 more than it. "},
{"name":"Imp ","text":" +2 Cards<br>You may play an Action card from your hand that you don't have a copy of in play.<br>''(This is not in the Supply.)'' "},
{"name":"Inn ","text":" +2 Cards<br>+2 Actions<br>Discard 2 cards.<hr>When you gain this, look through your discard pile, reveal any number of Action cards from it (which can include this), and shuffle them into your deck. "},
{"name":"Inventor ","text":" Gain a card costing up to Cost|4, then cards cost Cost|1 less this turn (but not less than Cost|0). "},
{"name":"Ironmonger ","text":" +1 Card<br>+1 Action<br>Reveal the top card of your deck; you may discard it. Either way, if it is an…<br>Action card, +1 Action<br>Treasure card, +Cost|1<br>Victory card, +1 Card "},
{"name":"Ironworks ","text":"Gain a card costing up to Cost|4. If the gained card is an…<br>Action card, +1 Action<br>Treasure card, +Cost|1<br>Victory card, +1 Card "},
{"name":"Island ","text":" Put this and a card from your hand onto your Island mat.<hr>VP|2|l "},
{"name":"Jack of All Trades ","text":" Gain a Silver. Look at the top card of your deck; you may discard. Draw until you have 5 cards in hand. You may trash a non-Treasure card from your hand. "},
{"name":"Jester ","text":" +Cost|2<br>Each other player discards the top card of their deck. If it’s a Victory card they gains a Curse; otherwise they gain a copy of the discarded card or you do, your choice. "},
{"name":"Journeyman ","text":" Name a card. Reveal cards from your deck until you reveal 3 cards without that name. Put those cards into your hand and discard the rest. "},
{"name":"Junk Dealer ","text":" +1 Card<br>+1 Action<br>+Cost|1.<br>Trash a card from your hand. "},
{"name":"King's Castle ","text":" Worth VP|4 per Castle you have. "},
{"name":"King's Court ","text":" You may play an Action card from your hand three times. "},
{"name":"Laboratory ","text":" +2 Cards<br>+1 Action "},
{"name":"Lackeys ","text":" +2 Cards<hr>When you gain this, +2 Villagers. "},
{"name":"Legionary ","text":" +Cost|3<br>You may reveal a Gold from your hand. If you do, each other player discards down to 2 cards in hand, then draws a card. "},
{"name":"Leprechaun ","text":" Gain a Gold. If you have exactly 7 cards in play, gain a Wish from its pile. Otherwise, receive a Hex. "},
{"name":"Library ","text":"Draw until you have 7 cards in hand, skipping any Action cards you choose to; set those aside, discarding them afterwards."},
{"name":"Lighthouse ","text":" +1 Action<br>Now and at the start of your next turn: +Cost|1.<hr>While this is in play, when another player plays an Attack card, it doesn’t affect you. "},
{"name":"Loan ","text":" Cost|1|l<br>When you play this, reveal cards from your deck until you reveal a Treasure. Discard it or trash it. Discard the other cards. "},
{"name":"Lookout ","text":" +1 Action<br>Look at the top 3 cards of your deck. Trash one of them. Discard one of them. Put the other one back on top of your deck. "},
{"name":"Lost City ","text":" +2 Cards<br>+2 Actions<hr>When you gain this, each other player draws a card. "},
{"name":"Lucky Coin ","text":" Cost|1|l<br>When you play this, gain a Silver. "},
{"name":"Lurker ","text":" +1 Action<br>Choose one: Trash an Action card from the Supply; or gain an Action card from the trash. "},
{"name":"Madman ","text":" +2 Actions<br>Return this to the Madman pile. If you do, +1 Card per card in your hand.<br>''(This is not in the Supply.)'' "},
{"name":"Magic Lamp ","text":" Cost|1|l<br>When you play this, if there are at least 6 cards that you have exactly 1 copy of in play, trash this. If you do, gain 3 Wishes from their pile. "},
{"name":"Magpie ","text":" +1 Card<br>+1 Action<br>Reveal the top card of your deck. If it's a Treasure, put it into your hand. If it's an Action or Victory card, gain a Magpie. "},
{"name":"Mandarin ","text":" +Cost|3<br>Put a card from your hand onto your deck.<hr>When you gain this, put all Treasures you have in play onto your deck in any order. "},
{"name":"Marauder ","text":" Gain a Spoils from the Spoils pile. Each other player gains a Ruins. "},
{"name":"Margrave ","text":" +3 Cards<br>+1 Buy<br>Each other player draws a card, then discards down to 3 cards in hand. "},
{"name":"Market Square ","text":" +1 Card<br>+1 Action<br>+1 Buy<hr>When one of your cards is trashed, you may discard this from your hand to gain a Gold. "},
{"name":"Market ","text":" +1 Card<br>+1 Action<br>+1 Buy<br>+Cost|1 "},
{"name":"Masquerade ","text":" +2 Cards<br>Each player with any cards in hand passes one to the next such player to their left, at once. Then you may trash a card from your hand. "},
{"name":"Masterpiece ","text":" Cost|1|l<hr>When you buy this, you may overpay for it. For each Cost|1 you overpaid, gain a Silver. "},
{"name":"Menagerie ","text":" +1 Action<br>Reveal your hand. If the revealed cards all have different names, +3 Cards. Otherwise, +1 Card. "},
{"name":"Mercenary ","text":" You may trash 2 cards from your hand. If you did, +2 Cards, + Cost|2, and each other player discards down to 3 cards in hand.<br>''(This is not in the Supply.)'' "},
{"name":"Merchant Guild ","text":" +1 Buy<br>+Cost|1<hr>While this is in play, when you buy a card, +1 Coffers. "},
{"name":"Merchant Ship ","text":" Now and at the start of your next turn: +Cost|2. "},
{"name":"Merchant ","text":" +1 Card<br>+1 Action<br>The first time you play a Silver this turn, +Cost|1. "},
{"name":"Messenger ","text":" +1 Buy<br>+Cost|2<br>You may put your deck into your discard pile.<hr>When this is your first buy in a turn, gain a card costing up to Cost|4, and each other player gains a copy of it. "},
{"name":"Militia ","text":" +Cost|2<br>Each other player discards down to 3 cards in hand. "},
{"name":"Mill ","text":" +1 Card<br>+1 Action<br>You may discard 2 cards, for +Cost|2<hr>VP|1|l "},
{"name":"Mine ","text":" You may trash a Treasure card from your hand. Gain a Treasure card to your hand costing up to Cost|3 more than it. "},
{"name":"Mining Village ","text":" +1 Card<br>+2 Actions<br>You may trash this for +Cost|2. "},
{"name":"Minion ","text":" +1 Action<br>Choose one: +Cost|2; or discard your hand, +4 Cards, and each other player with at least 5 cards in hand discards their hand and draws 4 cards. "},
{"name":"Mint ","text":" You may reveal a Treasure card from your hand. Gain a copy of it.<hr>When you buy this, trash all Treasures you have in play. "},
{"name":"Miser ","text":" Choose one: Put a Copper from your hand onto your Tavern mat; or +Cost|1 per Copper on your Tavern mat. "},
{"name":"Moat ","text":" +2 Cards<hr>When another player plays an Attack card, you may first reveal this from your hand, to be unaffected by it. "},
{"name":"Monastery ","text":" For each card you've gained this turn, you may trash a card from your hand or a Copper you have in play. "},
{"name":"Moneylender ","text":" You may trash a Copper from your hand for +Cost|3. "},
{"name":"Monument ","text":" +Cost|2<br>+VP|1 "},
{"name":"Mountain Village ","text":" +2 Actions<br>Look through your discard pile and put a card from it into your hand; if you can't, +1 Card. "},
{"name":"Mountebank ","text":" +Cost|2<br>Each other player may discard a Curse. If they don’t, they gain a Curse and a Copper. "},
{"name":"Mystic ","text":" +1 Action<br>+Cost|2<br>Name a card, then reveal the top card of your deck. If you named it, put it into your hand. "},
{"name":"Native Village ","text":" +2 Actions<br>Choose one: Put the top card of your deck face down on your Native Village mat (you may look at those cards at any time); or put all the cards from your mat into your hand. "},
{"name":"Navigator ","text":" +Cost|2<br>Look at the top 5 cards of your deck. Either discard them all, or put them back in any order. "},
{"name":"Necromancer ","text":" Play a face up, non-Duration Action card from the trash, leaving it there and turning it face down for the turn.<hr>Setup: Put the 3 Zombies into the trash. "},
{"name":"Necropolis ","text":" +2 Actions "},
{"name":"Night Watchman ","text":" Look at the top 5 cards of your deck, discard any number, and put the rest back in any order.<hr>This is gained to your hand (instead of your discard pile). "},
{"name":"Noble Brigand ","text":" +Cost|1<br>When you buy or play this, each other player reveals the top 2 cards of their deck, trashes a revealed Silver or Gold you choose, discards the rest, and gains a Copper if they didn't reveal a Treasure. You gain the trashed cards. "},
{"name":"Nobles ","text":" Choose one: +3 Cards; or +2 Actions.<hr>VP|2|l "},
{"name":"Nomad Camp ","text":" +1 Buy<br>+Cost|2<hr>This is gained onto your deck (instead of to your discard pile). "},
{"name":"Oasis ","text":" +1 Card<br>+1 Action<br>+Cost|1<br>Discard a card. "},
{"name":"Old Witch ","text":" +3 Cards<br>Each other player gains a Curse and may trash a Curse from their hand. "},
{"name":"Opulent Castle ","text":" Discard any number of Victory cards. +Cost|2 per card discarded.<hr>VP|3|l "},
{"name":"Oracle ","text":" Each player (including you) reveals the top 2 cards of their deck, and discards them or puts them back, your choice. They choose the order to return them. Afterwards, you draw 2 cards. "},
{"name":"Outpost ","text":" If this is the first time you played an Outpost this turn, and the previous turn wasn't yours, then take an extra turn after this one, and you only draw 3 cards for your next hand. "},
{"name":"Overgrown Estate ","text":" VP|0|l<hr>When you trash this, +1 Card. "},
{"name":"Overlord ","text":" Play this as if it were an Action card in the Supply costing up to Cost|5. This is that card until it leaves play. "},
{"name":"Page ","text":" +1 Card<br>+1 Action<hr>When you discard this from play, you may exchange it for a Treasure Hunter. "},
{"name":"Pasture ","text":" Cost|1|l<hr>Worth VP|1 per Estate you have. "},
{"name":"Patrician ","text":" +1 Card<br>+1 Action<br>Reveal the top card of your deck. If it costs Cost|5 or more, put it into your hand. "},
{"name":"Patrol ","text":" +3 Cards<br>Reveal the top 4 cards of your deck. Put the Victory cards and Curses into your hand. Put the rest back in any order. "},
{"name":"Patron ","text":" +1 Villager<br>+Cost|2<hr>When something causes you to reveal this (using the word "reveal"), +1 Coffers. "},
{"name":"Pawn ","text":"Choose two: +1 Card; +1 Action; +1 Buy; +Cost|1. The choices must be different. "},
{"name":"Pearl Diver ","text":" +1 Card<br>+1 Action<br>Look at the bottom card of your deck. You may put it on top. "},
{"name":"Peasant ","text":" +1 Buy<br>+Cost|1<hr>When you discard this from play, you may exchange it for a Soldier. "},
{"name":"Peddler ","text":" +1 Card<br>+1 Action<br>+Cost|1<hr>During your Buy phase, this costs Cost|2 less per Action card you have in play, but not less than Cost|0. "},
{"name":"Philosopher's Stone ","text":" When you play this, count your deck and discard pile. Worth Cost|1 per 5 cards total between them (round down). "},
{"name":"Pillage ","text":" Trash this. Each other player with 5 or more cards in hand reveals their hand and discards a card that you choose. Gain 2 Spoils from the Spoils pile. "},
{"name":"Pirate Ship ","text":"Choose one: +Cost|1 per Coin token on your Pirate Ship mat; or each other player reveals the top 2 cards of their deck, trashes one of those Treasures that you choose, and discards the rest, and then if anyone trashed a Treasure you add a Coin token to your Pirate Ship mat. "},
{"name":"Pixie ","text":" +1 Card<br>+1 Action<br>Discard the top Boon. You may trash this to receive that Boon twice.<br>''Heirloom: Goat'' "},
{"name":"Platinum ","text":" Cost|5|l "},
{"name":"Plaza ","text":" +1 Card<br>+2 Actions<br>You may discard a Treasure for +1 Coffers. "},
{"name":"Plunder ","text":" Cost|2|l<br>+VP|1 "},
{"name":"Poacher ","text":" +1 Card<br>+1 Action<br>+Cost|1<br>Discard a card per empty Supply pile. "},
{"name":"Pooka ","text":" You may trash a Treasure other than Cursed Gold from your hand, for +4 Cards.<br>''Heirloom: Cursed Gold'' "},
{"name":"Poor House ","text":" +Cost|4<br>Reveal your hand. –Cost|1 per Treasure card in your hand. (You can't go below Cost|0.) "},
{"name":"Port ","text":" +1 Card<br>+2 Actions<hr>When you buy this, gain another Port. "},
{"name":"Possession ","text":" The player to your left takes an extra turn after this one, in which you can see all cards they can and make all decisions for them. Any cards or Debt they would gain on that turn, you gain instead; any cards of theirs that are trashed are set aside and put in their discard pile at end of turn. "},
{"name":"Potion ","text":" Cost|P|l "},
{"name":"Pouch ","text":" Cost|1|l<br>+1 Buy "},
{"name":"Priest ","text":" +Cost|2<br>Trash a card from your hand. For the rest of this turn, when you trash a card, +Cost|2. "},
{"name":"Princess ","text":" +1 Buy<br>While this is in play, cards cost Cost|2 less, but not less than Cost|0.<br>''(This is not in the Supply)'' "},
{"name":"Prince ","text":" You may set this aside. If you do, set aside an Action card from your hand costing up to Cost|4. At the start of each of your turns, play that Action, setting it aside again when you discard it from play. (Stop playing it if you fail to set it aside on a turn you play it.) "},
{"name":"Procession ","text":" You may play an Action card from your hand twice. Trash it. Gain an Action card costing exactly Cost|1 more than it. "},
{"name":"Province ","text":" VP|6|l "},
{"name":"Quarry ","text":" Cost|1|l<hr>While this is in play, Action cards cost Cost|2 less, but not less than Cost|0. "},
{"name":"Rabble ","text":" +3 Cards<br>Each other player reveals the top 3 cards of their deck, discards the revealed Actions and Treasures, and puts the rest back in any order they choose. "},
{"name":"Raider ","text":" Each other player with 5 or more cards in hand discards a copy of a card you have in play (or reveals they can't).<br>At the start of your next turn, +Cost|3. "},
{"name":"Ranger ","text":" +1 Buy<br>Turn your Journey token over (it starts face up). Then if it's face up, +5 Cards. "},
{"name":"Ratcatcher ","text":" +1 Card<br>+1 Action<br>Put this on your Tavern mat.<hr>At the start of your turn, you may call this, to trash a card from your hand. "},
{"name":"Rats ","text":" +1 Card<br>+1 Action<br>Gain a Rats. Trash a card from your hand other than a Rats (or reveal a hand of all Rats).<hr>When you trash this, +1 Card. "},
{"name":"Raze ","text":" +1 Action<br>Trash this or a card from your hand. Look at one card from the top of your deck per Cost|1 the trashed card costs. Put one of them into your hand and discard the rest. "},
{"name":"Rebuild ","text":" +1 Action. Name a card. Reveal cards from your deck until you reveal a Victory card you did not name. Discard the rest, trash the Victory card, and gain a Victory card costing up to Cost|3 more than it. "},
{"name":"Recruiter ","text":" +2 Cards<br>Trash a card from your hand. +1 Villager per Cost|1 it costs. "},
{"name":"Relic ","text":" Cost|2|l<br>When you play this, each other player puts their –1 Card token on their deck. "},
{"name":"Remake ","text":" Do this twice: Trash a card from your hand, then gain a card costing exactly Cost|1 more than it. "},
{"name":"Remodel ","text":" Trash a card from your hand. Gain a card costing up to Cost|2 more than it. "},
{"name":"Replace ","text":" Trash a card from your hand. Gain a card costing up to Cost|2 more than it. If the gained card is an Action or Treasure, put it onto your deck; if it's a Victory card, each other player gains a Curse. "},
{"name":"Research ","text":" +1 Action<br>Trash a card from your hand. Per Cost|1 it costs, set aside a card from your deck face down (on this). At the start of your next turn, put those cards into your hand. "},
{"name":"Rocks ","text":" Cost|1|l<hr>When you gain or trash this, gain a Silver; if it is your Buy phase, put the Silver on your deck, otherwise put it into your hand. "},
{"name":"Rogue ","text":" +Cost|2<br>If there are any cards in the trash costing from Cost|3 to Cost|6, gain one of them. Otherwise, each other player reveals the top 2 cards of their deck, trashes one of them costing from Cost|3 to Cost|6, and discards the rest. "},
{"name":"Royal Blacksmith ","text":" +5 Cards<br>Reveal your hand; discard the Coppers. "},
{"name":"Royal Carriage ","text":" +1 Action<br>Put this on your Tavern mat.<hr>Directly after you finish playing an Action card, if it's still in play, you may call this, to replay that Action. "},
{"name":"Royal Seal ","text":" Cost|2|l<hr>While this is in play, when you gain a card, you may put that card onto your deck. "},
{"name":"Ruined Library ","text":" +1 Card "},
{"name":"Ruined Market ","text":" +1 Buy "},
{"name":"Ruined Village ","text":" +1 Action "},
{"name":"Saboteur ","text":" Each other player reveals cards from the top of his deck until revealing one costing Cost|3 or more. He trashes that card and may gain a card costing at most Cost|2 less than it. He discards the other revealed cards. "},
{"name":"Sacred Grove ","text":" +1 Buy<br>+Cost|3<br>Receive a Boon. If it doesn't give +Cost|1, each other player may receive it. "},
{"name":"Sacrifice ","text":" Trash a card from your hand. If it's an…<br>Action card, +2 Cards, +2 Actions<br>Treasure card, +Cost|2<br>Victory card, +VP|2 "},
{"name":"Sage ","text":" +1 Action<br>Reveal cards from the top of your deck until you reveal one costing Cost|3 or more. Put that card into your hand and discard the rest. "},
{"name":"Salvager ","text":" +1 Buy<br>Trash a card from your hand. +Cost|1 per Cost|1 it costs. "},
{"name":"Sauna ","text":" +1 Card<br>+1 Action<br>You may play an Avanto from your hand.<hr>While this is in play, when you play a Silver, you may trash a card from your hand. "},
{"name":"Scavenger ","text":" +Cost|2<br>You may put your deck into your discard pile. Look through your discard pile and put one card from it onto your deck. "},
{"name":"Scepter ","text":" When you play this, choose one: +Cost|2; or replay an Action card you played this turn that's still in play. "},
{"name":"Scheme ","text":" +1 Card<br>+1 Action<br>This turn, you may put one of your Action cards onto your deck when you discard it from play. "},
{"name":"Scholar ","text":" Discard your hand. +7 Cards. "},
{"name":"Scout ","text":" +1 Action<br>Reveal the top 4 cards of your deck. Put the revealed Victory cards into your hand. Put the other cards on top of your deck in any order. "},
{"name":"Scrying Pool ","text":" +1 Action<br>Each player (including you) reveals the top card of their deck and either discards it or puts it back, your choice. Then reveal cards from your deck until revealing one that isn’t an Action. Put all of those revealed cards into your hand. "},
{"name":"Sculptor ","text":" Gain a card to your hand costing up to Cost|4. If it's a Treasure, +1 Villager. "},
{"name":"Sea Hag ","text":" Each other player discards the top card of their deck, then gains a Curse onto their deck. "},
{"name":"Secret Cave ","text":" +1 Card<br>+1 Action<br>You may discard 3 cards. If you did, then at the start of your next turn, +Cost|3.<br>''Heirloom: Magic Lamp'' "},
{"name":"Secret Chamber ","text":" Discard any number of cards. +Cost|1 per card discarded.<hr>When another player plays an Attack card, you may reveal this from your hand. If you do, +2 Cards, then put 2 cards from your hand on top of your deck. "},
{"name":"Secret Passage ","text":" +2 Cards<br>+1 Action<br>Take a card from your hand and put it anywhere in your deck. "},
{"name":"Seer ","text":" +1 Card<br>+1 Action<br>Reveal the top 3 cards of your deck. Put the ones costing from Cost|2 to Cost|4 into your hand. Put the rest back in any order. "},
{"name":"Sentry ","text":" +1 Card<br>+1 Action<br>Look at the top 2 cards of your deck. Trash and/or discard any number of them. Put the rest back on top in any order. "},
{"name":"Settlers ","text":" +1 Card<br>+1 Action<br>Look through your discard pile. You may reveal a Copper from it and put it into your hand. "},
{"name":"Shanty Town ","text":" +2 Actions<br>Reveal your hand. If you have no Action cards in hand, +2 Cards. "},
{"name":"Shepherd ","text":" +1 Action<br>Discard any number of Victory cards, revealing them. +2 Cards per card discarded.<br>''Heirloom: Pasture'' "},
{"name":"Silk Merchant ","text":" +2 Cards<br>+1 Buy<hr>When you gain or trash this, +1 Coffers and +1 Villager. "},
{"name":"Silk Road ","text":" Worth VP|1 for every 4 Victory cards you have (round down). "},
{"name":"Silver ","text":" Cost|2|l "},
{"name":"Sir Bailey ","text":" +1 Card<br>+1 Action<br>Each other player reveals the top 2 cards of their deck, trashes one of them costing from Cost|3 to Cost|6, and discards the rest. If a Knight is trashed by this, trash this. "},
{"name":"Sir Destry ","text":" +2 Cards<br>Each other player reveals the top 2 cards of their deck, trashes one of them costing from Cost|3 to Cost|6, and discards the rest. If a Knight is trashed by this, trash this. "},
{"name":"Sir Martin ","text":" +2 Buys<br>Each other player reveals the top 2 cards of their deck, trashes one of them costing from Cost|3 to Cost|6, and discards the rest. If a Knight is trashed by this, trash this. "},
{"name":"Sir Michael ","text":" Each other player discards down to 3 cards in hand. Each other player reveals the top 2 cards of their deck, trashes one of them costing from Cost|3 to Cost|6, and discards the rest. If a Knight is trashed by this, trash this. "},
{"name":"Sir Vander ","text":" Each other player reveals the top 2 cards of their deck, trashes one of them costing from Cost|3 to Cost|6, and discards the rest. If a Knight is trashed by this, trash this.<hr>When you trash this, gain a Gold. "},
{"name":"Skulk ","text":" +1 Buy<br>Each other player receives the next Hex.<hr>When you gain this, gain a Gold. "},
{"name":"Small Castle ","text":" Trash this or a Castle from your hand. If you do, gain a Castle.<hr>VP|2|l "},
{"name":"Smithy ","text":" +3 Cards "},
{"name":"Smugglers ","text":" Gain a copy of a card costing up to Cost|6 that the player to your right gained on their last turn. "},
{"name":"Soldier ","text":" +Cost|2<br>+Cost|1 per other Attack you have in play. Each other player with 4 or more cards in hand discards a card.<hr>When you discard this from play, you may exchange it for a Fugitive.<br>''(This is not in the Supply.)'' "},
{"name":"Soothsayer ","text":" Gain a Gold. Each other player gains a Curse, and if they did, draws a card. "},
{"name":"Spice Merchant ","text":" You may trash a Treasure from your hand to choose one:<br>+2 Cards and +1 Action; or +1 Buy and +Cost|2. "},
{"name":"Spices ","text":" Cost|2|l<br>+1 Buy<hr>When you gain this, +2 Coffers. "},
{"name":"Spoils ","text":" Cost|3|l<br>When you play this, return it to the Spoils pile.<br>''(This is not in the Supply.)'' "},
{"name":"Sprawling Castle ","text":" VP|4|l<hr>When you gain this, gain a Duchy or 3 Estates. "},
{"name":"Spy ","text":" +1 Card<br>+1 Action<br>Each player (including you) reveals the top card of his deck and either discards it or puts it back, your choice. "},
{"name":"Squire ","text":" +Cost|1<br>Choose one: +2 Actions; or +2 Buys; or gain a Silver.<hr>When you trash this, gain an Attack card. "},
{"name":"Stables ","text":" You may discard a Treasure, for +3 Cards and +1 Action. "},
{"name":"Stash ","text":" Cost|2|l<br>When shuffling, you may look through your remaining deck, and may put this anywhere in the shuffled cards. "},
{"name":"Steward ","text":" Choose one: +2 Cards; or +Cost|2; or trash 2 cards from your hand. "},
{"name":"Stonemason ","text":"Trash a card from your hand. Gain 2 cards each costing less than it.<hr>When you buy this, you may overpay for it. If you do, gain 2 Action cards each costing the amount you overpaid. "},
{"name":"Storeroom ","text":" +1 Buy<br>Discard any number of cards, then draw that many. Then discard any number of cards for +Cost|1 each. "},
{"name":"Storyteller ","text":" +1 Action<br>+Cost|1<br>Play up to 3 Treasures from your hand. Then pay all of your Cost| (including the Cost|1 from this) and draw a card per Cost|1 you paid. "},
{"name":"Survivors ","text":" Look at the top 2 cards of your deck. Discard them or put them back in any order. "},
{"name":"Swamp Hag ","text":"Until your next turn, when any other player buys a card, they gain a Curse. At the start of your next turn: +Cost|3. "},
{"name":"Swashbuckler ","text":" +3 Cards<br>If your discard pile has any cards in it: +1 Coffers, then if you have at least 4 Coffers tokens, take the Treasure Chest. "},
{"name":"Swindler ","text":" +Cost|2<br>Each other player trashes the top card of their deck and gains a card with the same cost that you choose. "},
{"name":"Tactician ","text":" If you have at least one card in hand, discard your hand, and at the start of your next turn, +5 Cards, +1 Action, and +1 Buy. "},
{"name":"Talisman ","text":" Cost|1|l<hr>While this is in play, when you buy a non-Victory card costing Cost|4 or less, gain a copy of it. "},
{"name":"Taxman ","text":"You may trash a Treasure from your hand. Each other player with 5 or more cards in hand discards a copy of it (or reveals they can't). Gain a Treasure onto your deck costing up to Cost|3 more than it. "},
{"name":"Teacher ","text":" Put this on your Tavern mat.<hr>At the start of your turn, you may call this, to move your +1 Card, +1 Action, +1 Buy, or +Cost|1 token to an Action Supply pile you have no tokens on. (When you play a card from that pile, you first get that bonus.)<br>''(This is not in the Supply.)'' "},
{"name":"Temple ","text":" +VP|1<br>Trash from 1 to 3 differently named cards from your hand. Add VP|1 to the Temple Supply pile<hr>When you gain this, take the VP| from the Temple Supply pile. "},
{"name":"Thief ","text":" Each other player reveals the top 2 cards of his deck.<br>If they revealed any Treasure cards, they trash one of them that you choose. You may gain any or all of these trashed cards. They discard the other revealed cards. "},
{"name":"Throne Room ","text":"You may play an Action card from your hand twice. "},
{"name":"Tormentor ","text":" +Cost|2<br>If you have no other cards in play, gain an Imp from its pile. Otherwise, each other player receives the next Hex. "},
{"name":"Torturer ","text":" +3 Cards<br>Each other player either discards 2 cards or gains a Curse to their hand, their choice. (They may pick an option they can't do.) "},
{"name":"Tournament ","text":" +1 Action<br>Each player may reveal a Province from their hand. If you do, discard it and gain any Prize (from the Prize pile) or a Duchy, onto your deck. If no-one else does, +1 Card and +Cost|1. "},
{"name":"Tracker ","text":" +Cost|1<br>Receive a Boon.<hr>While this is in play, when you gain a card, you may put that card onto your deck.<br>''Heirloom: Pouch'' "},
{"name":"Trade Route ","text":" +1 Buy<br>Trash a card from your hand. +Cost|1 per Coin token on the Trade Route mat.<hr>Setup: Add a Coin token to each Victory Supply pile; move that token to the Trade Route mat when a card is gained from that pile. "},
{"name":"Trader ","text":" Trash a card from your hand. Gain a Silver per Cost|1 it costs.<hr>When you would gain a card, you may reveal this from your hand, to instead gain a Silver. "},
{"name":"Trading Post ","text":" Trash 2 cards from your hand. If you did, gain a Silver to your hand. "},
{"name":"Tragic Hero ","text":" +3 Cards<br>+1 Buy<br>If you have 8 or more cards in hand (after drawing), trash this and gain a Treasure. "},
{"name":"Transmogrify ","text":" +1 Action<br>Put this on your Tavern mat.<hr>At the start of your turn, you may call this, to trash a card from your hand, and gain a card to your hand costing up to Cost|1. "},
{"name":"Transmute ","text":" Trash a card from your hand. If it is an…<br>Action card, gain a Duchy<br>Treasure card, gain a Transmute<br>Victory card, gain a Gold "},
{"name":"Treasure Hunter ","text":" +1 Action<br>+Cost|1<br>Gain a Silver per card the player to your right gained on their last turn.<hr>When you discard this from play, you may exchange it for a Warrior.<br>''(This is not in the Supply.)'' "},
{"name":"Treasure Map ","text":" Trash this and a Treasure Map from your hand. If you trashed two Treasure Maps, gain 4 Gold cards onto your deck. "},
{"name":"Treasure Trove ","text":" Cost|2|l<br>When you play this, gain a Gold and a Copper. "},
{"name":"Treasurer ","text":" +Cost|3<br>Choose one: Trash a Treasure from your hand; or gain a Treasure from the trash to your hand; or take the Key. "},
{"name":"Treasury ","text":" +1 Card<br>+1 Action<br>+Cost|1<hr>When you discard this from play, if you didn’t buy a Victory card this turn, you may put this onto your deck. "},
{"name":"Tribute ","text":" The player to your left reveals then discards the top 2 cards of his deck. For each differently named card revealed, if it is an…<br>Action Card, +2 Actions<br>Treasure Card, +Cost|2<br>Victory Card, +2 Cards. "},
{"name":"Trusty Steed ","text":" Choose two: +2 Cards; or +2 Actions; or +Cost|2; or gain 4 Silvers and put your deck into your discard pile. The choices must be different.<br>''(This is not in the Supply)'' "},
{"name":"Tunnel ","text":" VP|2|l<hr>When you discard this other than during Clean-up, you may reveal it to gain a Gold. "},
{"name":"University ","text":" +2 Actions<br>You may gain an Action card costing up to Cost|5. "},
{"name":"Upgrade ","text":" +1 Card<br>+1 Action<br>Trash a card from your hand. Gain a card costing exactly Cost|1 more than it. "},
{"name":"Urchin ","text":" +1 Card<br>+1 Action<br>Each other player discards down to 4 cards in hand.<hr>When you play another Attack card with this in play, you may first trash this, to gain a Mercenary from the Mercenary pile. "},
{"name":"Vagrant ","text":" +1 Card<br>+1 Action<br>Reveal the top card of your deck. If it’s a Curse, Ruins, Shelter, or Victory card, put it into your hand. "},
{"name":"Vampire ","text":" Each other player receives the next Hex.<br>Gain a card costing up to Cost|5 other than a Vampire. Exchange this for a Bat. "},
{"name":"Vassal ","text":" Discard the top card of your deck. If it's an Action card, you may play it. "},
{"name":"Vault ","text":" +2 Cards<br>Discard any number of cards for +Cost|1 each. Each other player may discard 2 cards, to draw a card. "},
{"name":"Venture ","text":" Cost|1|l<br>When you play this, reveal cards from your deck until you reveal a Treasure. Discard the other cards. Play that Treasure. "},
{"name":"Village ","text":" +1 Card<br>+2 Actions "},
{"name":"Villain ","text":" +2 Coffers<br>Each other player with 5 or more cards in hand discards one costing Cost|2 or more (or reveals they can't). "},
{"name":"Villa ","text":" +2 Actions<br>+1 Buy<br>+Cost|1<hr>When you gain this, put it into your hand, +1 Action, and if it's your Buy phase return to your Action phase. "},
{"name":"Vineyard ","text":" Worth VP|1 per 3 Action cards you have (round down). "},
{"name":"Walled Village ","text":" +1 Card<br>+2 Actions<hr>At the start of Clean-up, if you have this and no more than one other Action card in play, you may put this onto your deck. "},
{"name":"Wandering Minstrel ","text":" +1 Card<br>+2 Actions<br>Reveal the top 3 cards of your deck. Put the Action cards back in any order and discard the rest. "},
{"name":"Warehouse ","text":" +3 Cards<br>+1 Action<br>Discard 3 cards. "},
{"name":"Warrior ","text":" +2 Cards<br>Once per Traveller you have in play (including this), each other player discards the top card of ther deck and trashes it if it costs Cost|3 or Cost|4.<hr>When you discard this from play, you may exchange it for a Hero.<br>''(This is not in the Supply.)'' "},
{"name":"Watchtower ","text":" Draw until you have 6 cards in hand.<hr>When you gain a card, you may reveal this from your hand, to either trash that card or put it onto your deck. "},
{"name":"Werewolf ","text":" If it's your Night phase, each other player receives the next Hex. Otherwise, +3 Cards. "},
{"name":"Wharf ","text":" Now and at the start of your next turn: +2 Cards and +1 Buy. "},
{"name":"Wild Hunt ","text":" Choose one: +3 Cards and add VP|1 to the Wild Hunt Supply pile; or gain an Estate, and if you do, take the VP| from the pile. "},
{"name":"Will-o'-Wisp ","text":" +1 Card<br>+1 Action<br>Reveal the top card of your deck. If it costs Cost|2 or less, put it into your hand.<br>''(This is not in the Supply.)'' "},
{"name":"Wine Merchant ","text":" +Cost|4<br>+1 Buy<br>Put this on your Tavern mat.<hr>At the end of your Buy phase, if you have at least Cost|2 unspent, you may discard this from your Tavern mat. "},
{"name":"Wishing Well ","text":" +1 Card<br>+1 Action<br>Name a card, then reveal the top card of your deck. If you named it, put it into your hand. "},
{"name":"Wish ","text":" +1 Action<br>Return this to its pile. If you did, gain a card to your hand costing up to Cost|6.<br>''(This is not in the Supply.)'' "},
{"name":"Witch ","text":" +2 Cards<br>Each other player gains a Curse. "},
{"name":"Woodcutter ","text":" +1 Buy<br>+Cost|2 "},
{"name":"Worker's Village ","text":" +1 Card<br>+2 Actions<br>+1 Buy "},
{"name":"Workshop ","text":" Gain a card costing up to Cost|4. "},
{"name":"Young Witch ","text":" +2 Cards<br>Discard 2 cards. Each other player may reveal a Bane card from their hand; if they don’t, they gain a Curse.<hr>Setup: Add an extra Kingdom card pile costing Cost|2 or Cost|3 to the Supply. Cards from that pile are Bane cards. "},
{"name":"Zombie Apprentice ","text":" You may trash an Action card from your hand for +3 Cards and +1 Action. "},
{"name":"Zombie Mason ","text":" Trash the top card of your deck. You may gain a card costing up to Cost|1 more than it. "},
{"name":"Zombie Spy ","text":" +1 Card<br>+1 Action<br>Look at the top card of your deck. Discard it or put it back. "},
{"name":"Advance ","text":" You may trash an Action card from your hand. If you do, gain an Action card costing up to Cost|6. "},
{"name":"Alms ","text":" Once per turn: If you have no Treasures in play, gain a card costing up to Cost|4. "},
{"name":"Annex ","text":" Look through your discard pile. Shuffle all but up to 5 cards from it into your deck. Gain a Duchy. "},
{"name":"Ball ","text":" Take your –Cost|1 token. Gain 2 cards each costing up to Cost|4. "},
{"name":"Banquet ","text":" Gain 2 Coppers and a non-Victory card costing up to Cost|5. "},
{"name":"Bonfire ","text":" Trash up to 2 cards you have in play. "},
{"name":"Borrow ","text":" Once per turn: +1 Buy. If your –1 Card token isn't on your deck, put it there and +Cost|1. "},
{"name":"Conquest ","text":" Gain 2 Silvers. +VP|1 per Silver you've gained this turn. "},
{"name":"Delve ","text":" +1 Buy<br>Gain a Silver. "},
{"name":"Dominate ","text":" Gain a Province. If you do, +VP|9. "},
{"name":"Donate ","text":" After this turn, put all cards from your deck and discard pile into your hand, trash any number, shuffle your hand into your deck, then draw 5 cards. "},
{"name":"Expedition ","text":" Draw 2 extra cards for your next hand. "},
{"name":"Ferry ","text":" Move your –Cost|2 cost token to an Action Supply pile. (Cards from that pile cost Cost|2 less on your turns, but not less than Cost|0.) "},
{"name":"Inheritance ","text":" Once per game: Set aside a non-Victory Action card from the Supply costing up to Cost|4. Move your Estate token to it. (Your Estates gain the abilities and types of that card.) "},
{"name":"Lost Arts ","text":" Move your +1 Action token to an Action Supply pile. (When you play a card from that pile, you first get +1 Action.) "},
{"name":"Mission ","text":" Once per turn: If the previous turn wasn't yours, take another turn after this one, during which you can't buy cards. "},
{"name":"Pathfinding ","text":" Move your +1 Card token to an Action Supply pile. (When you play a card from that pile, you first get +1 Card.) "},
{"name":"Pilgrimage ","text":" Once per turn: Turn your Journey token over (it starts face up); then if it's face up, choose up to 3 differently named cards you have in play and gain a copy of each. "},
{"name":"Plan ","text":" Move your Trashing token to an Action Supply pile. (When you buy a card from that pile, you may trash a card from your hand.) "},
{"name":"Quest ","text":" You may discard an Attack, two Curses, or six cards. If you do, gain a Gold. "},
{"name":"Raid ","text":" Gain a Silver per Silver you have in play. Each other player puts their –1 Card token on their deck. "},
{"name":"Ritual ","text":" Gain a Curse. If you do, trash a card from your hand. +VP|1 per Cost|1 it cost. "},
{"name":"Salt the Earth ","text":" +VP|1<br>Trash a Victory card from the Supply. "},
{"name":"Save ","text":" Once per turn: +1 Buy. Set aside a card from your hand, and put it into your hand at end of turn (after drawing). "},
{"name":"Scouting Party ","text":" +1 Buy<br>Look at the top 5 cards of your deck. Discard 3 and put the rest back in any order. "},
{"name":"Seaway ","text":" Gain an Action card costing up to Cost|4. Move your +1 Buy token to its pile. (When you play a card from that pile, you first get +1 Buy.) "},
{"name":"Summon ","text":" Gain an Action card costing up to Cost|4. Set it aside. If you did, then at the start of your next turn, play it. "},
{"name":"Tax ","text":" Add Debt|2 to a Supply pile.<hr>Setup: Add Debt|1 to each Supply pile. When a player buys a card, they take the Debt from its pile. "},
{"name":"Trade ","text":" Trash up to 2 cards from your hand. Gain a Silver per card you trashed. "},
{"name":"Training ","text":" Move your +Cost|1 token to an Action Supply pile. (When you play a card from that pile, you first get +Cost|1.) "},
{"name":"Travelling Fair ","text":" +2 Buys<br>When you gain a card this turn, you may put it onto your deck. "},
{"name":"Triumph ","text":" Gain an Estate. If you did, +VP|1 per card you've gained this turn. "},
{"name":"Wedding ","text":"3 "},
{"name":"Windfall ","text":" If your deck and discard pile are empty, gain 3 Golds. "},
{"name":"Bad Omens ","text":" Put your deck into your discard pile. Look through it and put 2 Coppers from it onto your deck (or reveal you can't). "},
{"name":"Delusion ","text":" If you don't have Deluded or Envious, take Deluded. "},
{"name":"Envy ","text":" If you don't have Deluded or Envious, take Envious. "},
{"name":"Famine ","text":" Reveal the top 3 cards of your deck. Discard the Actions. Shuffle the rest into your deck. "},
{"name":"Fear ","text":" If you have at least 5 cards in hand, discard an Action or Treasure (or reveal you can't). "},
{"name":"Greed ","text":" Gain a Copper onto your deck. "},
{"name":"Haunting ","text":" If you have at least 4 cards in hand, put one of them onto your deck. "},
{"name":"Locusts ","text":" Trash the top card of your deck. If it's Copper or Estate, gain a Curse. Otherwise, gain a cheaper card that shares a type with it. "},
{"name":"Misery ","text":" If this is your first Misery this game, take Miserable. Otherwise, flip it over to Twice Miserable. "},
{"name":"Plague ","text":" Gain a Curse to your hand. "},
{"name":"Poverty ","text":" Discard down to 3 cards in hand. "},
{"name":"War ","text":" Reveal cards from your deck until revealing one costing Cost|3 or Cost|4. Trash it and discard the rest. "},
{"name":"Aqueduct ","text":" When you gain a Treasure, move VP|1 from its pile to this. When you gain a Victory card, take the VP| from this.<hr>Setup: Put VP|8 on the Silver and Gold piles. "},
{"name":"Arena ","text":" At the start of your Buy phase, you may discard an Action card. If you do, take VP|2 from here. — Setup: Put VP|6 here per player. "},
{"name":"Bandit Fort ","text":" When scoring, VP|-2 for each Silver and each Gold you have. "},
{"name":"Basilica ","text":" When you buy a card, if you have Cost|2 or more left, take VP|2 from here.<hr>Setup: Put VP|6 here per player. "},
{"name":"Baths ","text":" When you end your turn without having gained a card, take VP|2 from here.<hr>Setup: Put VP|6 here per player. "},
{"name":"Battlefield ","text":" When you gain a Victory card, take VP|2 from here.<hr>Setup: Put VP|6 here per player. "},
{"name":"Colonnade ","text":" When you buy an Action card, if you have a copy of it in play, take VP|2 from here.<br>Setup: Put VP|6 here per player. "},
{"name":"Defiled Shrine ","text":" When you gain an Action, move VP|1 from its pile to this. When you buy a Curse, take the VP| from this.<hr>Setup: Put VP|2 on each non-Gathering Action Supply pile. "},
{"name":"Fountain ","text":" When scoring, VP|15 if you have at least 10 Coppers. "},
{"name":"Keep ","text":" When scoring, VP|5 per differently named Treasure you have, that you have more copies of than each other player, or tied for most. "},
{"name":"Labyrinth ","text":" When you gain a 2nd card in one of your turns, take VP|2 from here.<hr>Setup: Put VP|6 here per player. "},
{"name":"Mountain Pass ","text":" When you are the first player to gain a Province, after that turn, each player bids once, up to Debt|40, ending with you. High bidder gets +VP|8 and takes the Debt they bid. "},
{"name":"Museum ","text":" When scoring, VP|2 per differently named card you have. "},
{"name":"Obelisk ","text":" When scoring, VP|2 per card you have from the chosen pile.<hr>Setup: Choose a random Action Supply pile. "},
{"name":"Orchard ","text":" When scoring, VP|4 per differently named Action card you have 3 or more copies of. "},
{"name":"Palace ","text":" When scoring, VP|3 per set you have of Copper - Silver - Gold. "},
{"name":"Tomb ","text":" When you trash a card, +VP|1. "},
{"name":"Tower ","text":" When scoring, VP|1 per non-Victory card you have from an empty Supply pile. "},
{"name":"Triumphal Arch ","text":" When scoring, VP|3 per copy you have of the 2nd most common Action card among your cards (if it’s a tie, count either). "},
{"name":"Wall ","text":" When scoring, VP|-1 per card you have after the first 15. "},
{"name":"Wolf Den ","text":" When scoring, VP|-3 per card you have exactly one copy of. "},
{"name":"Academy ","text":" When you gain an Action card, +1 Villager. "},
{"name":"Barracks ","text":" At the start of your turn, +1 Action. "},
{"name":"Canal ","text":" During your turns, cards cost Cost|1 less, but not less than Cost|0. "},
{"name":"Capitalism ","text":" During your turns, Actions with +Cost| amounts in their text are also Treasures. "},
{"name":"Cathedral ","text":" At the start of your turn, trash a card from your hand. "},
{"name":"Citadel ","text":" The first time you play an Action card during each of your turns, play it again afterward. "},
{"name":"City Gate ","text":" At the start of your turn, +1 Card, then put a card from your hand onto your deck. "},
{"name":"Crop Rotation ","text":" At the start of your turn, you may discard a Victory card for +2 Cards. "},
{"name":"Exploration ","text":" At the end of your Buy Phase, if you didn't buy any cards, +1 Coffers and +1 Villager. "},
{"name":"Fair ","text":" At the start of your turn, +1 Buy. "},
{"name":"Fleet ","text":" After the game ends, there's an extra round of turns just for players with this. "},
{"name":"Guildhall ","text":" When you gain a Treasure, +1 Coffers. "},
{"name":"Innovation ","text":" The first time you gain an Action card in each of your turns, you may set it aside. If you do, play it. "},
{"name":"Pageant ","text":" At the end of your Buy Phase, you may pay Cost|1 for +1 Coffers. "},
{"name":"Piazza ","text":" At the start of your turn, reveal the top card of your deck. If it's an Action, play it. "},
{"name":"Road Network ","text":" When another player gains a Victory card, +1 Card. "},
{"name":"Sewers ","text":" When you trash a card other than with this, you may trash a card from your hand. "},
{"name":"Silos ","text":" At the start of your turn, discard any number of Coppers, revealed, and draw that many cards. "},
{"name":"Sinister Plot ","text":" At the start of your turn, add a token here, or remove your tokens here for +1 Card each. "},
{"name":"Star Chart ","text":" When you shuffle, you may pick one of the cards to go on top. "},
{"name":"Deluded ","text":" At the start of your Buy phase, return this, and you can't buy Actions this turn. "},
{"name":"Envious ","text":" At the start of your Buy phase, return this, and Silver and Gold make Cost|1 this turn. "},
{"name":"Lost in the Woods ","text":" At the start of your turn, you may discard a card to receive a Boon. "},
{"name":"Miserable ","text":" VP|-2|l "},
{"name":"Twice Miserable ","text":" VP|-4|l "},
