{"cards":[
{"name":"Ambassador","nicename":"ambassador","history":" Originally this had you pass cards directly to the other players (or they took them from the supply if you didn't have enough). It was simpler to have them go to the supply first. That version also let you get rid of one card per player, but that was too much in 4-player games, so now it only lets you get rid of two cards at once.\nAmbassador is one of the oldest cards in the set. Five cards remain pretty recognizable from the earliest version of this expansion - Ambassador, Haven, Merchant Ship, Outpost, and Wharf. Cutpurse and Sea Hag have related cards but changed more significantly."},
{"name":"Bazaar","nicename":"bazaar","history":" A vanilla card. It was in a later set, and I moved it here to have another Village. We accidentally got two illustrations for Market; this card has the one that isn't on Market."},
{"name":"Caravan","nicename":"caravan","history":" A card from pre-development but after Jay had picked up the game. For a long time you actually set a card aside when playing it, and then drew that card next turn. That way was a little more flavorful, but the published version is slightly simpler."},
{"name":"Cutpurse","nicename":"cutpurse","history":" This started out as \"Cards cost $1 less this turn, then $1 more until your next turn.\" That doesn't have the same timing as the other duration cards - it goes away at the end of the previous player's turn, rather than at the end of your turn. The developers didn't like that. I replaced it with \"+$2, name a treasure card, each other player discards it.\" That was quite strong. You don't have to discard Gold very many times before you're sick of it. I reined it in by having it only hit Copper. It's still quite annoying if multiples get played against you early on."},
{"name":"Embargo","nicename":"embargo","history":" This was originally \"+1 Card, +1 Action, Choose an action or treasure pile, other players can't buy it until your next turn.\" This had the same non-standard timing deal that Cutpurse had. It also sometimes had a tracking issue. So I replaced it with a version that went on a pile and made you get Curses for buying that card. I like that it doesn't shut you out; you can still buy the card, you just have to decide if it's worth a Curse. And this way it can go on any pile. For a while the Embargo card itself went on the pile, but in the end we switched to tokens, which don't cover up the pile, and create fewer questions."},
{"name":"Explorer","nicename":"explorer","history":" At first this did nothing unless you revealed a Victory card. If it was a Province you got Gold, otherwise Silver. That version wasn't good enough, and eventually I dropped the requirement - you get Silver even if you don't reveal anything."},
{"name":"Fishing Village","nicename":"fishing-village","history":" This was temporarily in the 3rd expansion. When I decided I wasn't just going to put \"next turn\" stuff everywhere, it moved here. For most of its life it gave you +2 actions next turn (and was otherwise the same). This was a card the developers cited as too good, and I just nudged it down by dropping it to +1 action next turn. It makes it worse in the situations where it was at its best. It is still plenty popular as is."},
{"name":"Ghost Ship","nicename":"ghost-ship","history":" This used to say \"3 or fewer,\" but that confused people. There probably was never going to be anything to make that \"or fewer\" matter anyway. I was just automatically accounting for who knows what."},
{"name":"Haven","nicename":"haven","history":" This left the set during development, as the developers didn't want there to be too many duration cards. They thought this was too close to Caravan, and I picked this to go as I thought Caravan contributed more. Late in development it turned out that we could fit 26 cards - I had thought that Native Village etc. would use cards for the playmats, but they have full-on playmats. This was the obvious choice to fill the last slot. It had been popular and had been tested and everything."},
{"name":"Island","nicename":"island","history":" I made this during development to replace another victory card that didn't work out. I had tried a couple other ways to get a victory card out of your deck in later sets, but this was the first version tested for Seaside."},
{"name":"Lighthouse","nicename":"lighthouse","history":" At the start of development, the set had no reactions. Dale wanted one and I produced a duration version of Moat. It had to have a \"next turn\" ability of some sort, in order to not have the timing problem of the original Cutpurse. I tried \"now and next turn, +$1,\" but using up your action just hurt the card too much. The thing is, Moat doesn't use up your action when you just stop an attack with it. You can flash the Moat, and then on your turn Remodel it or play something else. Lighthouse you had to play or it did no Moating. So it really had to have +1 Action. When I added the +1 Action, I also tried \"+$2 next turn\" rather than +$1 each turn, but that was too good."},
{"name":"Lookout","nicename":"lookout","history":" A late replacement for a one-shot Chapel variant that didn't work out. It seems cute to have a Chapel that doesn't stay in your deck, but the card as it stood was both really unsexy and also too powerful. It had to get sexier while at the same time getting worse. That's not so easy. A better solution was to just replace it, which is what happened. Lookout started out putting one card into your hand rather than having you discard one. That was just insane, and it quickly got cut down to size."},
{"name":"Merchant Ship","nicename":"merchant-ship","history":" An old card that never changed."},
{"name":"Native Village","nicename":"native-village","history":" Originally this had you unable to look at the set aside cards. Celebrity guest playtester Richard Garfield at first misplayed this to let you look at the cards, then suggested, hey, why not change it so you can. We tried it both ways and well it was close. In the end I felt like serious players might actually prefer not being able to peek. However being able to peek made the card a little more powerful (so serious players would play it more), and, I felt, a little more attractive to casual players, who don't want to be counting cards so much. As you can see we went with peeking."},
{"name":"Navigator","nicename":"navigator","history":" Originally this didn't let you reorder the cards, but I thought that would be something the developers would want changed, since they'd behaved similarly on similar stuff. You know, so you don't have to carefully keep the order the same. Anyway they didn't actually complain about this one but I changed it to let you reorder the cards anyway. It makes the card marginally more powerful."},
{"name":"Outpost","nicename":"outpost","history":" This underwent a bunch of changes to the text, while keeping the functionality fairly close. The issues were 1) it had to not be too confusing; 2) it couldn't let you get infinite turns; 3) in fact even 3-4 turns in a row is no good; 4) it had to have clear and fair interactions with Throne Room and Tactician. Throne Room was tricky. There was an evening where I spent a few hours discussing possible wordings with Chris West, and at one point it was like, man, this is work. Those of you who think game design is all good times: sometimes you have to spend hours rewording Outpost. Anyway the best possible wording was to have you take a normal turn, but discard 2 cards at the start of it. That was just too powerful though. I tried not having an anti-recursion clause once and immediately got infinite turns with it. I also tried having you draw 2 fewer cards for each extra turn. In the end it got a brutal \"This can't cause you to take more than 2 consecutive turns.\" That just guarantees no shenanigans."},
{"name":"Pearl Diver","nicename":"pearl-diver","history":" Borrowed from a later expansion to replace Haven. Nothing changed during testing but the name."},
{"name":"Pirate Ship","nicename":"pirate-ship","history":" This started out as a victory card that was worth more points based on how much treasure you stole with it. It was an actual flavor-based design - what would pirates do? That version seemed cool but just wasn't played often enough. At the same time I was replacing Treasury, and one of the possibilities I was considering was \"choose one - gain a counter, or +$1 per counter.\" I realized I could graft that onto the Thieving of Pirate Ship and that's what happened. Originally you used trashed treasures to track the value of the Pirate Ships, but near the end it switched to counters, which is slightly simpler, as you might have trashed some $2's and $3's, but they still just count as $1 here."},
{"name":"Salvager","nicename":"salvager","history":" A fairly old card which never changed functionally."},
{"name":"Sea Hag","nicename":"sea-hag","history":" Way back when there was a card like \"trash the top card of each other player's deck; they each gain a Confusion card, putting it on their deck.\" Confusion was like Curse but without the -1 vp. Confusion left the main set due to not being different enough from Curse (and also because it required 30 more cards to handle it). So all of the Confusion-giving cards vanished or were changed. It may not even be correct to say that that card inspired this one. Anyway eventually I tried Curse-to-deck-top elsewhere, then moved it here as I wanted another attack and it fit the next turn theme. The discarding is just there so that multiple Sea Hags don't leave you with a stack of Curses on top of your deck."},
{"name":"Smugglers","nicename":"smugglers","history":" This started life as \"+$2. Cards the previous player bought cost $1 less this turn,\" in the 4th expansion. It was okay, but the bonus just didn't come up often enough to be exciting. So I replaced it with this better way to care about what the previous player bought. I tried it as \"up to $5\" but it really needed to go to $6. The best thing about the card is when the previous player buys a card you don't really want, but you can't pass up the opportunity to take one, and it ends up warping your deck."},
{"name":"Tactician","nicename":"tactician","history":" Once, this cost $3, and had no anti-Throne Room clause (the \"if you discarded\" part). In development it cost $4, and was singled out as one of the strongest cards. At $5 it still got plenty of play. The anti-Throne clause was added quite late. Tactician was looking strong but doable at that point, except for the Throne Room combo, which was ridiculous. It's sad to just nuke a combo like that, but that change didn't hurt the card much otherwise - okay, if you draw Tactican and four Festivals, you only play three of them - and this way we get to have the card at its best."},
{"name":"Treasure Map","nicename":"treasure-map","history":" This originally came from the ruins of the 7th expansion. I moved it just because of the name. How do you not do a Treasure Map in your Seaside expansion? The first version only gained you three Golds, and didn't put them on top. It looked cute but was not a real strategy. Putting the Golds on top helped tie it in with the next turn theme, and upping them to four made the card good enough to actually go for."},
{"name":"Treasury","nicename":"treasury","history":" This replaced a card that had rules problems. I eventually figured out a way to deal with the problems, but not in time for it to make the set. It will make it somewhere else eventually."},
{"name":"I considered various things for a replacement, eventually settling on a card that you can have every turn if you want, which had been something I'd been meaning to get into the set but hadn't. Instead of sitting in play, it replaces itself (+1 Card +1 Action) and goes back on top of your deck each turn. The \"but not if you bought a Victory card\" clause keeps it more interesting and fairer. I had a version that you trashed when you bought a Victory card, but it was fine to let you keep it.","nicename":"","history":"I considered various things for a replacement, eventually settling on a card that you can have every turn if you want, which had been something I'd been meaning to get into the set but hadn't. Instead of sitting in play, it replaces itself (+1 Card +1 Action) and goes back on top of your deck each turn. The \"but not if you bought a Victory card\" clause keeps it more interesting and fairer. I had a version that you trashed when you bought a Victory card, but it was fine to let you keep it."},
{"name":"Warehouse","nicename":"warehouse","history":" I added this during development, replacing uh some other card that left. Several cards left, so there's not always a one-to-one correspondence there. It replaced something. We tried a few versions of this, all with +1 Action and then some different kind of Cellar-like effect. The first version had you discard any number of cards, then get your choice of two cards per card discarded. That was ridiculous and didn't seem doable on a card costing $3-$4, which is what I was looking for. Discard 2, draw 4, discard 2 came next. Then draw 4 discard 4, and finally the draw 3 discard 3 it ended up with."},
{"name":"Wharf","nicename":"wharf","history":" The original version didn't have the +1 Buy. It got that to compare more favorably to Merchant Ship."},
{"name":"Alchemist","nicename":"alchemist","history":" This replaced another unrelated card late in the going. I tried a card that just increased your hand size for the rest of the game, but that would have required a playmat, and the set couldn't have any. This is the next best thing, and more interesting due to the Potion requirement. I tried a few variations that also attacked, but Scrying Pool ended up being the wordy extra attack I needed. As we shall see!"},
{"name":"Apothecary","nicename":"apothecary","history":" The original version of this had you discard the other cards, rather than put them on your deck. Some people really disliked that. Seeing their good cards go by. This version not only solved that problem, it's better all around."},
{"name":"Apprentice","nicename":"apprentice","history":" This started out in another set, without the potion part. It seemed like a good fit for this set, so I moved it here, first at $3+P. At that cost it was slow to get going, and eventually I put it back at $5. The potion part makes it seem less sad when you are playing an Alchemy-heavy game, and also answers the question \"what does it do with potion costs\" right on the card."},
{"name":"Familiar","nicename":"familiar","history":" This started out at $4+P. It seemed like it would be fine at $3+P, so I lowered it. Then we tried a version where you picked a card and everyone else gained it. That would sometimes be political (as Wei-Hwa pointed out), where you picked a victory card to end the game and not everyone got one. So I changed it to \"non-victory card.\" But then it was like, once the Curses ran out, you emptied however many piles you had to to end the game. It was not something the card needed. So, back to the original."},
{"name":"Golem","nicename":"golem","history":" I tried several cards for this slot, but once I tried this one it didn't change. I considered having a Homunculus instead in this slot. Homunculi are specifically alchemy-related. But a Homunculus is a small guy, and I already had Familiar for that. I wanted a big guy, dumbly performing tasks."},
{"name":"Herbalist","nicename":"herbalist","history":" This started out in Prosperity, in a slightly more complex form. This set needed a $2 with +1 buy, to help support potions, and it had one. Some people complained about it though, 1) for being boring, although man, you need some simple cards here and there, and 2) for being the only card in the set that had nothing to do with potions. So we tried out this one to replace it and it seemed fine. Some people preferred the old one though. People seemed about 50-50 on it. I was 50-50 on it. In the end I felt like this card would be more interesting in this set than in most sets, and the other card could just go anywhere."},
{"name":"Philosopher’s Stone","nicename":"philosophers-stone","history":" This started out as an action, \"+1 Buy, +$1 per 4 cards left in your deck.\" It was in the original Alchemy, but I considered it for the main set at one point (when Gardens moved there). Eventually I brought it back as a treasure. First it counted cards left in your deck. Some people don't like how huge the variance is on that though. I can make a card here and there like that, but not too many. I dropped it, then later brought it back with \"put your deck into your discard pile\" (and then it counted your discard pile). That still had high variance, a different way; you might draw it immediately after shuffling, which was a lot better than not drawing it immediately. Finally I changed it to how it is now. The random element is completely gone; it still isn't consistent, due to card-drawing and such, but that's your own problem."},
{"name":"Possession","nicename":"possession","history":" Originally this had you take a turn in which you drew cards from another player's deck. It was much simpler rules-wise to have them take the turn, with you stealing the cards they gain. That may sound funny given that Possession has a longer FAQ than any other card will ever have (for those of you reading this who haven't seen the rulebook: it's over a page long). The FAQ is ridiculous, but it's still a FAQ; most of the time, you are covered just reading the card, and the most common thing you will want to know is, \"what if I make someone play Possession while I'm Possessing them?\" (they get to possess someone, not you). But it was an exotic card that required a lot of FAQ. There was some question as to whether or not it was worth it and well I always thought it was. One other thing changed about the card: originally you possessed to the left, then to the right, and now it's left again. Wei-Hwa pointed out that going left created a kingmaker situation with Masquerade in games with 3+ players - you can make someone pass a Province to someone else. There is no kingmaker situation to the right - you make them pass the Province to you. Going right is more weird though. When Jay got the file he said, really? The player to your right? The games where it matters aren't so common, so it ended up going left after all. Watch out in games with Possession and Masquerade (yes, and Ambassador)."},
{"name":"Potion","nicename":"potion","history":" This is the same card as ever. I put it at $4 because none of the cards that are always out cost $4. Originally the pile was 12 cards. There was room for 16 so there are 16. Twelve is probably enough, but it's nice to have a few extras just in case."},
{"name":"Scrying Pool","nicename":"scrying-pool","history":" This started out costing $3, without the Spy part. That version was ridiculous. It seemed like it would work with potion in the cost though. And it did! Then an attack in the set didn't work out, and the card I wanted to replace it with wasn't an attack. The names had already been sent to the artists, due to the tight schedule; I had to pick something else in the set and graft an attack onto it, and it had to be something where the name made some sort of sense with that. Scrying Pool was that card. I grafted Spy onto it and well there it is. It's a decent fit, as the rest of the card cares about the top of your deck, and it's Spy with the spying before the drawing, which is something. It's pretty wordy though, and I didn't realize that some people would look at this and think \"oh it's a Spy variant\" rather than \"oh it draws you lots of actions and I guess also spies.\" It's not just a Spy variant guys. There is a mistake in the FAQ for this card. There's the bit where it explains what happens if you run out of cards before finding your non-action, only it says \"action\" instead. The card itself has it right. The Korean translator found this mistake; you other translators could learn a lot from that guy. Actually I think the German translator also found something, but he found his thing in time for us to fix it. The Korean translator could learn a lot from him."},
{"name":"Transmute","nicename":"transmute","history":" This slot started out with a Remodel variant that was like the middle ground between two other Remodel variants that hope one day to come out. It seemed like it must be too close to one or the other, so I replaced it with this exotic Remodel. After that the only change to this one was dropping from $2+P to P. When the card images were made, the question came up, should this (and Vineyard) have a 0 coin on it or what? I had never had the 0. My feeling is, if there's no cost to a card at all, you need a 0 where the cost is, to make it clear that you mean for the card to be free. If there's a cost, you don't need that. Transmute has a cost: a potion. It didn't need a 0 too. Anyway we looked at it both ways and both Jay and I preferred it with no 0 and so no 0 it was."},
{"name":"University","nicename":"university","history":" I tried this in another set long ago, in a broken form. This was a later addition to this set, to supplement the \"cares about actions\" sub-theme. First it was \"+2 Actions. Gain an Action card,\" which looks so pretty, but was nuts whenever a good expensive action was out, like say Possession. Then I tried \"+2 Actions. You may reveal an Action card from your hand. If you do, gain a copy of it.\" While that can gain you Nobles or Possession on occasion, overall it was weaker than the final version."},
{"name":"Vineyard","nicename":"vineyard","history":" This was originally in the main set! And Gardens was in Alchemy (with the costs switched). I moved Gardens into the main set because it was easier to go for. I moved Vineyard to another set, but when the time came I wanted it here after all."},
{"name":"Fairgrounds","nicename":"fairgrounds","history":" I wanted a victory card in the set, because I always do. My ideas list had two cards that seemed especially promising, and the other one fit the hand theme, but it didn't work out. So I put this one in, with no idea that it would end up defining the set. The first version cost $6 and was worth 1 VP per 3 differently named cards in your deck. Then it cost $5. Briefly there was, cost $6, worth $1 for every 2 differently named cards in your deck, other than Copper and Estate. John Vogel suggested the formula it actually has. There was some debate about what formula was perfect (especially with Tom Lehmann and Wei-Hwa Huang), but the important thing was, that you had sufficient incentive to collect everything."},
{"name":"Farming Village","nicename":"farming-village","history":" I had previously tried a card that drew you an action or treasure but did nothing else (just +1 Action), for $2 in another set. It was fine but there was no room for it there in the end. I moved it here as a Village."},
{"name":"Fortune Teller","nicename":"fortune-teller","history":" The first version also dug for an action for the top of your own deck. That was too strong. Also it had a dash in the title. And it didn't stop on Curses, but obv. a Fortune Teller should be able to predict that you'll be Cursed."},
{"name":"Hamlet","nicename":"hamlet","history":" A simple card from the hand theme days that survived unchanged."},
{"name":"Harvest","nicename":"harvest","history":" Once I had the variety theme, I had to make some cards that really highlighted it. I tried drawing cards until you hit a duplicate, and then I tried getting all the non-duplicates from your top 5 cards. Giving you $ instead of the cards was what worked out."},
{"name":"Horn of Plenty","nicename":"horn-of-plenty","history":" Long ago, Intrigue had a card that read, \"+$1 per Action card you've played this turn.\" It cost $4. This was popular with a certain kind of player. But many games it was useless - you needed a bunch of pieces to put together this puzzle - and then some games it was unbeatable. You would get staggering amounts of coins out of it, with +buys from something to make them count. Some people defended it, but I killed it. I could always try to fix it up later; there was no reason to give Intrigue a broken/useless card. Intrigue got Conspirator instead, which has a hint of the original premise.\nI tried a new version in a later set: \"+2 Actions +1 Buy. While this is in play, when you play another Action card, +$1.\" For $5. The idea was to provide some of what you needed with the original card, so that it was playable in more games, while weakening it in the games where it was good. You've got extra actions and a +buy up front... but it doesn't count Actions already played, only ones played after it. You can't draw your whole deck and finally draw it and play it and yeeha. Anyway this too was broken. I tried several things, including a version that only counted differently named cards. Eventually I gave up on it.\nThe solution in the end was to make it a Workshop variant. You don't get to combine the money with your other money. It doesn't use up your buy though. To be good enough and not fluctuate too much, it had to count your treasures too. At first it was an action with an effect delayed until the end of your buy phase, but I turned it into a treasure worth $0. Some people just liked that there was a treasure worth $0, I don't know what to tell you. So it doesn't use an action, and works with treasures naturally. This version was still sometimes too strong, so it got the \"trash it if gained VP\" clause.\nI had called the treasure version Produce, which was a cute pun which would be lost in foreign versions. Cornucopia seemed like a good name for it, so I took that name off of a Prosperity card (Royal Seal). Then Jay preferred that name for the expansion, which I'd been calling Harvest Festival, so I had to rename this again. I called it Horn of Plenty, which is not only a synonym for Cornucopia, it's a literal translation of it. Once again creating trouble for translators."},
{"name":"Horse Traders","nicename":"horse-traders","history":" Seaside originally had a reaction that drew you a card when attacked. It died because it needed a messy phrasing to stop you from drawing your deck with it on one attack, after reactions changed to staying in your hand. But I had big plans to one day revive it with that messy phrasing.\nI first tried it out in this set on a Village. I changed it to the money/discard thing in order to better fit the expansion theme. When I changed the theme I still liked the card so I kept it.\nPrior to making $3, it made $1 per 2 cards in your hand (no discarding), fitting the dead theme even better. That was too scary with card-drawing combos and lackluster without them.\nThere was significant debate over whether or not it should be cumulative - should it work against multiple attacks per round. For me there was no question. Originally it was cumulative. There would be games where somebody just randomly bought lots of attacks anyway, and the person with the most Horse Traders won. It's plenty of bonus without being cumulative."},
{"name":"Hunting Party","nicename":"hunting-party","history":" I stole this from a later set once I had the variety theme. The first version drew you two cards you didn't have in your hand; that of course changed to drawing one random card, plus one card not in your hand. This makes it faster to resolve and fairer."},
{"name":"Jester","nicename":"jester","history":" Back when, there were cards like \"trash the top card of each other player's deck.\" They died due to 1) being weak (hitting Copper all the time), 2) being swingy (hitting your Copper and someone else's Province), and 3) possibly reducing everyone's deck to 5 cards with no escape. In those days, Alchemy had the opposite card - \"Each other player reveals the top card of his deck. Gain a copy of one of those cards.\" This was also weak and swingy, and died around the same time.\nI always had plans to fix it up though, and with Cornucopia got around to doing it. Jester lets you give them the card, so you don't mind hitting Copper as much, and it gives out Curses for VP cards, so as not to be so swingy. Of course you can gain multiple cards, which makes it swingy again. Jester gets crazy with five players and well if a card's going to get crazy with five players, it might as well be a fun one."},
{"name":"Menagerie","nicename":"menagerie","history":" This came from Prosperity. The first version gave you $1 per differently named card in your hand. I tried a few versions of that, but it needed to be a threshold instead to work out. It ended up like the printed card, only with +2 cards instead of +3 cards. Then it got squeezed out of Prosperity due to Prosperity's particular requirements for cheap cards. I slotted it right into Cornucopia, and fixed it up by making it twice as good. It helped create the variety theme despite being in the set to support the hand theme."},
{"name":"Remake","nicename":"remake","history":"  This never changed. It was just a cute Remodel variant, but ended up supporting the variety theme, by helping you get that variety."},
{"name":"Tournament","nicename":"tournament","history":"Long ago, when working on what at the time was going to be the 4th expansion, with a player interaction theme, I hit on the idea of caring about whether or not people had bought Provinces. I made two cards with this concept. The first turned into Trade Route, and migrated into Prosperity when I split up the player interaction cards (every set needed those cards). The second soon became $4, \"Each player may reveal a Province from his hand. If you do, +3 Cards. If no-one else does, +3 Cards.\" So you got 0, 3, or 6 cards, depending. I moved it into Alchemy, then moved it from there to Prosperity, where revealing a Province was an extra-cute condition.\n    It had a certain charm, but was a dud for some people. The problem was, a lot of the time, it was Smithy. It just didn't play differently enough from Smithy to be interesting. So it left Prosperity and was consigned to the limbo of promising ideas to work on later.\n    When I started working on Cornucopia, I tried it again, as something that fit the hand theme. The dull part was the card-drawing, so I had to replace that. The version I tried cost $5, and was, \"Each player may reveal a Province card from his hand. If you do, gain a Treasure. If no-one else does, gain an Action card.\" It's fun to just say \"gain an Action card,\" no qualifiers, but it doesn't work. We played one game with this and Possession. I got six Possessions and lost. Possession was typically not as good as Workshop, as everyone crammed their decks full of VP cards. Another insane thing was using it to gain copies of itself and Golems, then using the Golems to dig it up and do this more. You would have turns where you gained a pile of cards and then played them all. Anyway these games are fun once, but that's that. I killed the card again.\n    So a while later, I was working on the set, and realized I could push variety by actually adding more cards to the game. I had cards that cared if you had variety, and some cards helped you get that variety, but nothing increased the total amount of variety possible.\n    The first thing to try was a Black Market variant. Black Market came up a lot as a card that was cool with this expansion. Why not make a new one? And I could fix all of the problems Black Market had. Instead of buying a card in your Action phase, it would gain you a card directly. Instead of having to build a Black Market Deck, it would just come with one pre-built. Then that deck could be new cards, which was nice too, especially for a small expansion, although it could only be five cards, because that's how much space there was.\n    Tournament's province-revealing mechanic was perfect for this. And so it came to pass. I made a Black Market variant, that came with the cards you gained from it, that gained you the cards directly, via revealing a Province. There were still some things to work out though.\n    You got your Prize for revealing Province yourself, so that it wouldn't happen right away, and it went on your deck, so you'd draw it before the game was over. What did you get if they didn't stop you? At first it was a Silver, which was obviously bad. Steve Wampler suggested that it be something involving drawing a card, so that you'd get your Prize that turn if you had Province and no-one else did. I went with Peddler - +1 Action +1 Card +$1. That had the problem though of, if someone revealed Province, you didn't get +1 Action, and couldn't play another card. You'd have turns where you stared at your hand, deciding whether or not to risk playing Tournament. That was no fun, so, you always get the +1 Action.\n    Another thing was the booby prize. Originally it was Silver. That was unimpressive, but was there for a bit before turning into Duchy.\n    Originally you didn't discard the Province you revealed, but winning multiple Tournaments in a turn was too much. It's still possible of course, just harder.\nAnd finally there are the Prizes themselves. There were always five; that's just how much space was left, and was a fine number anyway. I was not going to take out a card so I could have sixteen Prizes. They always cost $0. They need a cost because some cards care about card costs. There are various arguments for why they should have what cost, but I think a crucial one in favor of $0* is, that it makes it extra clear that you cannot actually buy them. I also like that you don't think, \"oh man the correct play is to Remodel my prize.\"\n    The Prizes wanted to be cards that I wasn't \"wasting\" as Prizes. Cards that I couldn't do normally, because they were too hard to price well, or were too powerful in multiples, or too narrow. You don't always have extra actions for Diadem, but you can just take another Prize instead; it's not a whole unused pile.\n    The first set of Prizes was less exciting, and people complained and I excitified them. Bag of Gold originally did not give +1 Action. Princess only made VP cards cheaper. Trusty Steed gave you +2 Cards and +$2, no choice. Diadem went unchanged, look at that. And in place of Followers I had a VP-Action card. It didn't work out because, you know, you buy VP cards later in the game, for the points they're worth. I just couldn't make a VP prize exciting enough without making it too good. It couldn't be something you built your deck around, because you might not get it and at most got one. Something like Harem or Nobles just wasn't going to look pretty next to the other Prizes, because part of what you \"paid for\" was the 2 VP. Anyway Followers, who doesn't like Followers.\n    Diadem started in the large version of Alchemy long ago, as an Action: \"+$2. Return this to your hand.\" It was a cute combo with Villages, but useless without them. I then tried some \"choose one\" versions, which solved the problem of it sometimes being dead, but didn't make the actions-to-money part any better. I eventually gave up on it, and well here it is at last.\n    Followers meanwhile started out as a Goons in Prosperity. I tried a bunch of \"choose one\" cards in that slot, and then tried this attack-two-ways, profit-the-opposite-ways thing. It was the same except it cost $6 and gave you a VP token instead of an Estate. It was too strong. An Estate is obv. a lot worse than a VP token, and being a Prize means it doesn't get to hit you that often or early either.\n    At one point Trusty Steed also gave you +2 Buys when you picked +2 Actions, and at one point Princess gave you +1 Action too."},
{"name":"Young Witch","nicename":"young-witch","history":" When I decided to do a Black Market, I also decided to make a card that added a pile. I had also been wanting to have a card that you could Moat with a particular random pile, and the easiest way to specify it was to combine the concepts. At first the extra pile had to cost $3 exactly; it can also cost $2 because that adds some variety there, especially when not playing with lots of sets. That change was jeffwolfe's suggestion. At first the Young Witch \"grew up\" - she got better once there was an empty pile. That was cute, and some people were sad to see it go, but that version wasn't good enough, and there's only so much space on these cards. She is just always young. Not as good at drawing cards as an adult Witch, and also scared of something - maybe Cellars, or Menageries. *shiver*\n    There was some debate as to how to indicate what the Bane pile was - did we need a mat or what. It was Jay who suggested using the randomizer card turned sideways."},
{"name":"Border Village","nicename":"border-village","history":" From when Hinterlands was first its own set. Originally it cost $5. I made it better by charging more. There's a trick you can't usually do. "},
{"name":"Cache","nicename":"cache","history":" One of the oldest cards in the set, dating back to the 2006 version, and I never changed it."},
{"name":"Cartographer","nicename":"cartographer","history":" This started in a later set. I moved it here because I wanted another $5 that was conceptually simple. It never changed."},
{"name":"Crossroads","nicename":"crossroads","history":" The first version was +1 Action, +1 Card per Victory card in hand. It looked crazy but wasn't very good. Then for a long time it was, +1 Card per Victory card in hand, +1 Action per Action card in hand (you revealed a second time, so ones you drew counted). People were sad to see this go, but I could not justify having a card that meant you sometimes had no clue how many Actions you had and no way to figure it out either. Then it gave +2 Actions, but that version was too strong. Giving you +3 Actions just the first time is cute, and means you can't go too nuts without other cards helping."},
{"name":"Develop","nicename":"develop","history":" A card from late in the going. I had had other Remodels not work out, and didn't think Farmland was completely filling that slot. This seemed cute and worked immediately."},
{"name":"Duchess","nicename":"duchess","history":" Free with any regularly priced Duchy! There was a card that gave you +1 Buy when you bought it, because, why not try that. You could buy out the pile if you lowered the cost enough. Some people thought this was hilarious but some people hated it, and it wasn't hilarious enough to justify being hated. Then I thought, well, what about a card that you can just take? \"In games using this, at the start of your buy phase, you may gain a copy of this.\" But you don't want to have to make that decision every turn. So I went with, a card that was just free with a particular other card, one that was always out of course, and picked Duchy.\nIt had to be a cheap terminal action, to not get taken automatically. I had been wanting to get a friendly Spy into the set, because I wanted to add that small amount of additional interaction. So, +$2, friendly Spy. As a terminal Action costing $2, it's no hot ticket, but it's an interesting option on turn one with $2, and then when you buy a Duchy, well hey, have I got a deal for you."},
{"name":"Embassy","nicename":"embassy","history":" I had had \"draw five discard three\" in Prosperity a long time ago. It had been too strong, but it didn't seem like it needed much to make it acceptable, so a when-gain penalty was a good fit. Giving the other players a Silver doesn't matter much in the long run, but on turn one it's significant."},
{"name":"Farmland","nicename":"farmland","history":" Another very old card, from before I split Seaside and Hinterlands. Originally it triggered on gaining it. This can cause some confusing chaining - buy Farmland, trash a card costing $4, gain a Farmland, trash another card costing $4, gain a Farmland. I might have left it as when-gain anyway, just to have everything be when-gain (possibly also limiting what you could gain to non-Farmland), but Noble Brigand had to be when-buy, so there wasn't a sufficient benefit to having this be when-gain. So the less confusing when-buy prevailed."},
{"name":"Fool’s Gold","nicename":"fools-gold","history":" The top started out as worth $1 per copy you had, on a version of Ill-Gotten Gains. It needed a tortured wording to have it be that if you played three you got $3 for each, since you play them one at a time. Bill Barksdale suggested having it be $1 and then $4, which was much simpler. It's stronger when you have just two, and weaker when you have more than three, but that all worked out. Meanwhile the bottom started on a card in a later set, and bopped around a little before ending up here. At one point the Gold didn't go on top of your deck, but it's so late, it has to go there."},
{"name":"Haggler","nicename":"haggler","history":" From when Hinterlands was first its own set. Originally it could gain you Victory cards. Buy Province, gain Duchy, you don't need to see that too many times. And hey you can still have that experience with Border Village as an intermediary. Also originally it triggered on gaining cards (other than via Hagglers), not just buying them. So you would sometimes get what we called \"Haggler explosions.\" Play Haggler, buy Border Village, gain a Lab via Haggler, gain a Lab for Border Village, gain a Silver for Haggler for that. Woosh, four cards. Combined with the original Farmland, you could go further. I enjoyed Haggler explosions, but they were too confusing, and the simpler version still gives you plenty of bang."},
{"name":"Highway","nicename":"highway","history":" There was a point working on the set when I wanted another $5 that you could chain. It had to be simple and compelling. Bridge and Princess are old news, but Highway plays a lot differently. All those tricks that you come up with for Bridge that you never actually pull off, you can pull off with Highway."},
{"name":"Ill-Gotten Gains","nicename":"ill-gotten-gains","history":" The very first when-gain Curser was a weird action card that gave out two Confusions (blank cards, like Curses without the -1 VP, that were in the main set originally but did not survive). It didn't work out, and I changed it to a treasure worth $1, for $3, that gave out a Curse when gained. It was like that for a while, before I became convinced that it was dominating games too much. I tried it at $4, and as a Silver for $5. That version again lasted a while, but was too good. Briefly it made $1 per copy you had in play, which I moved to Fool's Gold and fixed up. Now you get $1 or $2 out of it, depending on whether or not you want to water your deck down a little. There were two versions that gave you +$1 and had you gain a Copper to your discard pile, rather than having you gain a Copper to your hand (one failed when the Coppers ran out and one didn't). Gaining Copper to your hand ultimately seemed simpler."},
{"name":"Inn","nicename":"inn","history":" Long ago, there were two similar simple cards for $4 in different sets. The first was +2 Cards, +1 Action, discard a card; the second was +2 Cards, +2 Actions, discard 2 cards. For a while they both seemed fine, but eventually I decided the first one was too strong, and it is no longer with us. The second one was Inn. It was fine, it was never changing. But one day I came up with the bottom part, and needed a card to graft it onto. Inn fit and was simple enough and there it is. I briefly tried it for $6 without the discarding."},
{"name":"Jack of All Trades","nicename":"jack-of-all-trades","history":" This started out in Cornucopia. The premise, which some of you may have been wondering about, was to make an after-the-fact Moat. Did they make you discard? Draw up to five. Are they giving you Curses? Trash one. Did they muck with the top of your deck? Let's just fix that. Are they trashing your cards? Well, here's a Silver. That's how they all fit together. The original version could trash any card, but that was too strong. Also it put your deck into your discard pile rather than letting you discard the top card; again, too strong. The order of abilities also changed."},
{"name":"Mandarin","nicename":"mandarin","history":" The top was an obvious simple thing I just hadn't done yet. I tried several different bottoms before settling on this one. One version around for a while put a card from play on top of your deck when you gained it. That has issues that Scheme cleverly resolved but I didn't want to propagate that wordiness."},
{"name":"Margrave","nicename":"margrave","history":" A later set for a long time had an attack that made everyone else discard down to two, then draw a card. Mathematically it seems equivalent to Militia: you discard down to three, then you discard the worst card, which on average is average for your deck, being the middle card out of five; then you draw a card, which on average is average for your deck. That math is tricky but run through it a couple times if you have to. It's the same as Militia. Well in practice it hurts way more than Militia, like you might have thought. Militia lets you keep three cards that could be a fine hand. This only let you keep two, which is rarely enough to have a good plan, and then you draw a random card, which could work out but often does not. Anyway it was around for a long time but eventually died and everyone rejoiced. Vinay Baliga suggested flipping it - they draw one then discard down to three. Sounded good, I tried it, it worked out, there it is."},
{"name":"Noble Brigand","nicename":"noble-brigand","history":" First the set had a Thief variant that gave you coins instead of the Treasures. It only gave you coins for one of the Treasures, to keep it from going nuts with multiple players. So if the best Treasure you trashed was Silver, you got +$2. Well this has wording problems. Some Treasures make variable amounts or do weird things. At the same time, it was weak. So it died.\nI replaced it with a card I stole from a later set. \"A later set.\" There are only two sets after this one, and one of them is a latecomer with its own special thing going on. When I say \"a later set,\" I mean the 8th set, which was originally the 4th set, back before I showed Dominion to RGG, when there were only five expansions (then Hinterland and Seaside were split up, and Alchemy and Cornucopia were split up, and that accounts for seven). You might think, with all the cards I stole from \"a later set,\" that it would be hurting for cards, but man, it is not. Anyway. I stole this from \"a later set.\"\nThe premise is of course Robin Hood. Steals from the rich (those with Silver and Gold), gives to the poor (those with no Treasures at all). Ignores the middle-class (those showing Copper or special Treasures) (yes the middle class includes those with Platinum, Robin Hood does not realize how valuable Platinum is okay, he lives in a forest, they don't even have Platinum there). By not trashing Coppers, it avoids being horrible, and it can even give out Coppers, although don't expect that to be too common except you know against decks that trash their Coppers.\nNoble Brigand comes right out of the gates attacking. This was a fun thing that I wanted on more attacks but it only survived here and on Ill-Gotten Gains (technically not an attack, but we all know a Witch when we see one). Maybe it's for the best that you'll never experience the joy of a when-gain discard-based attack just sitting there, promising that any hand you draw might be taken away, even if no-one has even bought the card yet.\nNoble Brigand triggers on buying, not gaining. This was because you could get situations that forced you to play all further attacks in slow-mo. Jester is a good example. I play Jester, I hit your Noble Brigand, oh I want one of those. Only, everyone else has already revealed their card for Jester, no-one is wasting time. I know some of the cards Brigand will hit. Maybe normally I wouldn't take Brigand, I'd make you take another one, only, there's a Gold showing over there. Okay we have to play Jester in slow-mo this game to get rid of this situation. And well that's no fun. So, it triggers on buying."},
{"name":"Nomad Camp","nicename":"nomad-camp","history":" In its earliest days the set had a Woodcutter that gave you +1 Buy when you bought it. Then it gave you +$1 and +1 Buy on the turn after you bought it, and then I just put it on your deck. Duchess is what happened from taking this the other direction."},
{"name":"Oasis","nicename":"oasis","history":" An old card from when Hinterlands was first its own set. Never changed. Some of them have to be simple you know."},
{"name":"Oracle","nicename":"oracle","history":" Originally there was a card that had you look at your top two, trash them or discard them or leave them, then draw two. It was too strong, so I axed the trashing and made it a Spy-like attack. At first that had you always pick one for them to discard, putting the other back, but I found it less oppressive when they had to leave both or discard both. I tried a few when-gain triggers on this card - there was one that trashed a card from your hand when you gained it, one that Navigator'd once, and one that Chancellor'd. The Chancellor thing was cute, but made the card too attractive just for the when-gain - meaning, people bought it for that, then happened to be attacking you. The attack was just too annoying to have people buying it when they didn't really mean it."},
{"name":"Scheme","nicename":"scheme","history":" An old card. The premise was always the same, but the exact mechanism has varied a little. The important thing was not to have any weirdness with one-shots or duration cards or Throne Rooms played on duration cards. That's why it only works on cards that are discarded. Sometimes Scheme could work on itself, sometimes it couldn't, depending on what phrasing seemed simpler. It ended up working on itself; you can just be planning that Scheme for a while."},
{"name":"Silk Road","nicename":"silk-road","history":" In the early days of Hinterlands being its own set, it kind of had a Victory cards sub-theme. It had four Victory cards - they were just a cute vehicle for when-gain abilities. And it had a few things that interacted with Victory cards. So naturally it got the Victory card that counts Victory cards. It never changed."},
{"name":"Spice Merchant","nicename":"spice-merchant","history":" Originally this gave +1 Action +1 Buy, choose between +2 Cards and +$2. That was too strong. Then for a while it was like it is now, and then I tried it without the +$2 +1 Buy option. There had been some worries about power level, but if it was over the top it wasn't very far over, and we were picking the Lab a lot more than the Woodcutter anyway. And remember I wanted simple cards, to make the set a standalone. Well some people were very sad to see the +$2 +1 Buy option go, and it did not appear to make the card too strong after all, so there it is."},
{"name":"Stables","nicename":"stables","history":" Originally you drew the cards, then discarded a Treasure. If you had no Treasure to discard, yeeha. That version was too strong."},
{"name":"Trader","nicename":"trader","history":" This is two cards welded together. The bottom part was originally its own card, in the original 4th expansion. It went through many versions that tried to be good enough. It had +2 Cards on top; it was a Treasure worth $1; it was a pure Reaction with a when-gain trigger (similar to Secret Chamber's reaction). In the end it could not carry a card by itself and so I stuck it on another card that it fit well with. That other card, the top part, I made specifically to replace Apprentice. When it turned out Alchemy would be a small set, I wanted something slam-dunk awesome for it that cost $5 and had some useful interaction with Potion, and chose Apprentice, which was in this set. Obviously Apprentice does all sorts of cool things with Hinterlands cards. So when I took it out, I wanted to replace it with something else in the Salvager family that I hadn't done yet. Gain a pile of Silvers, there you go."},
{"name":"Tunnel","nicename":"tunnel","history":" At one point the main set had a card that had you draw a card if you discarded it. It was too wonky of an ability for the main set, and the card was bad anyway, so I cut it. When Hinterlands became its own set, I made a new card with that ability, this time a Witch variant. I ended up cutting that one because I didn't want two ways to get Curses in the set, and preferred Ill-Gotten Gains.\nLate in the going, I wanted something else in the set that was exotic, and decided to try another do-something-when-discarded card. This time I had you gain Gold rather than draw cards, which slightly reduced possible confusion. It was immediately popular, but there was the question of what the top should be. It had to be simple. It couldn't be say +$2 because then this would be flat-out worse than Silver in most games that had no combo. It was +2 Cards for a bit, which seemed okay.\nThen it turned out Hinterlands wouldn't be a standalone after all, which gave me space for 9 more cards. A standalone only has room for 291 kingdom cards and randomizers; a normal large set can hold 300. I was already using 290 cards. So I couldn't quite fit another kingdom card, but an existing card could turn into a victory card. And I had been wanting to have a victory-reaction in the set. So I changed Tunnel to be worth 2 VP. It seemed like that might be crazy at $3, but what, why not try it? As you can see, it worked out."},
{"name":"Altar","nicename":"altar","history":" This is identical to the original version from 2007 except for name. Originally it was Foundry, then Tinker. I called it Altar so you could sacrifice Cultists to it. No, don't thank me; it's what I'm here for."},
{"name":"Armory","nicename":"armory","history":" The lone survivor (here) from the failed small expansion with a top-of-your-deck theme. It's a straightforward card that never changed."},
{"name":"Band of Misfits","nicename":"band-of-misfits","history":" This has the same base functionality as it originally did in 2007; only the exact wording and what happens in the confusing cases has changed. For a while this left the set, because I didn't think I could get a good enough wording, but finally I decided to go for it. If you use it as Feast you trash it; if you use it as a duration card it stays out. Okay?"},
{"name":"Bandit Camp","nicename":"bandit-camp","history":" I started out trying \"+1 card, +1 action, gain a Silver.\" It was a very basic card I hadn't done yet. It was kind of weak. I tried it with the Fool's Gold reaction on the bottom. Then the set needed another village, so I changed it to \"+1 card, +2 actions, gain a Silver.\" At that point people would complain that gaining Silver was at cross-purposes to having a village - the Silver reduces your chance of drawing your actions together. I thought it was fine though; some people won't see that, and if you are a more serious player who does see that, well, does it stop you from buying the card? I think not. And anyway some of the cards have to be simple.\nWhen I was looking for things to do with Spoils, I saw this card, and thought hey, try changing that Silver to Spoils. And that worked out, and somehow people stopped complaining. The one-shot Gold does not water down your village-ing capabilities as much as the Silver did."},
{"name":"Beggar","nicename":"beggar","history":" I had the reaction on the original card, with \"gain a Silver\" as the top. Long ago I had had a straight \"gain a Silver\" action for $2, and it wasn't good enough, but it seemed like a reaction might prop it up sufficiently. Then it got \"+$1\" for good measure. And well the card was fine, if not exciting. Then I decided to change Squire, as told in its story, and it took the cheap Silver-gaining, leaving me to replace the top here. Three Coppers seemed flavorful and interesting."},
{"name":"Catacombs","nicename":"catacombs","history":" This started out in Hinterlands. Hinterlands had plenty of card-drawing though, so I moved it here. It seemed like an okay candidate for a when-trashed ability, so I gave it one. It mirrors Border Village."},
{"name":"Count","nicename":"count","history":" The premise was a card with two choose one's, one bad and one good. The bad ones were easy. The good ones initially had \"+2 Cards +2 Actions,\" then \"trash up to 4 cards from your hand,\" in place of \"trash your hand,\" and the card had a dividing line and a \"you can't buy this unless you have an action in play\" restriction. This was a way to stop you from getting it turn one, and was kind of nice otherwise. It was just way too much text though. So I made the Chapel a little harder to use, moved the bad choice to before the good choice so it would only trash 3 cards normally (or 4 and you gain a Copper), and there you have it."},
{"name":"Counterfeit","nicename":"counterfeit","history":" I tried out a Throne for treasures in Prosperity. It seemed like a classic thing, but it wasn't as popular as I'd hoped, so I dropped it. I rescued it here by having it trash the treasure you Throne, which makes it double as a way to get rid of Coppers, and hey I threw in +$1 and +1 Buy for good measure. Theory of dominionstrategy.com suggested the name."},
{"name":"Cultist","nicename":"cultist","history":" Attacks need to produce resources of some sort; I know from Saboteur and Sea Hag that people don't like it when they don't (yes the Knights don't all, but most do). And well I have gone through all of the simple options. So Cultist had a tricky problem to solve: it had to have resources I'd already given out, and not be too powerful, but not look too weak. Initially it gave +2 Cards and said \"each other player gains a Ruins. If he can't, he gains a Curse.\" It could potentially give out 20 bad cards to each opponent. It was like that for a while, but in the end I decided that getting Curses and Ruins at the same time was something to save for when it came up out of the randomizer, rather than something to build into one nightmare card.\nI tried \"Cultists cost $1 less this turn,\" trying to play into the flavor, but that just never did anything. I gave it a sweet when-trashed ability, but some games you can't trash it; it still needed more than +2 Cards. Finally I thought of letting you play another Cultist."},
{"name":"Death Cart","nicename":"death-cart","history":" This card exists to provide a way to give yourself Ruins. So that people don't just hate it, it gives you a use for the Ruins it comes with, a use so good that you almost feel like coming with Ruins is a plus. This has a when-gain ability, like those Hinterlands cards. My initial plan was to do these here and there in the sets after Hinterlands, back when Hinterlands was half of the 2nd expansion. That didn't work out, seeing as how Hinterlands is 6th, but well here's another when-gain card anyway."},
{"name":"Feodum","nicename":"feodum","history":" At last, the victory card that counts treasures that you've been waiting for. As explained in the preview, it only counts Silvers in order to be more different from Gardens and not just favor the kind of deck you already wanted. Making it a Silver piñata seemed cool and the card was just like that from the beginning."},
{"name":"Forager","nicename":"forager","history":" I wanted cards that cared about the trash. There were not a lot of reasonable things to do. If cards care too much, people end up spreading the trash out on the table, and well how big is your table anyway. This mechanic worked fine though. Taking a cue from Trade Route, it cares about the variety of treasures that are in the trash. This normally only goes up, but can go down due to cards that steal from the trash, and that's fun too. The card originally cost $2, so that you could use it to buy two more of them right away, but that turned out to be too strong. An early version I don't remember says \"Trash a card from your hand. +$1 per different treasure in the trash, +1 Card per different victory card in the trash,\" with no +Action/+Buy."},
{"name":"Fortress","nicename":"fortress","history":" Originally this also went back to your hand if you revealed it from your deck. In the end that seemed way too wonky. Without that it ends up just being a village in games without ways to usefully trash it, but well it is pretty cool when you are trashing it. Or someone else is. For a long time the card was called Walled Village, but then I needed that name for the Carcassonne promo."},
{"name":"Graverobber","nicename":"graverobber","history":" It's obvious that you could make a card that gets cards from the trash. What's not obbvious is that it will end up looking like this. There was just a straight line that led from the idea to the final card though. It had to provide a way to get good cards into the trash, so that it wouldn't just stare at an empty trash, or a trash full of Coppers and Estates. So, it's a Remodel. Furthermore it's a Remodel that likes to trash actions that cost $5, which is just the kind of thing you're happy getting from the trash. In games where Provinces end up trashed, such as via other Remodels, it's way too good to be able to gain them with Graverobbers, so you can't. It also can't get cheap cards, which was to stop you from getting Madman (a combo we first suffered through for a while). I later changed Madman to not go to the trash, but kept Graverobber at $3 to $6, because that makes things a little easier - you keep one pile of real trash and one pile of good trash - and it meant I could safely do other non-supply $0* cards in the future without worrying about Graverobber, if somehow that comes up."},
{"name":"Hermit","nicename":"hermit","history":" I quickly tried four variations on the top before settling on what it has. The premise was to let you trash cards that weren't in your hand; it had to also hit them in your hand so you didn't curse your luck on drawing those opening Estates / Shelters too often. Some of the versions trashed cards from the supply, a mechanic I'd first tried on a Seaside outtake, but it hadn't worked then and didn't work this time. And originally it trashed cards from your deck, but your discard pile gives you a similar selection faster.\nI tried the bottom on another card that didn't survive, then put it here. Originally I thought I would have several cards that upgraded into specific non-supply cards, but each one both requires 10 extra cards to handle it, and gives me a card with a ton of text on it. So there are only two. The premise originally came from thinking about Pirate Ship, at a point when it was too late to change it. I realized that I could have made it that Pirate Ship either attacked or upgraded, and it upgraded into a Retired Pirate that made money. This change wouldn't have addressed any problems, it was just a cute thing I could have done, if I'd thought of it in time and had been welling to give up a card slot for it. So after that I planned on one day doing such cards. \"If you didn't buy anything\" was an obvious simple trigger, and a nice fit for a Hermit. If he doesn't go into town often enough, he goes mad.\nMadman started as an Intrigue card for $5. At first it was +2 Actions, +3 Cards, trash this; then I moved it to the large version of Alchemy, which at the time was planning on having a hand-related sub-theme, and changed it from +3 Cards to doubling your hand size, because hey, that's cool. Then of course I moved it to Cornucopia when Alchemy ended up being small and Cornucopia took on the hand theme. Then Cornucopia lost that theme, but this card left first; it was too strong. What would happen was Bill Barksdale would be losing, and moaning about it, and he'd buy a Madman, because what other chance did he have, ugh, ugh, ugh. And then he'd buy two more. And he'd have a turn where he played all three and drew his deck and bought out the Provinces. It seemed like a card still worth doing; it just had to be harder to get them. And so it is.\nMadman originally was trashed. I switched it to going back to the pile as part of my ruthless weeding out of the Graverobber / Madman combo."},
{"name":"Hunting Grounds","nicename":"hunting-grounds","history":" The bottom started out on a victory card worth 3 VP. It was a defense vs. Knights, and cute with Remodels, but not really so worth doing. So I dropped that card, then brought the bottom back with a simple action top. I see from my files that I briefly tried it at $5 with \"+3 Cards +1 Buy\" before going to the +4 Cards version."},
{"name":"Ironmonger","nicename":"ironmonger","history":" This was briefly in Hinterlands long ago. I forget why I dropped it. When I put it here, initially you always discarded the card. Some people hate flipping over their good cards though, so I tried a version where you could keep the card if you wanted, and as you can see that worked out."},
{"name":"Junk Dealer","nicename":"junk-dealer","history":" This was a relatively late addition. I wanted another +1 Card +1 Action thing for $5. I tried a version of this that only gave you the +$1 if the trash had at least 10 cards in it, then 5, and then I just gave you the +$1."},
{"name":"Knights","nicename":"knights","history":" How about a pile where every card is different? To keep from being too much to remember, they could be variations on a theme. Thus was my thinking back when, and the 2007 version of the set had a pile of Knights. They each had \"Each other player trashes the top card of his deck,\" which was my standard trashing attack in those days, plus a bonus that varied by Knight. At that time kingdom card piles were 12 cards, and exactly 12 people had played Dominion when I made the first version of the expansion, so I had a Knight for each of them.\nWhen the top-card-trashing attacks all died their deserved deaths, I had to find a way to fix up the Knights. I settled on trashing cards in the range $3-$6. I tried other ranges, man, don't think I didn't. If the lower limit is $4, you always buy Silver over $4's, which makes the game less fun. If the top limit is $5, you always buy Gold over $5's, which makes the game less fun. $3-$6 is the range that does not actually stop you from building a deck with actions, while not helping your opponents by trashing junk, and not being so swingy as to trash Provinces. I could have gone $3-$7 but decided to let the $7's be excitingly immune to Knights.\nThe Knights slowed down the game, and needed some penalty to mildly keep them in check. They still slow down the game, but you know, not quite as much. They are for the people who like this kind of thing, and well some people adore them, slower game and all. Some people are all, my cards, my precious cards, and well there are plenty of other cards in the set for those guys. Sometimes someone else's cool fun thing trashes your cards, that's just the way it is. Anyway where was I. A penalty. I let them Moat each other, which was okay, and also tried letting any attack Moat them. I think Bill Barksdale suggested having them kill each other. It's a good penalty because it means if people go heavy into Knights, they kill each other off and then there are not as many of them.\nThe 12-card pile had a few abilities that have not survived. There were a few that scaled with the number of players in a way that I sometimes am okay with but which wasn't great. Like, +$1 per treasure trashed. There was one that attacked the turn you got it: the Hinterlands Knight. And all of the original resource abilities were weaker - it was +1 Card etc. rather than +2 Cards etc. The Knights needed to be better, and improving the bonuses was more fun than improving the attack.\nThe Knights are still all named after real people, so hey let's meet them! Some of them are even illustrated on the cards, although two declined, two are small children, and some of the remaining six resemble the actual person more than others."},
{"name":"Dame Josephine/Natalie/Sylvia","nicename":"dame-sylvia","history":" My wife and daughters."},
{"name":"Dame Josephine/Natalie/Sylvia","nicename":"dame-natalie","history":" My wife and daughters."},
{"name":"Dame Josephine/Natalie/Sylvia","nicename":"dame-josephine","history":" My wife and daughters."},
{"name":"Dame Molly/Sir Destry","nicename":"dame-molly","history":" Two friends who were in the first game of Dominion, along with me and Dame Josephine. For you Prosperity fans, Dame Molly is the one who suggested \"spendy\" as an expansion theme."},
{"name":"Dame Molly/Sir Destry","nicename":"sir-destry","history":" Two friends who were in the first game of Dominion, along with me and Dame Josephine. For you Prosperity fans, Dame Molly is the one who suggested \"spendy\" as an expansion theme."},
{"name":"Sir Martin/Dame Anna","nicename":"sir-martin","history":" A friend who would have been in that game, but he'd moved away some months earlier, and his girlfriend."},
{"name":"Sir Martin/Dame Anna","nicename":"dame-anna","history":" A friend who would have been in that game, but he'd moved away some months earlier, and his girlfriend."},
{"name":"Sir Bailey","nicename":"sir-bailey","history":" Dame Molly's boyfriend, and the second person to have a copy of Dominion. He was also the first person to make homemade cards, if mine don't count, and he made Courtyard."},
{"name":"Sir Vander/Sir Michael","nicename":"sir-vander-/-sir-michael","history":" My e-friend who suffered through endless conversations about Dominion but did not playtest much, and another e-friend who playtested a bunch."},
{"name":"Marauder","nicename":"marauder","history":" Originally it gave you a Silver; now you get a Spoils."},
{"name":"Market Square","nicename":"market-square","history":" Once Intrigue had the top half. By the time I was working on Intrigue for publication, it didn't seem worth a slot. I brought it back here because I needed a simple top for the reaction. Before that I tried the reaction paired with Fool's Gold's top.\nOriginally the reaction was, you could trash this to gain a Gold when one of your cards was trashed. Time has shown that gaining a Gold is not as awesome as it looks (btw spoilers), and I eventually got around to testing the stronger version that made it into the set.\nThe reaction also dates back to Intrigue. I had a reaction that let you gain a copy of a card of yours that was trashed. To be good enough it had to give you Gold instead."},
{"name":"Mystic","nicename":"mystic","history":" This is a late card, from a point where I had a couple slots to fill, and wanted $5's that didn't use up your action. I made a list of cards to try, and we tried them, and this one stood out. It's just Wishing Well with +$2 instead of +1 Card. Only, as with Highway vs. Bridge, that change means that various combos that don't work with Wishing Well actually work with Mystic."},
{"name":"Pillage","nicename":"pillage","history":" Discarding a card the attacker picks was a basic thing I hadn't done yet. It's so rude that the card is a one-shot. Originally it gained two cards costing up to $4 each, but that was too good. Now you get Spoils."},
{"name":"Poor House","nicename":"poor-house","history":" This started in Prosperity. At the time I thought having a few anti-theme cards in a set would be cool. It turns out it's not; it just makes those cards less likely to be played when playing with kingdom cards heavy on whatever expansion. So Poor House moved to Hinterlands, and while it seemed fine there, one day it seemed like, why isn't this in Dark Ages.\nThe original card got you +$5 if you had no treasure in hand. Sir Bailey suggested changing it so that you got varying amounts of money depending on how close you came to no treasures. Then for a long time it cost $2, but Sir Martin suggested having it cost $1 for flavor reasons. It makes a functional difference in various situations and that's cool too."},
{"name":"Procession","nicename":"procession","history":" There was an ancestor of this card in the original large Alchemy. It was, play an action from your hand, trash it, gain an action costing up to +$2 or +Potion, play it. So you could go, play a Moneylender, trash it, gain a Golem, play the Golem. It was crazy and confusing but had a certain something.\nAnother Throne variant in Dark Ages didn't work out, and I thought of that old card and made this one. It does not go so crazy but can still facilitate a cool transforming engine."},
{"name":"Rats","nicename":"rats","history":" Here it is, my favorite Dominion card. Your kingdom, overrun with rats! And somehow this will work out for you! There had been a card back when that was \"+1 card +1 action, trash this or a card from your hand.\" It had cost $2 and was crazy. When I thought of making an action that gave you copies of itself, I brought it back as the action. Of course it can't trash copies of itself, because then it would be crazy again. There were a few versions of this that tried different ways to balance the card, and to address the issue of, what if I just buy one Rats when they're all but sold out, to get a good trasher with no penalty. Some versions had a penalty if you couldn't gain a Rats. In the end the key was making Rats a 20-card pile, and giving you a bonus for trashing it."},
{"name":"Rebuild","nicename":"rebuild","history":" A late addition. I had an empty slot, and noticed that all of the large expansions gave you answers to the question, how do I deal with these dead victory cards? Intrigue has victory cards that aren't dead; Seaside lets you set them aside with Island, and, if you're crafty, Native Village; Prosperity has VP tokens; Hinterlands pushes card filtering. So I tried this out. Originally it didn't give +1 Action, but that version could not compete."},
{"name":"Rogue","nicename":"rogue","history":" Back when, Intrigue had a card called Bandit: \"Each other player reveals the top 2 cards of his deck and trashes one. Gain one of the trashed cards.\" For $4. So, like a Thief that can steal anything, although the attacked player got to pick what to lose. Like Thief, Bandit would helpfully eat Coppers for your opponents, but at least it threatened to take Provinces later. I tweaked it into a card that cost $5, looked at the top 3 cards, and only trashed stuff costing from $3 to $6. Then I took it out of the set. It was slowing games down and did not have that certain something.\nA few years later, I made a new version as what Urchin turned into. It looked at the top two now, still trashing something for from $3 to $6. This was in the set for a while, then got upped to taking any $3-$6 card from the trash, not just one that was just trashed. But one day I got too fed up with it. The problem was, it was the kind of attack you might feel like buying to fight itself, only you couldn't - you had to buy Urchins and get them to upgrade, which can take a while when you start on it later. Bandit was normally just a thorn in your side, but some games it would get played a ton and take your stuff and you couldn't even get in on it.\nSo, I replaced what Urchin turned into with Mercenary, and made this new Bandit, now a Rogue. He only trashes or gains, not both at once, and he can't trash if there's anything to gain. He does make +$2 though, which makes all the difference. Some games there is stuff in the trash right away, like Hermits, and the Rogue never gets to trash cards, but well that's the kindler gentler Dark Ages that people prefer."},
{"name":"Sage","nicename":"sage","history":" The initial version was +1 Action, name a card, draw the next card that you haven't named for Sages yet this turn. So with multiple Sages it would get more selective. I pared that down to just drawing you a $3+."},
{"name":"Scavenger","nicename":"scavenger","history":" At one point I thought I might push doing stuff with the discard pile as a subtheme. I didn't really, although a few cards care about it. Scavenger lets you pick a card from your discard pile to draw. To make sure there is something, it lets you put your deck there first. Originally you had to put your deck into your discard pile; Wei-Hwa Huang argued for making it optional, to get rid of certain cases where you were sad to do it. And as a result you can set up multiple cards with it, if you play multiple Scavengers and only flip the first time."},
{"name":"Squire","nicename":"squire","history":" The first version of this, from way back when, was the not-so-similar-looking \"+1 card +1 action, you may play an attack or buy a Silver.\" It was a village that only played attacks, or a +buy that only worked on Silver. When it turned out that I wouldn't be doing more cards that let you buy cards in the action phase, due to Black Market being confusing, I dropped buying Silvers (at that point \"buy a Treasure\") and added, \"when trashed, gain an attack.\" Now the card was just a blank cycler in games with no attacks. For a while I thought that was okay, but people sure complained about it. I made it, \"when trashed, gain an attack or silver,\" but of course some games there's no way to trash it either.\nI liked the bottom, so the solution was to give it a spiffy top that you would always be happy with. And there it is, a counterpart to Steward. It took \"gain a Silver\" from Beggar and well that worked out too."},
{"name":"Storeroom","nicename":"storeroom","history":" This was an old idea that I had briefly tried and forgotten about long ago. I wanted a card-filterer to help dig through your Ruins and saw this on a list and thought hey, let's try that again."},
{"name":"Urchin","nicename":"urchin","history":" I wanted an attack that learned how to be a better attack. The initial attack had to be weak, and it had to have +1 card +1 action, making it need to be even weaker. \"Discard down to 4\" was an obvious candidate and worked out immediately. It can hurt, but is often inoffensive.\nOriginally it turned into an earlier version of Rogue, as told in that story. When that didn't work out I tried Mercenary. It's a bigger discard-based attack, so you can feel like your Urchin got better at that kind of thing. Otherwise it was a card I'd tried as a regular kingdom card in the set but which had been too good. It's still pretty snazzy if your Urchins hit right away. It's a Steward that does all three things!"},
{"name":"Vagrant","nicename":"vagrant","history":" It's a Lab where the extra card is always bad. Actually that would be more powerful but slower; it doesn't guarantee you a bad card, it just can't do better. Sometimes you're happy with blank cards to discard to something, and when you aren't, at least it can clear a bad card out of the way of your next draw. It's not going to be a star, but some cards that cost $2 have to really look like they're just a $2."},
{"name":"Wandering Minstrel","nicename":"wandering-minstrel","history":" In Cornucopia I tried out a card that was +$2, name a type, dig for it, leave the first match on top. It would have been \"strictly better\" than Chancellor at $3 (since you could name a type that wasn't in your deck), and I didn't want to charge $4 for it or give it an awful condition specifically to make it worse than Chancellor (a card not famous for being strong). So I dropped it. I turned it into a village in Guilds, then moved it to Dark Ages, where I made it always dig for actions, with no choice. That card was a bit too strong and also slowed down games more than an ideal amount. So now it just looks at the top 3 cards and leaves the actions on top."},
{"name":"Ruins","nicename":"ruins","history":" Back when, the main set had Confusion - a blank card - and an attack that gave it out. Confusion just wasn't worth the 30 or 50 extra cards it required. It plays so much like Curse. When I decided to make Dark Ages 500 cards, I of course thought of Confusion. Confusion still wasn't worth doing though. But what about more interesting penalty cards? They wouldn't need to be all the same even. And well there they are, the Ruins. It was always those five. Some people argued that Ruined Village was more funny than worth printing; it's easily the worst one, and in a multiplayer game someone just randomly got handed it while someone else got Abandoned Mine. But I thought that wasn't so bad, and felt that it was important that it be very easy to learn the Ruins. Four are +1's and then there's Survivors. Bam.\nI needed a rule for putting out the pile, and so put \"Looter\" on the bottom of the relevant kingdom cards. It seemed like it would be confusing if the Ruins pile wasn't in the supply, so it is; that meant the top card had to be visible, so that for example if I name it for Contraband we know that that's what you'd be buying (and you can't). This means you have to carefully deal them out in turn order and well that was as good as it got."},
{"name":"Shelters","nicename":"shelters","history":" Tom Lehmann suggested replacing starting Estates with something else, to make the environment feel more Dark Ages-y. I thought this was a great idea. Ruins obv. doesn't work, because some people would make out, unless we picked specific ones. And Curse isn't very interesting. But I could just make up three new cards, which is what I did. Necropolis shakes up early turns, since you can stomach more in the way of terminal actions; Overgrown Estate gives you a little prize if you crack it open eventually; and Hovel tempts you into buying a victory card when you might not have.\nHovel is the only one that changed. Originally it was an action you could trash by discarding your hand. It turned out that trashing it turn 1-2 usually seemed like the correct play, even if you drew it with four Coppers. So that was no good. Hovel as printed has nice flavor going for it; you move out of your old Hovel and into a nice Duchy."},
{"name":"Spoils","nicename":"spoils","history":" One day looking through my ideas file I decided it was time to try out \"card that makes a one-shot Gold.\" The first version was just that: cost $3, you gain a Spoils. It seemed cute but was weak, so I gave it +1 Action. At that point it still seemed weak, but people bought it anyway.\nI knew some people would be all, where are the other cards that make Spoils? And I was not possibly giving them another way to get Madmen or Mercenaries. So I thought, maybe three cards total could make Spoils. So I went looking for something else to stick Spoils on. It ended up on Marauder, Pillage, and Bandit Camp.\nThen the original card died, because it just didn't have much going for it at that point.\nYou originally trashed Spoils, and could get them from the trash. It seemed simpler if they returned to the pile. It drops some words from the three cards that give them out, and matches Madman. Forager can still put a Spoils in the trash, it just doesn't get that handed to it for nothing."},
{"name":"Bank","nicename":"bank","history":" I stole this from Alchemy, where it originally cost $4+P. I wanted something else really simple and classic-seeming. It had been a good fit for Alchemy, since it counts Potions even if you don't end up spending them. Alchemy was years off though, years I say, and Prosperity needed a card now. Then when Alchemy got bumped up, I didn't steal this card back, because it required a little more of the Prosperity rules than I was comfortable with putting out ahead of Prosperity."},
{"name":"Bishop","nicename":"bishop","history":" When Prosperity got delayed, I got extra time to make changes. I decided, why not take out the worst card? At the same time I wanted more cards that used the VP tokens, so they'd seem less gratuitous. I tried a few different cards in this slot and liked Bishop the best."},
{"name":"City","nicename":"city","history":" Didn't change from the first version, except for wording. The idea for this card came from the Seaside outtake that cared about the trash, and of course Trade Route. I needed cards in the set that interacted with other players but weren't attacks, so I could have fewer attacks overall (so that Colony would usually be reachable) but still have enough interaction. One thing to do is to look at shared data - the piles. Trade Route cares if a pile isn't full; this cares if a pile is empty. Those were just the two simplest things to check."},
{"name":"Contraband","nicename":"contraband","history":" Another card that didn't change from the first version, except for a wording tweak."},
{"name":"Counting House","nicename":"counting-house","history":" My wife came up with this card. Her version got you back all of the Silvers, which was crazy. Women! The Coppers version worked out, and just left getting a good wording."},
{"name":"Expand","nicename":"expand","history":" Originally cost $6. I missed this the first time so there you go, this wasn't all for nothing. It cost $6 briefly but is $7 in the oldest file with it."},
{"name":"Forge","nicename":"forge","history":" Originally cost $5, then $6. The \"in coins\" clause was added late, to simplify Alchemy interactions."},
{"name":"Goons","nicename":"goons","history":" The art originally submitted for Pawn was not what we wanted for Pawn. We saved it for a future card. It looked like an attack; it had two guys bugging a third guy, so maybe a \"choose two.\" I went with \"+$2. Choose two: +1 Action; each other player discards down to 3 cards in hand; take a 1 VP token; gain a Silver. (The choices must be different.)\" This card was popular. It had issues though, as pointed out by Wei-Hwa Huang and Bill Barksdale. It was political - someone would play it ahead of you, and then you could pick the discard option or not based on how well that one player was doing (since no-one else would be discarding). With +1 Action making it easy on your deck, it got bought up by everyone, so that you were having to discard constantly. I tried several other versions with different options in different combinations. I tried another card that I thought would work for a while but was just too strong, and finally ended up in a weaker form in another set (that set is Cornucopia and that card is Followers). Finally the Goons you know stuck. Again it squeezes in another use for those VP tokens."},
{"name":"Grand Market","nicename":"grand-market","history":" Originally it cost $7 and was \"+1 Card +1 Action +$2.\" People sure complained about it not having +1 Buy. \"How is it a Grand Market?\" they'd say. So I added +1 Buy, and then later took the anti-Copper clause from another card."},
{"name":"Hoard","nicename":"hoard","history":" Started out at $5. It was too strong, although it took a long time to get changed."},
{"name":"King’s Court","nicename":"kings-court","history":" Originally it cost $5, then $6. Of course Throne Room originally cost $3. King's Court got \"you may\" at the last minute. Throne Room should say \"you may,\" because what if you want to play it for some reason (making Peddler cheaper for example) but don't want to play the only other action in your hand (a card-trasher of some kind say)? The card doesn't keep you honest, like (most) other cards do. And \"you may\" is a lot less text than \"or reveals a hand with no actions,\" which would also look weird. Anyway it's too late for Throne Room. Should King's Court match Throne Room, or have the fix? It matched until near the end. Man, why not use the fix? That's what I think."},
{"name":"Loan","nicename":"loan","history":" The original card said \"when you spend this, trash another treasure spent with it.\" All of the Prosperity treasures originally had \"when you spend this\" phrasings. They caused some confusion - what if a treasure worth $2 has such a rule, and you spend $1 on something and $1 on something else? I eventually reworded them all as \"when you play this\" or \"while this is in play.\" Loan didn't work like that and died. Then later I brought it back by having it look for a treasure in your deck."},
{"name":"Mint","nicename":"mint","history":" At one point, the expansions were all 20 cards. Do you count Platinum and Colony? Initially I did. Later I decided not to, and added two cards to Prosperity - Wishing Well and Mint. Wishing Well as you know migrated to Intrigue, but Mint hung around. Originally it did nothing when you bought it. I took that \"penalty\" from Mountebank. Mint had been too weak and Mountebank too strong, and moving the \"penalty\" addressed both of those problems. Plus it seems more natural here."},
{"name":"Monument","nicename":"monument","history":" Originally you tracked VP with Coppers from the supply. You set aside a Copper; at the end of the game it was worth 1 VP. Also the first tested version did not have +$2. It got that in order to be playable. After Seaside it was clear this would use tokens, so I rephrased it, and eventually added more VP token cards so it wouldn't be lonely. Late in the going I realized it could be phrased as \"+1 VP\" rather than \"Take a VP token.\""},
{"name":"Mountebank","nicename":"mountebank","history":" Originally it had the Mint \"penalty\" and no discarding clause. It was too powerful and left the set. Later I brought it back without the \"penalty\" (yes it is not really a penalty), then added the Curse-Moating. Briefly you just revealed the Curse (rather than discard it), but I decided that was more hosing than I wanted."},
{"name":"Peddler","nicename":"peddler","history":" The first version was \"This costs $2 less per Action played this turn.\" It came from the ruins of an expansion that only ever existed in 16-card form. That expansion had two themes, one of which was \"weird stuff with costs.\" That was not a good theme. I mean some of the cards were cool but you don't want a bunch of that in one place. Peddler and the Grand Market penalty made it into Prosperity. Late in development I changed Peddler to only change cost during buy phases. This meant now you could Remodel it into Platinum and so forth. The change was for two reasons. First, the Remodel combos are fun and well why not try them out. Second, it made it less confusing. People were always trying to Remodel it and then having to be reminded that no, you played two Peddlers and a Remodel, now it only costs $2. And then, close to the end, I tweaked it to count action cards in play, rather than actions played this turn, so there was nothing to remember."},
{"name":"Quarry","nicename":"quarry","history":" This started out as an action, \"+$2. Action cards cost $1 less this turn.\" It was in Seaside; this was a better home for it. It left the set at some point, then I brought it back as a treasure, which made it a lot sexier."},
{"name":"Rabble","nicename":"rabble","history":" Originally you also revealed your own top 3 cards, discarding the Victory cards. There are two reasons that changed. First, it made the card defend against itself too well, which makes it get played more, which makes the game more oppressive. Second, the card was wordy, and didn't need that extra text to be good enough."},
{"name":"Royal Seal","nicename":"royal-seal","history":" Originally it was \"when you spend this,\" which is more confusing. When I got rid of those, this one got its \"while this is in play\" functionality. For a while it triggered on buying, but in the end it triggered on gaining, to line it up with Watchtower."},
{"name":"Talisman","nicename":"talisman","history":" Originally this worked on victory cards; you only need to see so many games of Talisman/Gardens to give up on that. Also it cost $5 and only worked on one card per turn, via a \"when you spend this\" wording."},
{"name":"Trade Route","nicename":"trade-route","history":" This started in the original 4th expansion, and migrated here in the great diaspora of interactive cards. The first version in the 4th expansion was \"+1 Card +1 Buy +$1. If anyone got a Province this game, +1 Card.\" I fixed that up to a less-well-worded version of the card you know when I moved it to Prosperity. Late in the going it got a wording that used tokens and mentioned setup. "},
{"name":"Vault","nicename":"vault","history":" The main set once had a card called Vault that was just \"Discard any number of cards. +$1 per card discarded.\" The top half of Secret Chamber. It cost $4 and then $3 and then it was Secret Chamber. Actually the oldest version was like \"victory cards are also coppers this turn,\" but discarding cards is more flexible and way less confusing. Anyway the original mechanic was just not that good, as evidenced by Secret Chamber getting an additional ability and only costing $2 and still being nothing special. But tack on +2 Cards and you've got a monster. For a long time it had no penalty, but it was just too good."},
{"name":"Venture","nicename":"venture","history":" This replaced some other treasure midway through development, but never changed. I thought of doing a \"when you play this\" treasure that drew you a card, and well you'd be sad if the card wasn't a treasure, so it always is."},
{"name":"Watchtower","nicename":"watchtower","history":" This showed up late in development, after another card left. Dale complained that the set had no reaction, and this was one I'd been meaning to try. The first version, which lasted only a couple days, also let you put the card into your hand. Destry pointed out the Ironworks combo and so much for that."},
{"name":"Worker’s Village","nicename":"workers-village","history":" Nothing about this card changed except for where the apostrophe is. I previously had a card that was \"+1 Card +1 Action +1 Buy,\" but it's not exactly fair to say that this is a version of that."},
{"name":"Platinum","nicename":"platinum","history":" This always cost $9 and made $5. $4 is not enough. You have to get to $11 for Colonies; that doesn't just happen. I bet that $5 surprised a lot of people."},
{"name":"Colony","nicename":"colony","history":" This always cost $11. Originally it made 8 VP. At the time Province was worth 5 VP. When Province went up to 6 VP, I changed this to 9 VP. It stayed like that for a while. 9 VP seemed like a good spot for making both Colony and Province viable in Colony games. In development, Valerie and Dale really wanted it to be worth 10 VP. 1 - 3 - 6 - 10! Except, the 1 and 3 there really don't mean much; Estate and Duchy are not bargains. For a while I said, sure, maybe 9 VP isn't the right value, but you know, it sure has seemed good in testing so far. And it had. It had seemed just fine. I finally tested it at 10 VP anyway though. And well, it usually didn't make a difference in who won, and it made counting scores easier, and it looks prettier. And attacks and rush strategies already push you away from Colony; it's fine if some games you really don't want to stop at Provinces. So 10 VP it is."},
{"name":"Advisor","nicename":"advisor","history":" Envoy was an Intrigue outtake. If it hadn't been used as a promo, I would have eventually fixed it up. One day I decided, what's stopping me? The key thing was to give it +1 Action, so that you didn't just say, lol here are some actions you can't play. I originally made Advisor for Dark Ages, but moved it here because it seemed to fit with the emphasis on decisions this set has."},
{"name":"Baker","nicename":"baker","history":" Originally it didn't have the setup part. It was just a very basic coin token card. When I thought of the setup thing, I realized that whatever card I put it on might sometimes not be bought, such that that starting coin token was all the card did. I decided that was okay though, and to just put the ability on something simple and likely to be bought."},
{"name":"Butcher","nicename":"butcher","history":" I wanted some other way to use coin tokens if I could get one. Butcher lets you spend them as part of a Remodel. It also gives you coin tokens, so it won't be sad when there are no other coin tokens around. For a while I considered making a simpler version of this, but ended up going with the full-on tricky version. The wording is convuluted, and not even technically correct - it says \"plus the number of coin tokens,\" which never confuses anyone, but it should convert the units - \"plus $1 per coin token.\" It ended up with this phrasing because a phrasing that said \"per coin token\" got read by some people as gaining you a card per coin token spent, rather than adding them to the cost."},
{"name":"Candlestick Maker","nicename":"candlestick-maker","history":" For Alchemy I wanted a single $2, with a +Buy, and tried \"+1 Action +1 Buy +$1.\" Some people preferred this to Herbalist, but some people felt like, hey what does this have to do with Potions. And I could make that card later. So I put Herbalist in Alchemy. I next tried the card out in Hinterlands, with \"when you gain this, +1 Buy.\" As recounted in that secret history, some people though it was hilarious that two Highways let you just buy out the pile, but some people abhorred it. I couldn't tell you why, I thought it was hilarious. But the card was just not sufficiently hilarious to live with the hate. I bumped the card out again. Then it seemed like a great fit for Guilds, where the +$1 could become a more exciting \"take a Coin token.\" And here it is."},
{"name":"Doctor","nicename":"doctor","history":" Again as recounted in the Hinterlands secret history, I tried several \"when gain\" trashers for that set, and was not happy with any of them. The main problem was that you would buy the card just for the trashing, and end up with whatever other effect in your deck randomly. The solution was to make that other effect also trashing. Doctor gives you three options per card you see on the overpay in order to make sure you're as happy as possible with the outcome. The when-play part gets in the name-a-card thing I mentioned."},
{"name":"Herald","nicename":"herald","history":" The top is an old card, a less-crazy relative of Scrying Pool that I tried out long ago. The bottom was just something else I could do with overpay that would feel different. I tried it first on Duchess's top, then moved it to this card."},
{"name":"Journeyman","nicename":"journeyman","history":" I took this from Dark Ages, when I thought I might push a mild \"name a card\" subtheme here. I didn't end up pushing it enough to make it really visible. Journeyman and Doctor have you name a card, and then Taxman kind of does, and Advisor has you pick a card. Some playtesters called this card Bigot Parade, because you know, they don't like some particular card. \"No Estates!\" they chant, marching through the streets."},
{"name":"Masterpiece","nicename":"masterpiece","history":" This was just the most basic possible overpay. Early on Ben bought one for $10 or so and said \"achievement unlocked.\" It turned out to be a fine play though."},
{"name":"Merchant Guild","nicename":"merchant-guild","history":" This started out thinking it could cost $4, like Bridge. As it turned out, it could not."},
{"name":"Plaza","nicename":"plaza","history":" Originally this also let you trade a coin token for +1 Card. The card was plenty good without that, plus I wanted to cut complexity wherever I could."},
{"name":"Soothsayer","nicename":"soothsayer","history":" I had tried \"gain a Gold, they gain a Curse\" in Alchemy, but it was a poor fit for a card with potion in the cost. I tried it out again here with the Council Room penalty. It worked fine, but some people complained about how bad the card got when the Curses ran out. Wei-Hwa suggested having it not give them a card unless they got a Curse, and there you have it."},
{"name":"Stonemason","nicename":"stonemason","history":" Some work went into this one. I tried the top with several Remodel-family overpay bottoms. The first one was, per $2 you overpay, Expand the top card of your deck. The most promising one was, per $2 you overpay, draw a card, then Remodel a card from your hand. In the end the crazy huge overpay turns were fun but too random. Meanwhile I tried the printed bottom with Develop on top and liked it. The bottom wanted to go on a super-cheap card, so I paired it with the printed top and moved Develop into Hinterlands."},
{"name":"Taxman","nicename":"taxman","history":" This started in Cornucopia, based on an idea that didn't go far in Alchemy. For the Cornucopia version, the discarding was not limited to players with five+ cards in hand, and the treasure you gained didn't go on your deck. It was painful and not good enough. In Hinterlands I tried a version that gained you two cards. Finally it moved here and I fixed it up. It's a lot of words, that's like a theme of this set. It does a fine job of feeling like a new attack though, and well that's what that takes."},
{"name":"Amulet","nicename":"amulet","history":" I tried a couple choose-one duration cards and quickly settled on this one."},
{"name":"Artificer","nicename":"artificer","history":" I had versions of this in Cornucopia and Dark Ages. It was never quite there. This version's trick is putting the gained card on top of your deck. Earlier it went to your hand but that was cwazy. Some versions let you optionally put the card on your deck, but it was simpler and worth it to be forced to."},
{"name":"Bridge Troll","nicename":"bridge-troll","history":" Seaside had an attack that made cards cost $1 more on other players' turns. It died because it would have been the only duration card to go away other than at the end of your own turn. I figured out a fix for it and used it on Lighthouse but the cost increaser had already turned into Cutpurse. So, new duration cards, time to try that concept out again. It was a one-shot, then a non-one-shot, then a non-one-shot that was non-cumulative. It increased costs by $2 and then just $1. It was getting to be a mess and was still scary. Finally it just cost everyone else $1 via the token, turning into Cutpurse again. Only, it's the Cutpurse that never misses. Increasing costs had a certain charm but man the world does not need to be subjected to it. The upside of the card meanwhile had various forms before settling on Bridge. It's two turns of Bridge, but instead of getting +$1, you make the others lose $1. It worked with Thrones originally but it was too much. Kent Bunn insisted this card be called Bridge Troll (it was Highwayman). When I put in the Adventures theme, okay, Bridge Troll it was."},
{"name":"Caravan Guard","nicename":"caravan-guard","history":" This came out of looking specifically to see if I'd missed some corner of possibilities for Durations. This is a Duration that's a round faster if you get attacked. The phrasing was an issue; what if you play it on someone else's turn and have a +$1 token on the pile? I decided that playing the card was just way simpler than simulating playing it, and in the end it got some explanatory text."},
{"name":"Coin of the Realm","nicename":"coin-of-the-realm","history":" One of the first Reserve cards was the classic concept of a Village that's there for you when you really need it. At first it was an Action. The tracking was kind of tricky, and at the same time it was tricky getting it to a good place relative to Village and Fishing Village. Loquacious playtester Matthew Engel suggested making it a treasure. It's nicely distinct from other villages, and the tracking is not bad - while you do need to remember if you put it on the mat this turn in your Buy phase, that's just for the amount of time between putting it down and buying a card. This also makes it a strange exotic card; it's a village that doesn't work the turn you play it (barring certain combos)."},
{"name":"Distant Lands","nicename":"distant-lands","history":" How about a VP-Reserve card? It's a VP card that isn't worth anything unless you manage to play it once. A simple concept that just immediately worked."},
{"name":"Dungeon","nicename":"dungeon","history":" An early card, just trying to do a good basic thing that the Seaside Duration cards hadn't covered."},
{"name":"Duplicate","nicename":"duplicate","history":" Originally this cost $5. It didn't need to and so there it is at $4."},
{"name":"Gear","nicename":"gear","history":" I tried a village that had you draw two cards, picking one to have this turn and one for next turn. I liked that part but had too many villages. I tried it on a Reserve card that set aside the top 2 cards of your deck until you wanted them, but if they were duds you'd let them sit there all game and that wasn't the fun part of the concept. I changed it to draw four, pick two for this turn; that was crazy at $5. Then it was draw 3, save however many you want for next turn, still at $5; still crazy. In its current shrunk form it was still a card to watch. It doesn't look like much, just +2 Cards something something, but it's got some tricks up its sleeve."},
{"name":"Giant","nicename":"giant","history":" This came about because I wanted a card called Giant. Some kind of slow attack. I already had the Journey token so I used it to make an attack that only hits every other time. At first it didn't do anything on the face down turn, but I eventually nudged it up. Giants don't have a flavor tie-in with Curses, but it gives them out just to make sure that the attack doesn't miss."},
{"name":"Guide","nicename":"guide","history":" One of the first Reserve cards, just covering easy ground. Originally it gave +$2, but making it +1 Card +1 Action meant it not only saved a future hand from being bad, it didn't make your current hand bad either."},
{"name":"Haunted Woods","nicename":"haunted-woods","history":" I wanted more Swamp Hag-style attacks and came up with this take on the Rabble family. It never changed."},
{"name":"Hireling","nicename":"hireling","history":" What about a Duration card that never goes away? I playtested a version of this in Alchemy. It seemed fine but needed a playmat so it didn't happen (I did Alchemist instead). Here it was going to go on the Tavern mat, but Matthew pointed out it could just be a Duration card. It started out conservatively costing $7."},
{"name":"Lost City","nicename":"lost-city","history":" A late card. I wanted to try a card that gave you your -$1 token as a penalty when you bought it. That penalty didn't seem significant enough here (and ended up on Ball). I considered the -1 Card token instead, and it was like, letting everyone else draw is like that but way more fun."},
{"name":"Magpie","nicename":"magpie","history":" Wei-Hwa Huang visited us early on, and in a discussion of an old version of Peasant, commented on the possibility of doing them something like Rats. I immediately latched onto the idea of doing a new Rats. A friendly Rats. Now the beauty of Rats is that it helps you but then starts to hurt you. Magpie just hurts itself. It's not Rats, it's a different thing. It does give you more Magpies though. I tried a few different versions and preferred this one."},
{"name":"Messenger","nicename":"messenger","history":" The initial card didn't have the Chancellor ability and always gave out cards when bought. Matthew suggested the Chancellor part to make the top less boring, for the people who complained about that. Meanwhile other people complained about the card emptying piles too rapidly; the first-buy-only part on the bottom slowed that down."},
{"name":"Miser","nicename":"miser","history":" I was looking for more things to do with tokens, and made a thing that either gave you a token or gave +$1 per token, but made you put a token back when you got the card. The penalty was cool but it didn't need it, and we're not made out of tokens, so I used Coppers, thus making it also a way to get rid of Coppers. In the end it is like the friendly version of Pirate Ship; you get rid of your own treasures instead of theirs. I tried something very similar in Seaside back when, but turned it into Pirate Ship."},
{"name":"Page / Peasant","nicename":"page","history":" Okay so. As explained in the intro, the topic came up, maybe over lunch, man I don't remember, of someday doing an online-only promo. It would necessarily be something that couldn't exist in a physical expansion, so as not to enrage people. I went for the low-hanging fruit of, there could be a card that added +1 of something to itself when you played it. That sounded good, I filed the idea away.\nBut one day it came up for some reason, and I thought, hmmmm. I could simulate that in a physical card, by having piles of unique cards. You start out with say +1 Card +1 Action for $2. When you play it (wait, when you discard it from play), you upgrade it into your choice of cards from the $3 pile, which are all worth about $3. They wouldn't need to be adding +1 of something each time, but at the same time they could mostly be vanilla cards. Village wasn't just Village here, it was a thing you picked to upgrade into, then upgraded away from later. You have to stop eventually and I figured four piles was enough. So you got a Peasant, and he turned into a Worker, then a Craftsman, then an Artisan, then a Master. And mostly they were vanilla cards, they had to be simple for multiple reasons.\nI tried it and it was fun. It had issues though. Originally you got to pick the upgrade. You'd play three of these guys at different levels and then stare at the options. Oh man. So painful with less-frequent Dominion players. So I changed it to, we shuffle the piles, there's no choice. If you had to take the top one and put yours back on the bottom, it was kind of clumsy resolving it. If you put yours back on top, you would have slow decisions again, based on the order you upgraded guys. The upgrade thing was cool but the cards themselves were not too exciting. You would build this deck where they were a lot of your village/+buy/+cards, they did it all, and you would never know what your cards did and it would slow down games. It had seemed so cool, but was it really worth preserving?\nI decided to make it a fixed four cards. You could learn them much faster; they could be more exciting although they still couldn't be too wordy, since the upgrading part took space. It still seemed like a cool thing, so I did two sequences: one is just a hero getting better, while the other tells a little story. They took up a lot of space in the set so I didn't make a third. The new version was way better, all problems solved, hooray. I picked names for the cards first, then picked abilities to go with the names, then polished them and in some cases replaced them as we tested them.\nPage got the +1 Card / +1 Action of the initial Peasant; Peasant complements it with +$1 +1 Buy. It was +$2 at first (no buy) but that was cwazy. Soldier briefly was a mix of Militia and Ghost Ship; then Soldier and Warrior handed out the -1 Card and -$1 tokens respectively. Later on I had two other attacks using those and decided it would be more fun if these cards did something else. So Soldier is a Militia variant with variable money and Warrior is a Knight variant with variable attack depth.\nFugitive was an old old card, from the 2nd expansion before it split into Seaside and Hinterlands, that didn't exist previously because it was too strong at $4. Disciple for a while was another old old card that wouldn't fit a particular cost without a bonus or penalty or something, \"+1 Action, look at top 4, take one discard the rest.\" But later I had Raze and was messing with possible ways to make it harder to get to Teacher, and didn't have the room for that ability on Disciple and didn't want it as much anymore. So I tried something else, then put on the Throne Room plus gain, an old concept I'd never gotten around to trying. That was great, so when I got the space for the old ability back I didn't switch back.\nTreasure Hunter was another very old card, which had had various forms in different sets and never quite made it; there were always players saying, is this fun thing really as good as it gets. Such is human perversity. Here at last was a place for it where the casual players who liked it could enjoy it while not taking up too much room for the haters. Hero was just a simple compelling thing I could do; various cards have tried non-limited \"gain a treasure\" and \"gain an action\" and well having to buy a Page and play it multiple times sufficiently delays the ability.\nChampion started out being a Moat that gave +$3 and +3 Actions. I wanted a Moat on that line of cards and it was the only place I could have it, the other cards all had upgrading text. It seemed dull for the top card. I got the idea of making it a permanent Moat, that Moated from your deck, but the tracking was wonky. So I made it a Duration card like Hireling and then the only issue was what it could do for you besides Moating. Infinite actions was just an obvious thing, trying to look more exciting than a straight +1 per turn like Hireling's.\nTeacher wasn't a Reserve card originally. It got that to slow it down a little. Once you start giving out +1 tokens, your deck explodes."},
{"name":"Page / Peasant","nicename":"peasant","history":" Okay so. As explained in the intro, the topic came up, maybe over lunch, man I don't remember, of someday doing an online-only promo. It would necessarily be something that couldn't exist in a physical expansion, so as not to enrage people. I went for the low-hanging fruit of, there could be a card that added +1 of something to itself when you played it. That sounded good, I filed the idea away.\nBut one day it came up for some reason, and I thought, hmmmm. I could simulate that in a physical card, by having piles of unique cards. You start out with say +1 Card +1 Action for $2. When you play it (wait, when you discard it from play), you upgrade it into your choice of cards from the $3 pile, which are all worth about $3. They wouldn't need to be adding +1 of something each time, but at the same time they could mostly be vanilla cards. Village wasn't just Village here, it was a thing you picked to upgrade into, then upgraded away from later. You have to stop eventually and I figured four piles was enough. So you got a Peasant, and he turned into a Worker, then a Craftsman, then an Artisan, then a Master. And mostly they were vanilla cards, they had to be simple for multiple reasons.\nI tried it and it was fun. It had issues though. Originally you got to pick the upgrade. You'd play three of these guys at different levels and then stare at the options. Oh man. So painful with less-frequent Dominion players. So I changed it to, we shuffle the piles, there's no choice. If you had to take the top one and put yours back on the bottom, it was kind of clumsy resolving it. If you put yours back on top, you would have slow decisions again, based on the order you upgraded guys. The upgrade thing was cool but the cards themselves were not too exciting. You would build this deck where they were a lot of your village/+buy/+cards, they did it all, and you would never know what your cards did and it would slow down games. It had seemed so cool, but was it really worth preserving?\nI decided to make it a fixed four cards. You could learn them much faster; they could be more exciting although they still couldn't be too wordy, since the upgrading part took space. It still seemed like a cool thing, so I did two sequences: one is just a hero getting better, while the other tells a little story. They took up a lot of space in the set so I didn't make a third. The new version was way better, all problems solved, hooray. I picked names for the cards first, then picked abilities to go with the names, then polished them and in some cases replaced them as we tested them.\nPage got the +1 Card / +1 Action of the initial Peasant; Peasant complements it with +$1 +1 Buy. It was +$2 at first (no buy) but that was cwazy. Soldier briefly was a mix of Militia and Ghost Ship; then Soldier and Warrior handed out the -1 Card and -$1 tokens respectively. Later on I had two other attacks using those and decided it would be more fun if these cards did something else. So Soldier is a Militia variant with variable money and Warrior is a Knight variant with variable attack depth.\nFugitive was an old old card, from the 2nd expansion before it split into Seaside and Hinterlands, that didn't exist previously because it was too strong at $4. Disciple for a while was another old old card that wouldn't fit a particular cost without a bonus or penalty or something, \"+1 Action, look at top 4, take one discard the rest.\" But later I had Raze and was messing with possible ways to make it harder to get to Teacher, and didn't have the room for that ability on Disciple and didn't want it as much anymore. So I tried something else, then put on the Throne Room plus gain, an old concept I'd never gotten around to trying. That was great, so when I got the space for the old ability back I didn't switch back.\nTreasure Hunter was another very old card, which had had various forms in different sets and never quite made it; there were always players saying, is this fun thing really as good as it gets. Such is human perversity. Here at last was a place for it where the casual players who liked it could enjoy it while not taking up too much room for the haters. Hero was just a simple compelling thing I could do; various cards have tried non-limited \"gain a treasure\" and \"gain an action\" and well having to buy a Page and play it multiple times sufficiently delays the ability.\nChampion started out being a Moat that gave +$3 and +3 Actions. I wanted a Moat on that line of cards and it was the only place I could have it, the other cards all had upgrading text. It seemed dull for the top card. I got the idea of making it a permanent Moat, that Moated from your deck, but the tracking was wonky. So I made it a Duration card like Hireling and then the only issue was what it could do for you besides Moating. Infinite actions was just an obvious thing, trying to look more exciting than a straight +1 per turn like Hireling's.\nTeacher wasn't a Reserve card originally. It got that to slow it down a little. Once you start giving out +1 tokens, your deck explodes."},
{"name":"Port","nicename":"port","history":" It's two Villages! One of the first ideas that went into the set. Eventually Billy Martin argued that there should be 12 of them, so that they'd split evenly in 2-player games if the players both wanted them. We had the space and there they are, 12 Ports."},
{"name":"Ranger","nicename":"ranger","history":" One of the simple things to do with a token was just to use it to make something work at a different speed. With the easiest speed being half speed. Originally this only gave +1 Buy when you got the token face up, but it got the +Buy full time to be slightly simpler, and costs $4 instead of the original $3 because now it doesn't compare poorly to Smithy."},
{"name":"Ratcatcher","nicename":"ratcatcher","history":" While some other trashers were not working out, I put in this simple one. I tried a couple sizes - at one point it drew you a card when trashing - but quickly settled on the final version."},
{"name":"Raze","nicename":"raze","history":" For a while we tried a card in the Apprentice / Salvager family that gave you a mix of +1's of your choice for trashing a card. It was cwazy, today's word of the day. I dropped +Cards from it and it was still cwazy. We kept giving it chances but I also tried some alternatives. Raze copied the earlier Disciple but based on the size of the trashed card. The mix of +1's thing let you trash itself, so I put that on Raze, and I liked everything about Raze so it got the slot."},
{"name":"Relic","nicename":"relic","history":" Somewhat late in the going, I tried to steer a few of the remaining slots towards particular card names. Relic started out as a treasure that gave you a bonus based on the card types you had in play. First it just counted types, but that went too far; then it cared about specific types: it attacked if you had an Attack in play, gave +$1 if you had a Duration card, and gave +1 Buy if you had a Reserve card or Reaction card. The varying functionality was cute, but quick, what did it do again? Only the Attack part was memorable. While I like the idea of needing a dude to wield the Relic, I ended up simplifying it down to just always attacking. Then it could be a Treasure - Attack, so it is."},
{"name":"Royal Carriage","nicename":"royal-carriage","history":" A Dark Ages outtake. We always liked it, but it needed a mat. It has a mat here and well that's pretty much the story. I briefly had a bad wording that could let you go infinite, and fixing it made it even more like the Dark Ages version."},
{"name":"Storyteller","nicename":"storyteller","history":" I tried paying $ for cards long ago, in Prosperity. Prosperity at the time had a few ways to pay $ for things. It didn't work out then, and in fact I dropped that sub-theme. In the intervening years I have done that type of thing as discarding cards or treasures, because it's simpler. A couple things in this set approached being something like Storyteller, and one day it congealed. I tried a few different sizes of it, including a Reserve version, before settling on this one."},
{"name":"Swamp Hag","nicename":"swamp-hag","history":" One of the first cards in the set. The attack was always the same, except for precise phrasing vs. things like Outpost. At first it gave +$1 on both turns, then +1 Card; now it's +$3 next turn."},
{"name":"Transmogrify","nicename":"transmogrify","history":" I tried a Reserve Remodel, that Remodel'd a card just as you were gaining it. It had a certain something but didn't seem like the ideal approach. I changed it into a start-of-turn Remodel to hand for $6, then dropped it to a smaller +$1 Remodel, but gave it +1 Action and made it cheaper."},
{"name":"Treasure Trove","nicename":"treasure-trove","history":" This was another case where I wanted to use a particular name. I also liked the idea of the set having three Treasures. Another Treasure Trove didn't work out. I tried one that gave you a copy of another Treasure you had in play; then tweaked that into always giving you a Gold and a Copper."},
{"name":"Wine Merchant","nicename":"wine-merchant","history":" Originally it didn't give +1 Buy. I tried letting you get it back for having any unspent money, but upped it to needing $2."},
{"name":"Alms","nicename":"alms","history":" Late in the going, an Event wasn't seeming too hot, we never bought it. I needed a replacement and tried this. First it just gained you a card costing up to $4, no limits, because what, why not try that. As you can see instead it is a more sane thing that just means, you're never doing worse than a $4."},
{"name":"Ball","nicename":"ball","history":" A simple concept. The -$1 token wasn't there until late. The very first version Chancellor'd, but that was cwazy."},
{"name":"Bonfire","nicename":"bonfire","history":" An obvious one. The first version trashed one card from your hand or from play; trashing from your hand is just too automatic though."},
{"name":"Borrow","nicename":"borrow","history":" I reworded it a few times, but it always did the same thing."},
{"name":"Expedition","nicename":"expedition","history":" Another obvious one. It always seems cute to draw extra cards for your hand at end-of-turn, but there is the issue of that sucking vs. Militias, and of remembering it. An Event is the perfect way to do it."},
{"name":"Ferry","nicename":"ferry","history":" One of the ones that started out as a one-shot Kingdom card. For a long time it worked only on Kingdom cards (it's not too interesting if you can put it on Province), but that term just didn't mean anything to too many people, so now it only works on Actions."},
{"name":"Inheritance","nicename":"inheritance","history":" Another one that was initially a one-shot Kingdom card. The big thing to muck with here was what exactly you could put the counter on. At one point Treasures worked; I tried letting it go on VP cards. VP cards were too automatic, and then it was simpler not to allow Treasures. There was also the question of when exactly the Estates were yours; some versions didn't work for when-buy abilities."},
{"name":"Lost Arts","nicename":"lost-arts","history":" Initially a one-shot Kingdom card. An early star of the set. Initially the tokens weren't counter-limited; you could get multiple +1 Action tokens and +$1 tokens and -$2 cost tokens. I lowered it down to just two and then just one. You get the experience with one and I don't need to cost the cards for crazier situations."},
{"name":"Mission","nicename":"mission","history":" This one seems a little more complex, but it had no issues."},
{"name":"Pathfinding","nicename":"pathfinding","history":" I didn't do Kingdom cards for +1 Card and +1 Buy; I felt like +$1 and +1 Action were enough. When I was doing them as Events though it seemed like, why not. Pathfinding started out cheaper; adding +1 Card to something turns out to be pretty good."},
{"name":"Pilgrimage","nicename":"pilgrimage","history":" Originally it didn't say \"once per turn.\" It was too attractive to pay $8 and 2 Buys for."},
{"name":"Plan","nicename":"plan","history":" This started out as an Action card that was \"+2 Cards, move the token.\" You would move the token to whatever you were going to buy that turn. It's better as an Event; you actually plan."},
{"name":"Quest","nicename":"quest","history":" At first you didn't discard the cards, you just needed to have them. You needed 6 in hand or 10-12 in play. It went nuts with +Buys."},
{"name":"Raid","nicename":"raid","history":" I wanted an attacking Event, but I didn't want it to be too similar to an existing Attack, or too painful to have hanging over your head the whole game. The -1 Card token seemed like a good fit and there it is."},
{"name":"Save","nicename":"save","history":" Originally you could do this more than once a turn. You could spend $1 per VP card per turn just keeping them out of your deck. Which is neat but wasn't really the idea."},
{"name":"Scouting Party","nicename":"scouting-party","history":" An easy early one."},
{"name":"Seaway","nicename":"seaway","history":" I had a version that worked on any pile but only gave you a card if it was cheap enough. It was just simpler to tie the token to the gaining. So, you can't put +1 Buy on expensive cards, except of course all the ways that you can, this is Dominion."},
{"name":"Trade","nicename":"trade","history":" Initially the limit wasn't there, it was any number of cards. That was cwazy."},
{"name":"Training","nicename":"training","history":" Originally a one-shot Kingdom card. Well I covered this under Lost Arts."},
{"name":"Travelling Fair","nicename":"travelling-fair","history":" An easy one with no issues."},
{"name":"Archive","nicename":"archive","history":" When I thought of it, I had to try it, and it worked, so there it is. A Duration card!"},
{"name":"Capital","nicename":"capital","history":" This started as an action that gave +$2 and gave all cards \"debt\" for the turn, for $3. It was neat but scary. The final version costs more, doesn't use an action, and doesn't give any net $ - you are just borrowing."},
{"name":"Castles","nicename":"castles","history":" There was an old idea in the file, a pile of Victory cards with different sizes. One day we needed a promo (which became Summon) and Matt Engel decided to try this out. He made 8 cards for it, including Small Castle and King's Castle, and converting Opulent Castle from an old outtake from Hinterlands (there a straight action). He also had a vanilla treasure-victory card ($2 and 1 VP). I thought it was important to have a cheap one that rewarded you for loading up on them, and made Humble Castle for the first one. Small Castle trashes itself or another Castle, so Crumbling Castle is something nice to trash, and Haunted Castle isn't so bad there either. Sprawling Castle and Grand Castle interact with some of the other cards and are also nice for people not going for Castles.\nMostly the cards didn't change after the second version; they just worked out. There were a couple cards in the Haunted Castle slot. I tried a Castle that shuffled cards from discard into deck, after an old outtake; I tried a one-time Cursing one (like Ill-Gotten Gains). Haunted Castle couldn't work at weird times (such as when gaining it with Saboteur) and so ended up saying \"on your turn,\" to be as friendly as possible (still works with Small Castle) while shutting out weirdness."},
{"name":"Catapult / Rocks","nicename":"rocks","history":" I tried to come up with flavor that would be good for split piles. The main thing to do was one thing that leads to another thing somehow (rather than one card changing into another, like some cards in the past). But one idea on the list was a Catapult and Rocks and well, who can resist naming a card Rocks. Catapult initially gave the Cursing bonus on cards costing $4 or more, but at one point I lowered the cards to costing $2 and $3, and then kept Catapult working on $3's when I switched it back to costing $3 itself.\nRocks started out with \"when gain/trash, +2 Cards, may trash 2 cards from hand.\" It wasn't everything I wanted and I replaced that with gaining Silver to your hand, then your choice of hand or deck top. Then to avoid confusion it took the destination choice away and based it on the phase, so you weren't all, wait if I put Silver in my hand after buying Rocks, can I play the Silver?"},
{"name":"Catapult / Rocks","nicename":"catapult","history":" I tried to come up with flavor that would be good for split piles. The main thing to do was one thing that leads to another thing somehow (rather than one card changing into another, like some cards in the past). But one idea on the list was a Catapult and Rocks and well, who can resist naming a card Rocks. Catapult initially gave the Cursing bonus on cards costing $4 or more, but at one point I lowered the cards to costing $2 and $3, and then kept Catapult working on $3's when I switched it back to costing $3 itself.\nRocks started out with \"when gain/trash, +2 Cards, may trash 2 cards from hand.\" It wasn't everything I wanted and I replaced that with gaining Silver to your hand, then your choice of hand or deck top. Then to avoid confusion it took the destination choice away and based it on the phase, so you weren't all, wait if I put Silver in my hand after buying Rocks, can I play the Silver?"},
{"name":"Chariot Race","nicename":"chariot-race","history":" The question here was what to do with the other player's card. If you leave it on top, Chariot Race has the same competition all turn, although your own card varies. If you discard it or put it on the bottom, it feels too much like an attack. It went back and forth but ended up leaving the card on top."},
{"name":"Charm","nicename":"charm","history":" This started out as a Treasure worth $2 that made cards you buy come with different cards at the same cost. We did crazy things with that for a while, then finally I looked at ways to weaken it. I tried several variations in rapid succession, that limited you to one gain per turn. There was one that gave you a $5 if you had at least $5 when you played it. The best was a Reaction version - a Treasure worth $2 and a Buy, can discard when gaining a card to gain a different card with the same cost. Discarding it gives you the potential to get loops, where you redraw it repeatedly; Dave Goldthorpe found some of these. So now it's a choose-one. It doesn't get to be a pretty yellow/blue card, but is pretty similar."},
{"name":"City Quarter","nicename":"city-quarter","history":" One of the first Debt cards was +3 Cards +1 Action, for some large amount of Debt that I tweaked some. It was an interesting card to consider. It's two Laboratories in one card; that's different in various small ways from actually having two Labs. In the end it seemed too strong too early. I tried a version that either drew 3 cards or got two Treasures from your discard pile, that cost more up front. I tried a giant Pawn briefly. Then, a Village that had you draw a card the next 2 times you played an Action; it addressed early power level some but had tracking issues, especially in multiples. Finally it turned into the published card. It can go nuts, but you have to set it up; you do not want it turn one."},
{"name":"Crown","nicename":"crown","history":" The first version was an Action that played an Action or Treasure twice. You really want it to be a Treasure too, so you don't draw it dead off of card-drawing. So, an Action - Treasure card! It always seemed like that would be too confusing, but here was one that was no trouble. It's something how popular it is even in games where you are almost always using it as Throne Room."},
{"name":"Encampment / Plunder","nicename":"encampment","history":" The idea to Encampment was to go back to the pile, that was the neat part; Plunder can get uncovered but then re-covered. Encampment is a card that's not shabby to play as a one-shot you only paid $2 for. At first you had to have Plunder to keep it; that sometimes worked well, sometimes not so well. To improve the card it changed to also letting you reveal Gold; it flirted with just referring to Treasures costing $6 or more (with a $6 Plunder), but naming the cards is simpler. Later on Encampment changed to being set aside, only going to the pile at the end of the turn, which sometimes stops you from buying it back (but lets you buy the Plunder), but was done as a precaution against recursion that helps you remember you got those extra Actions this turn. Plus it neatly solved the issue of clearly having it be that Overlord as Encampment goes to the Overlord pile, not the Encampment pile.\nPlunder meanwhile started out as a treasure giving +1 Buy, and +$1 per Buy you have. It had been its own pile and had seemed cool for a while, but it dominated games, you buy them up as a combo with each other. It's like Bridge but different in lots of ways and in the end stronger. Even the half-pile version bugged me, and finally I replaced it with a straight treasure version of Monument. It cost $6 first but then seemed like it could be $5. I had already tried a similar card in the set that could sometimes go on your deck when discarded from play, but left that part out for this version."},
{"name":"Encampment / Plunder","nicename":"plunder","history":" The idea to Encampment was to go back to the pile, that was the neat part; Plunder can get uncovered but then re-covered. Encampment is a card that's not shabby to play as a one-shot you only paid $2 for. At first you had to have Plunder to keep it; that sometimes worked well, sometimes not so well. To improve the card it changed to also letting you reveal Gold; it flirted with just referring to Treasures costing $6 or more (with a $6 Plunder), but naming the cards is simpler. Later on Encampment changed to being set aside, only going to the pile at the end of the turn, which sometimes stops you from buying it back (but lets you buy the Plunder), but was done as a precaution against recursion that helps you remember you got those extra Actions this turn. Plus it neatly solved the issue of clearly having it be that Overlord as Encampment goes to the Overlord pile, not the Encampment pile.\nPlunder meanwhile started out as a treasure giving +1 Buy, and +$1 per Buy you have. It had been its own pile and had seemed cool for a while, but it dominated games, you buy them up as a combo with each other. It's like Bridge but different in lots of ways and in the end stronger. Even the half-pile version bugged me, and finally I replaced it with a straight treasure version of Monument. It cost $6 first but then seemed like it could be $5. I had already tried a similar card in the set that could sometimes go on your deck when discarded from play, but left that part out for this version."},
{"name":"Enchantress","nicename":"enchantress","history":" A late card, replacing another attack. I quickly tweaked the resources and the wording, but the premise worked immediately."},
{"name":"Engineer","nicename":"engineer","history":" For a while there was a different Workshop: Gain a card costing up to $4, get +1 VP per empty pile. It seemed reasonable and then I had one too many games that were dominated by it. I tried a lot of replacements, man, like ten other cards, mostly very briefly. Engineer stood out. However it had the issue of being able to trash it to gain something plus another Engineer, to run out the pile. Dame Josephine suggested having it cost Debt, which fixed that problem while taking no space on the card."},
{"name":"Farmers’ Market","nicename":"farmers-market","history":" At first you got the VP and trashed it at the same time you got the +$4. That was too big of a pay-off, so I separated out the VP. Before Farmers' Market I briefly tried an Explorer variant that increased in $ ala Farmers' Market."},
{"name":"Forum","nicename":"forum","history":" This started at $2 with +2 Cards instead of +3. There were several possible ways to do \"when buy +buy\" to try to not empty piles too quickly; the solution here was, a more powerful card costing $5."},
{"name":"Gladiator / Fortune","nicename":"gladiator","history":" Some split piles were having trouble getting to the 2nd card often enough. For Fortune I made a card that specifically eats its half-pile. A single Gladiator purchase can do the trick. The card was inspired by Chariot Race, trying to be another way to do that kind of thing, since we liked Chariot Race.\nFortune started as its own pile. It was a Debt card back when they could all be bought with no $. The first version was $10; in the end it's $16, with $8 up front please. That's how good double your $ is, taking into account that sometimes it helps pay for itself. And originally you could use multiple Fortunes in a turn and well doubling doublers is always trouble (Throning a Throne isn't actually doubling a doubler, person who thinks of that; however King's Court on King's Court is). There were \"discard your hand\" versions, but in the end it got a harsh clause to limit you to one doubling per turn. When Fortune became a split pile card, it got the when-gain ability to tie in to Gladiator."},
{"name":"Gladiator / Fortune","nicename":"fortune","history":" Some split piles were having trouble getting to the 2nd card often enough. For Fortune I made a card that specifically eats its half-pile. A single Gladiator purchase can do the trick. The card was inspired by Chariot Race, trying to be another way to do that kind of thing, since we liked Chariot Race.\nFortune started as its own pile. It was a Debt card back when they could all be bought with no $. The first version was $10; in the end it's $16, with $8 up front please. That's how good double your $ is, taking into account that sometimes it helps pay for itself. And originally you could use multiple Fortunes in a turn and well doubling doublers is always trouble (Throning a Throne isn't actually doubling a doubler, person who thinks of that; however King's Court on King's Court is). There were \"discard your hand\" versions, but in the end it got a harsh clause to limit you to one doubling per turn. When Fortune became a split pile card, it got the when-gain ability to tie in to Gladiator."},
{"name":"Groundskeeper","nicename":"groundskeeper","history":" First this cost $2 and let you pay $1 extra when buying a card to get +1 VP. It was nuts. It shifted to only working on Victory cards and then to costing $5 up front and none later."},
{"name":"Legionary","nicename":"legionary","history":" The first version had the other players \"discard a card then draw up to 3\" each time you played a Silver. So you got the full effect only if you played three Silvers. I quickly ran through a few variants before settling on, reveal a Gold to have them discard down to 2 then draw (an attack from Dark Ages that had been too annoying, but that one was cheaper and didn't require revealing a Gold). But then for a while it instead triggered on playing a Gold; for some reason I thought that might be better. It wasn't and it's back to revealing a Gold."},
{"name":"Overlord","nicename":"overlord","history":" Around when I found the good forms of Royal Blacksmith and City Quarter, I thought of trying a bigger Band of Misfits with Debt. It was preceded by related cards - Trash a non-Treasure, gain an Action for up to $7 and play it; then +1 Action, gain an Action for up to $6/$5 and play it. Gaining the card is so much simpler but just madly rushes the game end. Overlord costs 8 Debt but doesn't obviously lock itself out from being worthwhile turn one; somehow it all works out here."},
{"name":"Patrician / Emporium","nicename":"patrician","history":" Patrician started as its own pile. It never changed except to become half of a pile. I liked it as a full pile but it was a good fit for half of a pile. Originally it got to interact with Debt cards, since they had high $ costs, but I still liked the card when it stopped doing that.\nEmporium started out as a village you could trash for +VP based on how many Action cards you had in play. I tried a few sizes. I liked that whole idea of cashing in cards for VP, but you don't so much want to do it until your last turn of the game, which is not great, and making it fair when it's good can mean making it weak most of the time. I fixed up the concept by making it a threshold; you either get VP or don't, and can't get more with more Actions. Patrician is a combo with it both ways (finds it, helps reach the threshold), which is cute. The threshold was 6 Actions for a while; one day Matt said, why not 5."},
{"name":"Patrician / Emporium","nicename":"emporium","history":" Patrician started as its own pile. It never changed except to become half of a pile. I liked it as a full pile but it was a good fit for half of a pile. Originally it got to interact with Debt cards, since they had high $ costs, but I still liked the card when it stopped doing that.\nEmporium started out as a village you could trash for +VP based on how many Action cards you had in play. I tried a few sizes. I liked that whole idea of cashing in cards for VP, but you don't so much want to do it until your last turn of the game, which is not great, and making it fair when it's good can mean making it weak most of the time. I fixed up the concept by making it a threshold; you either get VP or don't, and can't get more with more Actions. Patrician is a combo with it both ways (finds it, helps reach the threshold), which is cute. The threshold was 6 Actions for a while; one day Matt said, why not 5."},
{"name":"Royal Blacksmith","nicename":"royal-blacksmith","history":" One of the first Debt cards was +5 Cards, you may put your deck into your discard pile. It cost $10 at first, but varied. For a while it seemed like one of the more reasonable Debt cards. It wasn't good immediately, when your deck had mostly Coppers. Or was it? Gradually I got disenchanted with the deck-flipping; it was there to make you less sad to draw at the bottom of your deck, but sometimes meant you got it in every hand when you weren't actually drawing your whole deck. You zoomed to victory or didn't, depending on where it was in your deck. Then I got focused on wanting the big Debt cards to really not be good right away. I replaced the flipping with \"discard the Coppers\" and well there it is."},
{"name":"Sacrifice","nicename":"sacrifice","history":" The first version was identical except you only got +2 Actions when trashing an Action, and it cost $3. For a while it seemed good but you sure weren't too interested in trashing Actions to it. It's nice to have that option sometimes be meaningful."},
{"name":"Settlers / Bustling Village","nicename":"settlers","history":" This pile started with the flavor of the card names; nice names for a split pile, with the additional nice idea of having a village that wasn't available right away. It was trouble finding a good card to go in the top slot here; some cards left us just never getting to the village. In the end I used a card Matt made for a homemade set. It was perfect.\nI tried a few different bonuses on Bustling Village. There was +$1 per Settlers in play; get your top card if it's an Action per Settlers; there was +VP based on the cards in your hand. Then I tried getting a Settlers from your discard pile and I liked that one. Then Settlers became Matt's card and I like how that ends up, where you play Bustling Village to get Settlers and then Settlers to get Copper."},
{"name":"Settlers / Bustling Village","nicename":"bustling-village","history":" This pile started with the flavor of the card names; nice names for a split pile, with the additional nice idea of having a village that wasn't available right away. It was trouble finding a good card to go in the top slot here; some cards left us just never getting to the village. In the end I used a card Matt made for a homemade set. It was perfect.\nI tried a few different bonuses on Bustling Village. There was +$1 per Settlers in play; get your top card if it's an Action per Settlers; there was +VP based on the cards in your hand. Then I tried getting a Settlers from your discard pile and I liked that one. Then Settlers became Matt's card and I like how that ends up, where you play Bustling Village to get Settlers and then Settlers to get Copper."},
{"name":"Temple","nicename":"temple","history":" At first it didn't have the when-gain ability (or put VP on the pile, don't be silly). When I thought of having VP tokens on piles, I added that part, and it all worked out."},
{"name":"Villa","nicename":"villa","history":" Originally this just gave +1 Buy when you bought it. One day I thought of having a card that let you play an Action when you bought it, and after a few quick iterations it landed here, as the Village you buy to help out that same turn. For a while it was played when you bought it, but that has some tricky interactions, which were resolved by putting it into your hand instead, and giving you +1 Action to play it with."},
{"name":"Wild Hunt","nicename":"wild-hunt","history":" This started out being trashed to get the VP. You don't want to trash your Smithy. I changed it to gaining an Estate (trying to make sure you couldn't make VP forever this way) and it was much better."},
{"name":"Advance","nicename":"advance","history":" This never changed."},
{"name":"Annex","nicename":"annex","history":" Late in the going, I had Events that handed out Estate, Province, Curse, Copper, Silver, and Gold (*checks other Events*... huh he's right); where was Duchy? This finally makes good use of an ability I'd tried in a few forms in previous sets, especially Hinterlands."},
{"name":"Banquet","nicename":"banquet","history":" This started as a Treasure for $3 that was worth $1 and came with a Copper and a $5 (then, a Copper and a non-VP $5). I liked it like that, but changing it to an Event saved a slot and made it less fast at running out piles."},
{"name":"Conquest","nicename":"conquest","history":" This never changed."},
{"name":"Delve","nicename":"delve","history":" This was an idea from Adventures that I never got around to trying there. It's the only one of those I tried, and it worked great."},
{"name":"Dominate","nicename":"dominate","history":" This never changed. Which is funny for an Event costing $14. The idea was to have a next step after Colony, and I could simulate it with an Event rather than spend 12 cards on it."},
{"name":"Donate","nicename":"donate","history":" This started out costing $8. It was too swingy, and I fixed it by making it 8 debt. Now we can all figure out a plan for when to get it and it doesn't come down to draws, you can just always get it. At first it happened in Clean-up, but I had to move it to between turns due to Possession."},
{"name":"Ritual","nicename":"ritual","history":" I tried an Event that gave you a Curse in exchange for +1 VP per 2 Actions in play. It was a dud, then I tried trashing a card for VP, and there it is."},
{"name":"Salt the Earth","nicename":"salt-the-earth","history":" Trashing directly from the Supply tried out for Dark Ages - and cards were phrased to account for the possibility of it - but didn't pass the audition. This approach worked immediately though."},
{"name":"Tax","nicename":"tax","history":" This started as an Action that gave +$2 and put two Debt tokens on a pile. Then it got a Setup rule that made piles start with Debt. It was hard squeezing everything into the set, and one trick was to turn this into an Event."},
{"name":"Triumph","nicename":"triumph","history":" This started out as an Action for $5 that gave +1 Card +1 Action +$1, and came with +1 VP per card you'd gained that turn (yes, looking a bit like Emporium). It was fun going nuts with it and so I tried variations - a Woodcutter version; one that gave +1 VP per 2 cards gained. Then I made it a Victory card worth 1 VP, that gave +1 VP per card gained that turn. That version was nice. But some games it's just sitting out, you don't have the combos. Space was limited and it could just be an Event. So there it is."},
{"name":"Wedding","nicename":"wedding","history":" This had a bonus I decided would have to wait for some future expansion I hope to put off making for a while. I replaced that part with +1 VP."},
{"name":"Windfall","nicename":"windfall","history":" This started out costing $6. It's a hard condition to meet so I felt like I could be just a little more generous."},
{"name":"Aqueduct","nicename":"aqueduct","history":" This started out putting 5 VP on each Treasure pile. I liked that but you only have so many VP tokens. I played around with how to cut down on tokens and ended up with 8 each on Silver and Gold."},
{"name":"Arena","nicename":"arena","history":" No changes."},
{"name":"Bandit Fort","nicename":"bandit-fort","history":" First it gave 8 VP if you had no Silver and no Gold. It's more fun to punish each one, so you can get a few Silvers and Golds and then see if you can get rid of them later."},
{"name":"Basilica","nicename":"basilica","history":" An earlier version was, when you buy a card, you may pay $3 to take 2 VP."},
{"name":"Baths","nicename":"baths","history":" No changes except that business about 12 VP turning into 6 VP per player."},
{"name":"Battlefield","nicename":"battlefield","history":" No changes except. This was the first one of these 6 VP per player cards, paving the way for more of them, plus other Landmarks that weren't \"when scoring.\" It was controversial, shouldn't they all be \"when scoring,\" but well they worked great."},
{"name":"Colonnade","nicename":"colonnade","history":" It was 1 VP when buying an Action you had in play, then 2 VP, then 2 VP with a limited supply of VP."},
{"name":"Defiled Shrine","nicename":"defiled-shrine","history":" It triggered on gaining a Curse, but it was not entertaining in games with Witches, so now you have to buy the Curse. The \"non-Gathering\" thing was a late change to deal with poor interactions between this and the cards that put VP on their own piles. It's kind of weird to have that type there just for this one thing, but it also ties the cards together. That's what I said when insisting on that change, and people's reactions to the Gathering cards has borne that out; they really are tied together."},
{"name":"Fountain","nicename":"fountain","history":" Stef Meijer suggested this one. It was one of the first Landmarks and so started out weaker, at 8 VP for 10 Coppers."},
{"name":"Keep","nicename":"keep","history":" Some versions gave you the points if you didn't have the fewest copies of a Treasure. It's the same in 2-player but was more political in multiplayer. I went back and forth on whether tying got you the VP, again with an eye towards reducing politics."},
{"name":"Labyrinth","nicename":"labyrinth","history":" No changes. Well in the initial version of the art, you couldn't do the maze; I got the artist to erase a bit of wall so you could do it."},
{"name":"Mountain Pass","nicename":"mountain-pass","history":" At first it was when the first Province was bought, the buyer bid first, no limit, and the prize was 10 VP. Since the correct bid might be infinity, there's a limit, and hey why not the total number of Debt tokens included. Gain felt better than buy; between turns dealt with Possession, man, that card. And eventually I lowered it to 8 VP to reduce the chance that you run out of Debt tokens."},
{"name":"Museum","nicename":"museum","history":" The initial idea was to reward you for having cards other players didn't. It was too political, and ended up as a straight Fairgrounds variant."},
{"name":"Obelisk","nicename":"obelisk","history":" Originally it could be any Kingdom card. I already knew from some Adventures playtesting that many people don't know that term. I used it anyway, then replaced it with Action."},
{"name":"Orchard","nicename":"orchard","history":" This started out giving a flat bonus of 5 VP if you had at least 3 copies of each card you had any copies of; then it was 10 VP if you had at least 2 of everything you had any of. It was too hard to go for, so it switched to giving VP per card you had 3 copies of, first 5 VP then a more reasonable 4 VP."},
{"name":"Palace","nicename":"palace","history":" Originally it was 2 VP per set."},
{"name":"Tomb","nicename":"tomb","history":" This one just worked."},
{"name":"Tower","nicename":"tower","history":" Originally any pile counted; it was slightly more interesting to not reward Victory cards, a thing Matt pushed for."},
{"name":"Triumphal Arch","nicename":"triumphal-arch","history":" It started at 2 VP per copy of your 2nd-most copious Action; Matt argued for bumping it up."},
{"name":"Wall","nicename":"wall","history":" First it was 8 VP if you had no more than 15 cards; then -1 VP per 2 cards in your deck; then the version you know and love. Inspired by that Adventures Victory card outtake that rewarded you for having a small deck (itself inspired by a conversation on BGG, where I talked about possible future Victory cards, and decided inverse-Gardens wouldn't be fresh enough, and David argued otherwise)."},
{"name":"Wolf Den","nicename":"wolf-den","history":" Never changed, though there were related cards that didn't work out."},
{"name":"Bard","nicename":"bard","history":" The simplest Fate card. I didn't have it immediately, but one day it was time to get simple. Some versions had an heirloom paired with it, since they glommed onto simple cards, but in the end it doesn't have one."},
{"name":"Blessed Village","nicename":"blessed-village","history":" A late card. Empires had had a Woodcutter that gave you a Boon when you gained it or trashed it. We all liked it a lot. It came under fire in Nocturne when you no longer knew what the Boon would be. One day it was one of the cards least able to cling to existence, and went. Then later still a village slot was freed up, see Ghost Town for details. I needed a new village. I tried a lot of crazy scaling villages, seeing if I could find something cool but fair. There were some cool things but not so much fair things. Finally I tried this, the most obvious idea but because I'd killed the Woodcutter I didn't go straight to it. It was great though. It's okay that you don't know what the Boon is; it's something, and you probably wanted a village anyway. You had not so much wanted the Woodcutter."},
{"name":"Cemetery/Haunted Mirror","nicename":"cemetery","history":" Hinterlands tried and failed to get a when-gain trasher. Guilds managed it via having the card's ability also be trashing. Cemetery manages it by not doing anything else, it's just VP. I was pretty thrilled with this when I thought of it, and then it played great, hooray.\nFor a while a card called Doomed Miner provided another way to get Ghost. The Miner would die in a cave-in, was the idea. The card itself didn't work out though. It was +$2, gain 2 Silvers, reveal top, if it's Silver this turns into Ghost. Matt complained that his group didn't like how hard it was to get Ghost (then for a bit it put the Ghost into your hand). And I realized I rarely bought it. So the Doomed Miner died, and it seemed like it would be nice if some other card got you a Ghost. I tried a few things, and one problem was, there weren't very many Ghosts. You didn't get very many with Exorcist, so there weren't very many; space was limited, even with 500 cards. So the new thing had to not make very many Ghosts. And well an Heirloom was perfect, it caps out at one per player. There were a couple quick versions of it and then it locked in. And got paired with Cemetery because of the Ghost angle and wanting to be on a trasher."},
{"name":"Cemetery/Haunted Mirror","nicename":"haunted-mirror","history":" Hinterlands tried and failed to get a when-gain trasher. Guilds managed it via having the card's ability also be trashing. Cemetery manages it by not doing anything else, it's just VP. I was pretty thrilled with this when I thought of it, and then it played great, hooray.\nFor a while a card called Doomed Miner provided another way to get Ghost. The Miner would die in a cave-in, was the idea. The card itself didn't work out though. It was +$2, gain 2 Silvers, reveal top, if it's Silver this turns into Ghost. Matt complained that his group didn't like how hard it was to get Ghost (then for a bit it put the Ghost into your hand). And I realized I rarely bought it. So the Doomed Miner died, and it seemed like it would be nice if some other card got you a Ghost. I tried a few things, and one problem was, there weren't very many Ghosts. You didn't get very many with Exorcist, so there weren't very many; space was limited, even with 500 cards. So the new thing had to not make very many Ghosts. And well an Heirloom was perfect, it caps out at one per player. There were a couple quick versions of it and then it locked in. And got paired with Cemetery because of the Ghost angle and wanting to be on a trasher."},
{"name":"Changeling","nicename":"changeling","history":" For a while this was just the top, a sleek simple classic card. We liked it but Matt's group not so much. I tried putting the gained card on your deck, but I like to go light on that as it's easy to forget and a more complex concept. Then I thought of the bottom as a way to hit the flavor harder; your Skulk is swapped at birth for a Changeling."},
{"name":"Cobbler","nicename":"cobbler","history":" The initial idea was for Tracker. Instead of putting cards on your deck, it could set them aside to go into your next hand. It sounded cool and it was, but it was also nuts. So then it just worked on one card per turn. That's way simpler if you just gain a card and do that with it. So, Tracker went back to being Tracker, and another Workshop in the set took this concept. Its other concept was more complex and it seemed like it could be shaved off. So now it was a Workshop that set aside a card for next turn. Matt suggested that it could just gain you a card next turn, even simpler, and mostly better, as you know what your hand is then. And then it needed a buff and became a Night card. The final card does not look much like the premise, but there's a thread stretching back to it."},
{"name":"Conclave","nicename":"conclave","history":" I liked the idea so much on Imp that I tried it out on a village too. There was a version that did the \"you may play a card you don't have a copy of in play\" thing twice, then the version that made it out, which lets the second card be a repeat."},
{"name":"Crypt","nicename":"crypt","history":" A late card, though the set had a history of Night cards that imitated Scheme. There was a card that put all copies of one card onto your deck, then one that put any two cards on your deck. Then I tried saving a treasure for next turn as resources on a Night card with other stuff going on, then made it its own card. Finally I hit on letting you go nuts with it."},
{"name":"Cursed Village","nicename":"cursed-village","history":" For a while there was another Library+Village thing that seemed okay. I guess it wasn't quite there. When I wanted to try a card that hexed you when you got it, I thought of this Library+Village thing, and liked it better than the other one. There was the question of, is it okay that discard Hexes miss or mostly miss. We tried Cursed Village setting aside the Hex for your next hand, but it was too easy to forget; people are better at remembering things they actually want to happen. It could have been that Hexes had categories so that Cursed Village always hit one that mattered, but there's no space for that on the little diagonal bar, it would have to be in the text box or something. In the end I decided it was okay if the Hex missed sometimes; it makes the card a little less scary to buy."},
{"name":"Den of Sin","nicename":"den-of-sin","history":" I tried a few forms of scaling next-turn card-drawing Night cards. One that was in the set for a while was a Coppersmith variant, as I liked to think of it - name a card, per copy of it you have in play you set aside a card from your deck, next turn you get the cards. Early on you pick Copper mostly. Eventually you might pick the card itself, or something else. Sometimes we liked this and sometimes we didn't. It would seem fair and then seem crazy. As crazy started seeming to be the winner, the card got less attractive. I made a few versions of it but did not hit on a great version. Then I scrapped it for this. It feels like the other card is part of the story though. The fix was to always give you +2 Cards, not a scaling number. And it goes to your hand, which one of the versions of the other one tried."},
{"name":"Devil’s Workshop","nicename":"devils-workshop","history":" One of the first Night cards, somehow going the distance with no changes. It was a poster child for Night all through work on the set."},
{"name":"Druid","nicename":"druid","history":" One of the original Fate cards was gain a Silver, receive a Boon but don't discard it unless your top card is Silver; when it was the only Fate card, the Boon might stay the same all game. When the Boons switched to being choice-of-3, this card switched to being choice-of-3. When the Boons switched to being random, this card got setup to stay a choice of 3. And it sat on the list of cards that might get cut for a while, and then I replaced \"gain a Silver\" with \"+1 Buy\" and suddenly I liked it a lot more."},
{"name":"Exorcist","nicename":"exorcist","history":" An early Night card, but pared down. It sounded cool to do a Remodel that gained one of three non-supply cards. This set could have the cards, and could give them other uses too. I had the idea before I had any of the cards; then I slotted Ghost (tweaked from an Empires outtake) into the $4 slot, and made Will-o'-Wisp to be a card a Boon gave you. Imp came last and then I could try Exorcist. At first it could trash cards from play too. It could only trash non-Duration cards because of tracking issues, but then we had trouble remembering that so then it could only trash Treasures from play. It was too powerful and cutting that part was key. And simplified it, hooray. It ended up a Night card that doesn't need to be a Night card, but I decided I preferred that to switching it to an Action."},
{"name":"Faithful Hound","nicename":"faithful-hound","history":" A late card. There had been an heirloom that you set aside for your next hand when you discarded it. It was not obvious that it worked in clean-up. I fiddled with it and then replaced it. And then brought back the concept, sans the clean-up part, on this card. It has been some years since Tunnel, we are ready for something else to care about discarding it."},
{"name":"Fool/Lucky Coin/Lost in the Woods","nicename":"fool","history":" One of the first cards in the set, just after starting work on it as its own set. At first it gave you the next three Boons in any order. Then when it was a choice of three, it gave you all three. Then it was back to three random ones. But this basic functionality, get three Boons, was there for a while and did not really change much.\nBut wait. One game I was in was so very slow, because it was all casual players who bought up Fools, and we had a Throne and they Throned it and turns took forever. And I vowed that day to stop Fool from being Throned. I tried various things, including bonuses if you Throned it but which weren't getting Boons. In the end though I decided maybe I could pair it with Lucky Coin and the Silvers you gained would slow down how often you played Fool enough to avoid problems.\nBut wait. While testing recommended sets, Matt had a game that was awful, that had Fool and Golem. And I remembered, man, didn't I vow something here? I sprang into action trying a pile of different versions of Fool, various ways to stop it from being Throned. One version had a card the Fools went on, and Lucky Coin brought them back. This was a funny thing because anyone told how this worked would immediately say \"oh that doesn't work, you'll lose track of which Fools are yours.\" It always worked perfectly; you just have yours face you. Everyone has their own chair you see. Anyway that was one of the versions. And Dave Goldthorpe suggested, instead there could be one card that moved around, he called it Foolish, and that card stopped you from playing Fools. And Destry Miller said, what if that card gave you a benefit while you had it? And I made it Lost in the Woods, with a discard clause so that you could discard a dead Fool to it, and a Boon because that's what you came here for right, you bought Fool to get Boons. And they all lived happily ever after.\nLucky Coin was one of the first Heirlooms, bopping around from card to card. It ended up here to slow down the Boonage and then maybe didn't have to stay but I didn't want to keep testing late changes so here it is still on Fool. It uh gains you Silvers, it was a simple idea and didn't need tweaking."},
{"name":"Fool/Lucky Coin/Lost in the Woods","nicename":"lucky-coin","history":" One of the first cards in the set, just after starting work on it as its own set. At first it gave you the next three Boons in any order. Then when it was a choice of three, it gave you all three. Then it was back to three random ones. But this basic functionality, get three Boons, was there for a while and did not really change much.\nBut wait. One game I was in was so very slow, because it was all casual players who bought up Fools, and we had a Throne and they Throned it and turns took forever. And I vowed that day to stop Fool from being Throned. I tried various things, including bonuses if you Throned it but which weren't getting Boons. In the end though I decided maybe I could pair it with Lucky Coin and the Silvers you gained would slow down how often you played Fool enough to avoid problems.\nBut wait. While testing recommended sets, Matt had a game that was awful, that had Fool and Golem. And I remembered, man, didn't I vow something here? I sprang into action trying a pile of different versions of Fool, various ways to stop it from being Throned. One version had a card the Fools went on, and Lucky Coin brought them back. This was a funny thing because anyone told how this worked would immediately say \"oh that doesn't work, you'll lose track of which Fools are yours.\" It always worked perfectly; you just have yours face you. Everyone has their own chair you see. Anyway that was one of the versions. And Dave Goldthorpe suggested, instead there could be one card that moved around, he called it Foolish, and that card stopped you from playing Fools. And Destry Miller said, what if that card gave you a benefit while you had it? And I made it Lost in the Woods, with a discard clause so that you could discard a dead Fool to it, and a Boon because that's what you came here for right, you bought Fool to get Boons. And they all lived happily ever after.\nLucky Coin was one of the first Heirlooms, bopping around from card to card. It ended up here to slow down the Boonage and then maybe didn't have to stay but I didn't want to keep testing late changes so here it is still on Fool. It uh gains you Silvers, it was a simple idea and didn't need tweaking."},
{"name":"Ghost Town","nicename":"ghost-town","history":" Early on the set had a village that went into your next hand. It was pretty sweet. And, separately, I had a Night card that was a village for your next turn. That was cool too; at first it had a Duchess-like rider that let you get it when you trashed an Action, but that didn't come up enough so I slimmed it down to the sleek basic effect. And then Billy suggested combining the two cards and here we are. It was a better way to implement the village - no setting it aside - and spiced up the Night card."},
{"name":"Guardian","nicename":"guardian","history":" Early on the set had a village that went into your next hand. I just told you about that. It was great so I thought I should try a second card like that, and the obvious concept was a Moat. At first it was a pure Reaction that was set aside for your next hand when you got it, and came with a Gold; then the Gold idea went on Skulk, and Guardian changed to be a Night card that gave you a Boon next turn, and went to your hand when gained. The Boon was too slow (since playing Guardian doesn't use up an Action), so now it just gives you +$1."},
{"name":"Idol","nicename":"idol","history":" I wanted a Treasure that gave Boons, but didn't want to slow the game down too much. So it gives you one every other time, and Curses the other times. It also does the nice trick of being a Cursing attack that doesn't always run out the Curses."},
{"name":"Leprechaun","nicename":"leprechaun","history":" The initial idea here was a card that gave you a Boon someone else picked. Then it was a random Boon, and then became the impetus for changing the Boons to be random. You can blame it all on the Leprechaun. Originally it cost $5, and gave you a Gold and a warped Boon and had the Wish clause. There was talk of the random Boon somehow being mandatory, so that a few of them could end up hurting you. But you know what would really hurt? Something that always hurt. So Leprechaun also was the impetus behind the Hexes. And it gave you a Hex and well. Good times. At first it always hexed you, but I liked it better exempting you if you got the Wish."},
{"name":"Monastery","nicename":"monastery","history":" One of the first Night cards was a trasher. It wasn't very interesting. Then I thought of this one and it went the distance. It calls out Copper like that because I need to avoid hitting Duration cards in play (or Thrones that played them), and \"Treasures\" does the trick; but really, while in some situations you'd trash another Treasure, mostly you want to trash Copper, and it's simpler to just stop there. You can trash that other Treasure from your hand if you must."},
{"name":"Necromancer/Zombies","nicename":"zombies","history":" This card came from the name. I had a list of names that fit the flavor of the set, and in some conversation thought, hey Necromancer could play cards from the trash. For a while it was a Band of Misfits, it became the card. You played it as something in the trash. That was way more confusing but seemed the only way to do it. And it had this looming problem of how best to stop infinite loops, plus sometimes a tracking issue (how many of these did I play as Markets?). Matt suggested turning the cards in the trash face down for the turn to both track what you'd done and stop infinite loops; this solved those problems, but also turned out to open the door to changing it to play the cards outright, rather than being Band of Misfits. This fixes some poor rules situations and also has better flavor; it plays the Zombies, it doesn't become a Zombie. Not working on Duration cards was a late change; there's no tracking there, which is awful.\nThere were always three Zombies. At first they were Night cards, and Necromancer could also play Night cards, but that was more confusing than it was worth. For the first test they were Woodcutter, Smithy, Remodel. It was clear that one wanted to be a cantrip, so you could play Necromancer as that if you couldn't do better, and one wanted to provide a way to get things into the trash, a way that wasn't too generous and yet might get good cards there. In the end two do that: Zombie Mason may randomly hit a good Action, and Zombie Apprentice just flat out does it, but doesn't get people to immediately trash their good Actions - though, if you have a bunch of Necromancers... "},
{"name":"Necromancer/Zombies","nicename":"necromancer","history":" This card came from the name. I had a list of names that fit the flavor of the set, and in some conversation thought, hey Necromancer could play cards from the trash. For a while it was a Band of Misfits, it became the card. You played it as something in the trash. That was way more confusing but seemed the only way to do it. And it had this looming problem of how best to stop infinite loops, plus sometimes a tracking issue (how many of these did I play as Markets?). Matt suggested turning the cards in the trash face down for the turn to both track what you'd done and stop infinite loops; this solved those problems, but also turned out to open the door to changing it to play the cards outright, rather than being Band of Misfits. This fixes some poor rules situations and also has better flavor; it plays the Zombies, it doesn't become a Zombie. Not working on Duration cards was a late change; there's no tracking there, which is awful.\nThere were always three Zombies. At first they were Night cards, and Necromancer could also play Night cards, but that was more confusing than it was worth. For the first test they were Woodcutter, Smithy, Remodel. It was clear that one wanted to be a cantrip, so you could play Necromancer as that if you couldn't do better, and one wanted to provide a way to get things into the trash, a way that wasn't too generous and yet might get good cards there. In the end two do that: Zombie Mason may randomly hit a good Action, and Zombie Apprentice just flat out does it, but doesn't get people to immediately trash their good Actions - though, if you have a bunch of Necromancers... "},
{"name":"Night Watchman","nicename":"night-watchman","history":" Messing with the top of your deck was one of the things Night cards could do, so here was one doing it. At first it said \"when you gain or play this,\" then it switched to being gained to your hand after Billy suggested that."},
{"name":"Pixie/Goat","nicename":"pixie","history":" One of the early Fate cards was an attack. Eventually it got \"Receive the same Boon twice.\" That part was fun and kept the card around for too long. It was also problematic; what if there's no trashing this game, and I get The Flame's Gift twice and you don't? When I got sick of having the attack endlessly played (a Militia-family attack), I changed it to non-attack interaction, where you got the Boon 3 times once any Provinces had been gained. People had liked the doubled Boon more when you could pick the Boon, and some versions messed with getting some choice into the mix. It seemed like playtesters would never be happy with it now, and I killed it, then brought it back as Pixie (after it first only gave you the Boon once). You get a choice of Boons in that you can just let the revealed Boon slide and keep the Pixie. And that's all it does, I mean it's a cantrip but there's no attack.\nAnd then, aha, pairing Pixie with Goat means that The Flame's Gift is never as big of a prize; we all have a trasher. Goat was not an early Heirloom, but was an obvious one to try once it turned out I would be stuck making seven of them. It of course worked fine. It cost $4 for a while, but dropped to $2 to dodge War and Knight-family attacks."},
{"name":"Pixie/Goat","nicename":"goat","history":" One of the early Fate cards was an attack. Eventually it got \"Receive the same Boon twice.\" That part was fun and kept the card around for too long. It was also problematic; what if there's no trashing this game, and I get The Flame's Gift twice and you don't? When I got sick of having the attack endlessly played (a Militia-family attack), I changed it to non-attack interaction, where you got the Boon 3 times once any Provinces had been gained. People had liked the doubled Boon more when you could pick the Boon, and some versions messed with getting some choice into the mix. It seemed like playtesters would never be happy with it now, and I killed it, then brought it back as Pixie (after it first only gave you the Boon once). You get a choice of Boons in that you can just let the revealed Boon slide and keep the Pixie. And that's all it does, I mean it's a cantrip but there's no attack.\nAnd then, aha, pairing Pixie with Goat means that The Flame's Gift is never as big of a prize; we all have a trasher. Goat was not an early Heirloom, but was an obvious one to try once it turned out I would be stuck making seven of them. It of course worked fine. It cost $4 for a while, but dropped to $2 to dodge War and Knight-family attacks."},
{"name":"Pooka/Cursed Gold","nicename":"pooka","history":" The +Cards version of Moneylender was an idea that had been sitting around. It was in Empires for a while, first as +3 Cards with another ability, and then +3 Cards and a Boon. While those didn't make the cut, the basic idea seemed worth keeping in mind, and went into the Boonies file when I made it. It appears here at +4 Cards, with an Heirloom that it can't trash. It's a simple but subtle card.\nCursed Gold was an early star of the Heirlooms. It never changed. It can cost $4 because you are happy to lose it to Knights."},
{"name":"Pooka/Cursed Gold","nicename":"cursed-gold","history":" The +Cards version of Moneylender was an idea that had been sitting around. It was in Empires for a while, first as +3 Cards with another ability, and then +3 Cards and a Boon. While those didn't make the cut, the basic idea seemed worth keeping in mind, and went into the Boonies file when I made it. It appears here at +4 Cards, with an Heirloom that it can't trash. It's a simple but subtle card.\nCursed Gold was an early star of the Heirlooms. It never changed. It can cost $4 because you are happy to lose it to Knights."},
{"name":"Raider","nicename":"raider","history":" One of the early cards that led the charge of \"look what a Night card can do.\" For maybe a day it hit players with 4 or more cards in hand; then it stayed unchanged until very late, when it went from $5 to $6."},
{"name":"Sacred Grove","nicename":"sacred-grove","history":" At first this gave +3 Cards, I had not learned that lesson yet. And the other players could opt for a Silver instead of the Boon if they wanted; concern over, hey aren't a couple of the Boons useless when it's not your turn? There were a few variants trying to deal well with that situation, before I decided, man it's fine, sometimes the Sacred Grove is piggy. It's explicitly piggy so people don't wonder what happens with those Boons."},
{"name":"Secret Cave/Magic Lamp","nicename":"secret-cave","history":" Secret Cave came from testing cards out for the Sauna / Avanto promo. You're doing less this turn because you're in the Sauna; that was the angle. We liked it and I put it in the file when something else became Sauna. Here it is in Nocturne. As a Sauna it said \"if you don't buy anything this turn,\" and I changed it to discarding 3 cards.\nMatt suggested having an heirloom that turned into something if you had 6 different Action cards in play. I tweaked it to requiring uniques but allowing other cards; pairing it with Secret Cave meant it would almost always be possible to do it (Secret Cave draws you a 6th card; Copper Silver Gold, Magic Lamp itself, and some other Action or Treasure card). At first it was a Treasure Chest that made an Artifact (Harem but twice as big, an Empires split pile outtake); then it made a Genie that gave you stuff, then it made three Wishes. For a while it was a Night card and double-Heirloomed - you replaced two Coppers with a Silver and a Magic Lamp (so as to still make $7 over your first two turns, although you could get a $6/$1 opening). In the end it's a Treasure so that they're all Treasures and there are seven and all that. It used to not let you play more Coppers after it and now it lets you and I decided I could live with that."},
{"name":"Secret Cave/Magic Lamp","nicename":"magic-lamp","history":" Secret Cave came from testing cards out for the Sauna / Avanto promo. You're doing less this turn because you're in the Sauna; that was the angle. We liked it and I put it in the file when something else became Sauna. Here it is in Nocturne. As a Sauna it said \"if you don't buy anything this turn,\" and I changed it to discarding 3 cards.\nMatt suggested having an heirloom that turned into something if you had 6 different Action cards in play. I tweaked it to requiring uniques but allowing other cards; pairing it with Secret Cave meant it would almost always be possible to do it (Secret Cave draws you a 6th card; Copper Silver Gold, Magic Lamp itself, and some other Action or Treasure card). At first it was a Treasure Chest that made an Artifact (Harem but twice as big, an Empires split pile outtake); then it made a Genie that gave you stuff, then it made three Wishes. For a while it was a Night card and double-Heirloomed - you replaced two Coppers with a Silver and a Magic Lamp (so as to still make $7 over your first two turns, although you could get a $6/$1 opening). In the end it's a Treasure so that they're all Treasures and there are seven and all that. It used to not let you play more Coppers after it and now it lets you and I decided I could live with that."},
{"name":"Shepherd/Pasture","nicename":"shepherd","history":" This idea had been messed with in different forms over the years. This version always had the same ability text, but gained the Heirloom and then went from $5 to $4.\nI think the only change to Pasture was that once it cost $4. Some of the Heirlooms dropped below $3 to dodge War and some Knight-family attacks."},
{"name":"Shepherd/Pasture","nicename":"pasture","history":" This idea had been messed with in different forms over the years. This version always had the same ability text, but gained the Heirloom and then went from $5 to $4.\nI think the only change to Pasture was that once it cost $4. Some of the Heirlooms dropped below $3 to dodge War and some Knight-family attacks."},
{"name":"Skulk","nicename":"skulk","history":" The idea of a weak card that comes with Gold came from Guardian. I very briefly tried it on a Night card that Hexed, but that was too strong. So it's an Action that gives you +1 Buy. And you get a Gold with it! How could that be, someone out there is still wondering. Well uh. Like, what if the Hex is Poverty. That's a good Hex. Then Skulk was Militia, but instead of +$2 you got +1 Buy. Sometimes you really need the +1 Buy, I see that, but when you don't, man, +$2 is a lot more than +$0. Skulk is at its best when you have a way to Remodel it or something."},
{"name":"Tormentor","nicename":"tormentor","history":" When I made the Hexes, I made a card that just gave +$2 and handed out a Hex, to test them out. This card seemed fine, but space was tight, and did we really need both Bard and it, and other Hex-giving cards quickly crowded it out. I briefly tried a version that tried to do the Tracker trick of being a combo with Hexes, but it wasn't much of a combo with them. Then later on I was considering, are there ways to get a little more use out of the Spirits, and made this, a card that only gives you an Imp if it's alone. It could have been first play or only card in play; the latter is simpler but is messed up by Duration cards. The Imp is good, it felt like not playing nice with Duration cards was okay. The \"no other cards\" mechanic had been on another card earlier with a less sexy bonus. And then one late change to the set was having Tormentor not Hex them if you got the Imp; previously you got both, yeeha. The idea behind the change was just to get the order of effects better on the card; you want to reach for the Imp right away, while the other players want to reach for the Hex. It can't delay the Imp, but if the Imp is first then it's more awkward to phrase if you get both. But you know, once you are getting an Imp, you are happy, you don't need to Hex people too. And they're happy not to get Hexed; it's win-win."},
{"name":"Tracker/Pouch","nicename":"tracker","history":" One day I had the idea of having Fate cards that were combos with Boons. Looking through the Boons at the time, there were three areas the Fate card could potentially interact with: gaining cards, discarding cards, and the top of your deck. I tried gaining cards first, and we liked it so I tried the other two too; the discarding cards one survives as Faithful Hound, while the top of your deck one died. The gaining cards combo was Royal Seal's ability to put gained cards on your deck; you get The Swamp's Gift for example, and can put the Wisp on your deck. Briefly it tried being a twist on Royal Seal, where you also got a copy of the card from your discard pile onto your deck, but that didn't come up enough to be worth the text. And I tried letting you put the card anywhere in your deck; that didn't come up often enough either.\nTracker started out giving +2 Cards +1 Buy and a Boon on top, for $5. We had many long games with it. Eventually I came to my senses; it was simply not reasonable to put card-drawing on Fate cards. I tried out not always giving you the Boon, then dropped it down to +$1 for $2. Then I tried some variations that twisted the Royal Seal part again, to set aside cards for next turn instead of putting them on your deck, but in the end it was back to Royal Seal and +$1 for $2.\nPouch initially was the Heirloom worth $0. Just +1 Buy. That seemed like a nice change of pace to sometimes have, and some of us did like it, so there. Matt's group did not enjoy the slower games so much, and eventually I gave in and made it make $1. When Pouch made $0, it was important that it went on a card costing $2. It was on another one that didn't work out, then on the $2 Tracker. Which is a nice fit because +1 Buy is also a combo with Tracker's Royal Seal ability."},
{"name":"Tracker/Pouch","nicename":"pouch","history":" One day I had the idea of having Fate cards that were combos with Boons. Looking through the Boons at the time, there were three areas the Fate card could potentially interact with: gaining cards, discarding cards, and the top of your deck. I tried gaining cards first, and we liked it so I tried the other two too; the discarding cards one survives as Faithful Hound, while the top of your deck one died. The gaining cards combo was Royal Seal's ability to put gained cards on your deck; you get The Swamp's Gift for example, and can put the Wisp on your deck. Briefly it tried being a twist on Royal Seal, where you also got a copy of the card from your discard pile onto your deck, but that didn't come up enough to be worth the text. And I tried letting you put the card anywhere in your deck; that didn't come up often enough either.\nTracker started out giving +2 Cards +1 Buy and a Boon on top, for $5. We had many long games with it. Eventually I came to my senses; it was simply not reasonable to put card-drawing on Fate cards. I tried out not always giving you the Boon, then dropped it down to +$1 for $2. Then I tried some variations that twisted the Royal Seal part again, to set aside cards for next turn instead of putting them on your deck, but in the end it was back to Royal Seal and +$1 for $2.\nPouch initially was the Heirloom worth $0. Just +1 Buy. That seemed like a nice change of pace to sometimes have, and some of us did like it, so there. Matt's group did not enjoy the slower games so much, and eventually I gave in and made it make $1. When Pouch made $0, it was important that it went on a card costing $2. It was on another one that didn't work out, then on the $2 Tracker. Which is a nice fit because +1 Buy is also a combo with Tracker's Royal Seal ability."},
{"name":"Tragic Hero","nicename":"tragic-hero","history":" I tried several cards as ways to get another use for Ghost into the set (with Haunted Mirror being the one that stuck). One of them looked like this with no +Buy and Ghost instead of a Treasure. It was fun but you got too many Ghosts. You get a Ghost and it hits another Tragic Hero and that turns it into another Ghost. I played around with wordings that made that not happen but then Haunted Mirror took over. Late in the going I had a card I wasn't confident in, and I looked for what could replace it. I tried this, only gaining Gold, and it immediately worked out. Matt suggested that it could gain any Treasure and that worked out too."},
{"name":"Vampire/Bat","nicename":"vampire","history":" The idea was to have a vampire that turned into a bat. There were some other flavor things to maybe hit on, but that was the starting point. There were several versions of each card. Vampire always hexed, but played around with different resources, before landing on \"gain an Action.\" In the end that failed for the reason that it usually does - being crazy with expensive Actions. So it became \"gain a $5\" and then \"other than Vampire\" after a game with Matt's group where Alex went crazy for Vampires. The order of abilities shifted some, as everything wants to be first.\nBat started out an Action, but people demanded that it be a Night card too. For a while it was a Duration card, that drew you a card if it didn't turn back. That made it not so bad to have late-game Bats stuck in your deck. Mostly Bat could trash a card, and whether or not you got your Vampire back depended on what you trashed. Later it could trash two cards and cared about how many, settling on \"at least one.\" It didn't want to automatically turn back, but didn't want that to be difficult either."},
{"name":"Vampire/Bat","nicename":"bat","history":" The idea was to have a vampire that turned into a bat. There were some other flavor things to maybe hit on, but that was the starting point. There were several versions of each card. Vampire always hexed, but played around with different resources, before landing on \"gain an Action.\" In the end that failed for the reason that it usually does - being crazy with expensive Actions. So it became \"gain a $5\" and then \"other than Vampire\" after a game with Matt's group where Alex went crazy for Vampires. The order of abilities shifted some, as everything wants to be first.\nBat started out an Action, but people demanded that it be a Night card too. For a while it was a Duration card, that drew you a card if it didn't turn back. That made it not so bad to have late-game Bats stuck in your deck. Mostly Bat could trash a card, and whether or not you got your Vampire back depended on what you trashed. Later it could trash two cards and cared about how many, settling on \"at least one.\" It didn't want to automatically turn back, but didn't want that to be difficult either."},
{"name":"Werewolf","nicename":"werewolf","history":" When Night debuted, I figured there would be a bunch of Action - Night cards. I had one early on but it turned into a pure Night card and then died. When it stopped being Action - Night, there was a vacancy, and why not have a Werewolf? I mean there's your Action - Night card. At first it was phrased like Crown, then it was tweaked to what it is, which is maybe slightly simpler. I realized it would be neat to have it interact with Silver, but did not manage it."},
{"name":"Ghost","nicename":"ghost","history":" This started out in Empires, costing $10 minus $2 per Silver you had in play. Space for villages is often tight, and it left with the Boons. I changed it to a Night card, which has a certain something and also drops the need to say \"other than a Ghost.\" And you can't buy it so there's no special cost. The Night version went the distance. That is going to be the story of the Spirits."},
{"name":"Imp","nicename":"imp","history":" The same as the first version, except for how many copies there are, which I fiddled with as the set ran out of space. "},
{"name":"Will-o’-wisp","nicename":"will-o-wisp","history":" The same as the first version tried. This was designed specifically to work well as something a Boon gave you, but knowing that Exorcist would also give it to you. And Exorcist was behind Ghost getting that slot and then the design of Imp. And the costs of the three cards were picked to give Exorcist a simpler wording. It was all about Exorcist and well Exorcist came through for me."},
{"name":"Wish","nicename":"wish","history":" Magic Lamp gave out an Artifact first ($4 and 4 VP), then a Genie who could make $6's for you, then three Wishes which naturally make $6's. It's what the Genie had done and it sounded good for the card name. Then Leprechaun got Wish to give Wish more to do."},
{"name":"Envoy","nicename":"envoy","history":" This started in Intrigue. It fit with the decisions theme; you give your opponent a decision. Often that amounts to just \"discard the best card,\" and having your opponent pick just keeps you honest. Sometimes it's a real decision though. The mechanic seemed fine, but what the card did was, it was a terminal action that drew you cards. There was enough of that already between the main set and Intrigue. And the new part to Envoy was interesting, but didn't like give you a new deck to build or anything. In your deck, it was like a Smithy. So I took Envoy out, to perhaps try in a later expansion.\nThen one day Jay said, he needed a promo, could I have it say by tomorrow. I didn't want to steal a card from a future set, and also, I wanted something with as much playtesting as possible. That basically meant an outtake from the main set or Intrigue. Envoy was easily the best option."},
{"name":"Black Market","nicename":"black-market","history":" This started in Seaside. Seaside involves your next turn; Black Market reaches into the next game. It was adored by some players - a star of the set - and seemed harmless to everyone else. It left the set though, due to the combination of rules wackiness, and the cumbersome set-up. I have never had to do that set-up - I don't have separate randomizer cards, because why print 11 cards each time I change something when 10 will do. I use one card from each pile for the randomizer, putting it into the pile to play and returning one to the randomizer after the game. So Black Market had no set-up at all for me - I already had a pile of unused cards with the proper back right there. But we included a separate randomizer deck in the main set. So there was this set-up. So, wackiness, set-up, it left the set.\nThen we needed a promo, Dale said why not Black Market, and I was eager to have it exist after all. Ultimately it's not a great choice for a promo. It still has the set-up and still has the wackiness, only now you don't have a rulebook telling you how it works, you have a slip of paper you lose and then the internet. I'm still glad it exists though, it's a fun card."},
{"name":"Stash","nicename":"stash","history":" This is a Seaside outtake, though it started in a later small set that dissolved, from when I rearranged everything into 16-card expansions. It seemed like a good fit for Seaside's next-turn theme. There was a victory card with a similar mechanic, which did not seem worth preserving. Obv. you put that one on the bottom.\nStash had two issues. First, I didn't have the different-back mechanic yet. So like you set them aside, or dug through your discard pile for them. It was not going to be pretty rules-wise, since by default you can't look through your discard pile. And second, it was not that interesting. There are some cute interactions, but on the whole, it didn't seem necessarily worth a slot in the set. So it left.\nLater I realized I could have a different card back, solving the rules issues. I immediately put it on a list of potential promos, with an eye towards putting it in an expansion if it wasn't needed as a promo. It was though, and there it is. To me this is the ideal promo: exotic-looking, but not actually complex; interesting when you read about it, but not something I'm sad didn't make an expansion."},
{"name":"Walled Village","nicename":"walled-village","history":" This is an outtake from the 7th expansion. I replaced it with an on-theme card. A few people were sad to see it go, but all of the Village slots in the other sets were full, so it was dead.\nThen Jay wanted a Carcassonne-related promo card. First I looked at designing a card specifically to fit with Carcassonne, and well Carcassonne does not have a lot of ground in common with Dominion. Then I remembered this card, and it seemed plausible to call it Walled Village. Jay went for it and there it is. These stories can't all be interesting."},
{"name":"Governor","nicename":"governor","history":" So Jay wanted a Carcassonne-related promo for its anniversary and got Walled Village. Then he wanted another promo. The idea behind this promo was, that Stash had gone up at the BGG store paired with blanks, and well let's not do that again. So we needed another promo so it could be paired with Walled Village.\nJay initially thought, well, Power Grid was coming on its 10th anniversary too, or at least the original German version was (Funkenschlag), so how about something that tied in with Power Grid. He wanted it to be a green card of course. And we sat down and talked with Friedemann Friese about what could possibly be done. It wasn't sounding great. The flavor for Power Grid is not medieval, and then there wasn't an obvious mechanical thing to do that connected the games.\nI said, are there any other games with anniversaries coming up? And Jay said, as a matter of fact. Puerto Rico was also having an anniversary. And well simulating Puerto Rico on a Dominion card was easy; the only issue was making the text fit, which I cleverly managed via \"you get the version in parentheses.\" So while the previous promos were expansion outtakes, this one is a new card.\nThe first version of the card had +1 Card +1 Action, with the first option only giving you +2 Cards, i.e. it worked out the same as now if you wanted the cards, but gave you an extra card if you picked one of the other two things. The idea had been, that the bonus the other players get does not involve them spending a card or using an action, so it would be easier to balance the card if it also didn't cost you a card or an action. But the three options were not sufficiently balanced; the Remodel was especially crazy. So now you still get the same total number of cards if you pick cards, but you don't get a free card with your Gold or Remodel."},
{"name":"Prince","nicename":"prince","history":" Jay wanted a Dominion promo sometime. No rush. I eventually got around to it. I wanted something that felt like a promo; something exotic. I tried out a few ideas I had in the file; the one that played a card every turn was easily the highlight. So I worked on that one. It was an old idea, predating the original game being published. Back then I had decided maybe I would someday do it as a unique card, to get around the issue of using Prince on Prince; then I made unique cards for Tournament but didn't do it there. There were other ways to solve the problems though; as usual it just took lots of tiny text.\nThe first modern version cost $6 and set aside a cheaper card. And there were whatever issues with one-shots and duration cards and Throne Room. Gradually I weakened it until it cost $8 and only got cards costing $4 or less (barring Bridge etc.). That was just how good playing the same card every turn turned out to be. And you can't get two cards set aside via Throne Room and you don't get to go nuts with one-shots; we had those experiences and they were worth excising, even if it took a weird wording. Setting aside a duration card was too confusing, and anyway I needed one wording that handled every bad case, including Thrones on duration cards and Scheme'd cards. The key thing is looking for cards being discarded from play; those are the normal cards.\nSome versions of Prince were duration cards, because hey, it keeps doing stuff, right? But that didn't make sense because Prince wasn't in play, and what \"duration\" really means is, leave this in play until it stops doing stuff (and it was better to have Prince not be in play)."},
{"name":"Summon","nicename":"summon","history":" Altenburger, the German publisher, wanted a promo. I said, how about an Event? They said great. The Event actually promotes Adventures, the set with Events. A first for our promos.\nPlaytester Matt Engel, aka LastFootnote, is a big designer of homemade cards. I said, do you want to make this promo? He said meh. A bad day. He did end up making it and trying to sell me on its virtues. It all worked out.\nHis initial premise was, \"+1 Buy. Set aside the next Action card you buy this turn. At the start of your next turn, play it.\" I moved the buy into the functionality - \"You may buy an Action card...\" I initially was more interested in immediately playing the card, rather than next turn, but that turned out to be a dud.\nPlaytester Stef Meijer determined that \"buy an action, play it next turn\" was broken at $2. It turns out you should just do it every turn. I fixed that by changing it to \"Gain an Action card costing up to $4.\" Or if you prefer, that direction meant the card didn't need a prohibitive price. It still conservatively cost $6 at first, but we weren't buying it all that much and Matt pushed for it to go down to $5. It seemed fine at $5 and there it is. It's even better than the original on $4's, but you probably want some cards costing $5 at some point.\nIt has an unusual wording to deal with some of the weird things that can happen in Dominion. There are various ways for the card to vanish (e.g. Watchtower), so to make sure you have the physical card around to tell you what to do next turn, it gets set aside and then makes sure it was."},
{"name":"Sauna/Avanto","nicename":"sauna","history":" The Finnish publisher wanted a promo, to celebrate a company anniversary I think. We like to be friendly. They wanted something that somehow involved Finland. They suggested Sampo, a magical thing from the Kalevala. No-one would know what that was, and also no-one knows what it is; descriptions of it vary significantly. It could be an axis mundi, a mill, a compass, etc. So what more concrete thing could actually remind people of Finland? I think jsh357 suggested saunas. And the word \"sauna\" is actually a loanword from Finnish. They are super Finnish. And they had medieval ones.\nI tried a couple different concepts, mostly trying to key off of Baths, the Empires Landmark. You know, so stuff where if you didn't do anything you got something. The final concept was instead based on the idea of them being therapeutic.\nIt seemed nice to try to promote the most recent expansion, something only previously done with Summon. We talked about potential Landmarks, e.g. Northern Lights. I felt like it would be better to have a full pile this time, and it was hard coming up with more Landmarks. A split pile was perfect; it's novel to Empires, it doesn't require anything else, you can just play with it like a regular pile. And there's this thing, where they go back and forth from the sauna to the avanto. That sounded cool to simulate and I mean there it is.\nAvanto started as printed but I did try other versions at some point. There were a few versions of the trashing Sauna, trying to be fair and exciting. Towards the end the big thing was, should it trigger multiple times. It will be very slow early on, and then there will be a turn where you can trash a bunch of cards, due to multiple triggers. I felt like it was better to have that."},
{"name":"Sauna/Avanto","nicename":"avanto","history":" The Finnish publisher wanted a promo, to celebrate a company anniversary I think. We like to be friendly. They wanted something that somehow involved Finland. They suggested Sampo, a magical thing from the Kalevala. No-one would know what that was, and also no-one knows what it is; descriptions of it vary significantly. It could be an axis mundi, a mill, a compass, etc. So what more concrete thing could actually remind people of Finland? I think jsh357 suggested saunas. And the word \"sauna\" is actually a loanword from Finnish. They are super Finnish. And they had medieval ones.\nI tried a couple different concepts, mostly trying to key off of Baths, the Empires Landmark. You know, so stuff where if you didn't do anything you got something. The final concept was instead based on the idea of them being therapeutic.\nIt seemed nice to try to promote the most recent expansion, something only previously done with Summon. We talked about potential Landmarks, e.g. Northern Lights. I felt like it would be better to have a full pile this time, and it was hard coming up with more Landmarks. A split pile was perfect; it's novel to Empires, it doesn't require anything else, you can just play with it like a regular pile. And there's this thing, where they go back and forth from the sauna to the avanto. That sounded cool to simulate and I mean there it is.\nAvanto started as printed but I did try other versions at some point. There were a few versions of the trashing Sauna, trying to be fair and exciting. Towards the end the big thing was, should it trigger multiple times. It will be very slow early on, and then there will be a turn where you can trash a bunch of cards, due to multiple triggers. I felt like it was better to have that."},
{"name":"Dismantle","nicename":"dismantle","history":" Altenburger wanted a promo, this time to be used in some way in conjunction with having a bunch of tournaments for Dominion's 10th anniversary. There was no time to make a card. Dismantle was a card I had that had been working fine but had been cut from Nocturne (due to Nocturne having other cards that gain Gold).\nThe initial card was suggested by playtester Adam Horton, for Empires (which had no room left). His initial suggestion was for \"something like\" \"trash a card from your hand, gain a card costing up to $2 less into hand (or a Curse?), +$3.\" Based on that I initially tried \"Trash a card from your hand. Gain a cheaper card. If you did, +$3.\" It seemed promising and went into the Nocturne file. When the time came to work on it again, we tried it with +$4, then a Night version that gained Gold, then the final version.\nAltenburger also wanted the world champion for this coming year to get to make a card. We said no! We are willing to put their face on a card, that is as far as we will go. However, as it happens, Adam is the current world champion. So a world champion did get to design a card."},
{"name":"Baron","nicename":"baron","history":" Going into development, the set had 20 kingdom cards. One day Jay said it would be better for him if it had 25. You know, stuff is cheaper at larger volumes. Having 25 kingdom cards was fine by me, so 25 it was. So I had to add five cards.\nThis is one of them! I looked through the ideas file for stuff that fit the themes, and picked this as a supplement to the victory-cards-that-do-something-else theme."},
{"name":"Bridge","nicename":"bridge","history":" I tried something like this in the murky past for the main set, and decided it was too strong. I had a weaker version that I later tried on Woodcutter (it only made the 2nd copy of a card that you bought in the same turn cheaper), but decided that was too confusing for the main set. A while later I had just stolen a card from the 6th set for the main set, and needed a replacement. This idea sounded like it might not be trouble after all, and in fact it wasn't. I then stole this from that set for this one when I needed another +Buy card."},
{"name":"Bridge makes all cards cheaper, not just ones in the supply. This was to prevent problems in weird situations. I am not sure the kind of thing you'd need to get those problems will ever happen, but I knew that this way of doing it meant I was safe. This also allows some unusual combos to work.","nicename":"","history":"Bridge makes all cards cheaper, not just ones in the supply. This was to prevent problems in weird situations. I am not sure the kind of thing you'd need to get those problems will ever happen, but I knew that this way of doing it meant I was safe. This also allows some unusual combos to work."},
{"name":"Conspirator","nicename":"conspirator","history":" This was the last card added to the set, replacing a horribly broken card."},
{"name":"The broken card had its admirers. Two of Valerie & Dale's playtesters wrote essays defending the card. But the card was often unplayable and then sometimes dominated. So some games it made worse by being a dead card, and some games it made worse by making other cards dead. Now what it did was cool, and it's fun to sometimes get turns where you make 50+ coins, which is how it got defended. It's fun to do something you don't often get to do. But it just didn't make sense to put out such a messed up card. I'll try to fix it up for a later set and well that's why I'm not telling you what it did. There was no time to fix it up when I came to my senses though. So instead it got replaced. With this card. I like it.","nicename":"","history":"The broken card had its admirers. Two of Valerie & Dale's playtesters wrote essays defending the card. But the card was often unplayable and then sometimes dominated. So some games it made worse by being a dead card, and some games it made worse by making other cards dead. Now what it did was cool, and it's fun to sometimes get turns where you make 50+ coins, which is how it got defended. It's fun to do something you don't often get to do. But it just didn't make sense to put out such a messed up card. I'll try to fix it up for a later set and well that's why I'm not telling you what it did. There was no time to fix it up when I came to my senses though. So instead it got replaced. With this card. I like it."},
{"name":"Coppersmith","nicename":"coppersmith","history":" One of the times when I took something out and needed to replace it, I tried specifically to think of a new way to build up your money. This was the result. Double your Coppers! There are several directions to go with Coppersmith, but it's one of the trickier cards in the set. Those Coppersmith decks don't just build themselves.\n \n2nd Edition:\nThe 6th card dropped. I wanted to drop the same number of cards as with Dominion, and had only picked five. My playtesters leaned towards Coppersmith. I had a new Coppersmith-like concept to try - which didn't work out. Coppersmith is an interesting dud, there are games where it's useful. They aren't common though. I used to use it as an example of how a not-so-good card would still be better than a main set dud; I could improve the main set by replacing say Feast with Coppersmith. But when the time came, Coppersmith didn't make it either. It's fun to win with a card that you can only rarely win with, but very few Dominion cards should be trying to fill that role (and enough still are)."},
{"name":"Courtyard","nicename":"courtyard","history":" Almost all of the Dominion cards, from the main set and all of the hypothetical expansions, were designed by me. Which is just the way I like it. This one was not though. In the early days of Dominion, one of my friends printed/cut/sleeved his own copy, and along the way he added like a dozen cards. I played with them and liked a few that I hadn't thought of yet, and well this is one of them. I had previously tried \"+1 Action, +2 Cards, put two cards from your hand on top of your deck,\" but nixed that for causing too much AP. This card does cause a little AP, but is much better."},
{"name":"That friend by the way is Kelly Bailey, and he posts on these boards as cheepicus. Hi cheepicus.","nicename":"","history":"That friend by the way is Kelly Bailey, and he posts on these boards as cheepicus. Hi cheepicus."},
{"name":"Duke","nicename":"duke","history":" Another card added when the set went to 25 cards. I picked this particular card for this set to round out the victory card theme. Baron makes Estates matter, Duke makes Duchies matter.\nThis card started its life in another set as a victory card worth one point per copy of it you had. That just varied way too much. You have to charge enough for it to be fair when you get a lot of them, and then it's horrible when you don't. The fix was to have it count another card. The other card had to be one that was always out, and Duchy was the obvious choice."},
{"name":"Great Hall","nicename":"great-hall","history":" One of the oldest cards in the set. Originally it cost 3. One day I realized the Upgrade / Great Hall deck was just too ridiculous, and upped the price of both cards. Later on I realized that Upgrade had been the problem by itself, and returned Great Hall to its original cost. It's interesting how interesting it is for a card that does nothing.\n \n2nd Edition:\nFor new players, maybe Great Hall is reasonable; it does nothing, but it can be interesting considering Upgrading Estates into them, or getting them for Conspirators or something, and then uh well later on they are better than Estates at least. There are more good things to Upgrade Estates into now though, or power up Conspirators with; Great Hall was not competing there. A card that did something would be more interesting."},
{"name":"Harem","nicename":"harem","history":" Another of the oldest cards. Originally there were just some cards. One day I decided, okay, these ones are the main set, these are the first expansion, these are the second expansion. Great Hall / Harem / Nobles date back to then. They could have been in the main set, but they seemed like a cool simple thing to save for the first expansion, and have been there since 2006.\nI tried a few different mixes of victory points and coins before settling on two of each as the best version.\nMy version of Harem had no art - just a big 2 crown 2 coin. I used a crown for the victory point symbol you see. Anyway I liked that way of doing it and it seemed funny that Harem had no art. Just the card you want art for! I fully expected that the card name would get changed during development. Wouldn't someone complain that it was sexist, or un-European, or wait a minute, why does this make money? No-one complained though. Harem, there it is. We didn't specifically ask for cartoony art btw, that's just what came in."},
{"name":"Ironworks","nicename":"ironworks","history":" A somewhat late card, although still from prior to development. I designed it specifically to interact with the cards with two types. As it happens it only interacts with one such card in this set. But the card is cool anyway. Kelly was the one who suggested the template used to squeeze the text from this and Tribute onto the cards in a readable fashion."},
{"name":"Masquerade","nicename":"masquerade","history":" This card debuted in the 3rd set, moved to the 5th set, and finally ended up here. I wanted another interactive card and Dale wanted another card that cost 3. This was both so in it went. The premise of the card is the pass-left ability, and the rest of the card struggles to make that part good enough. You draw two cards first so that you're more likely to have a bad card to pass; you can trash a card afterwards so you can cope with getting passed a bad card. This card can hurt you, but isn't an attack. It would just be too confusing figuring out what Moat did to it if it were an attack."},
{"name":"Mining Village","nicename":"mining-village","history":" Originally the first expansion had a one-shot theme. One-shots (cards that say \"trash this,\" like Feast) were one of the most obvious things to do and I did several right away. The problem is, some people just don't like one-shots. Some people just don't like cards with penalties (although I do some here and there anyway, because some people like them fine and there are cool things you can't otherwise do); other people don't like the fact that the card doesn't end up in your deck. You know, you bought Feast, but you aren't playing a Feast deck, you won't even have any Feasts at all in the end. I don't know why, but that just rubs some folks the wrong way. Anyway the one-shot theme gradually eroded. Some went into the outtakes file, a few moved to other sets, some morphed into something without the one-shot part. Feast moved to the main set. The only surviving one-shot in this set is this card, and it isn't even a true one-shot, since trashing it is optional."},
{"name":"For much of its life, the abilities on Mining Village were flipped. It was \"+2 coins; you may trash this for +1 card +2 actions.\" When I added Conspirator, I thought they were too similar, and so changed Mining Village to what it is now. Everyone liked the new one better and so much for that.","nicename":"","history":"For much of its life, the abilities on Mining Village were flipped. It was \"+2 coins; you may trash this for +1 card +2 actions.\" When I added Conspirator, I thought they were too similar, and so changed Mining Village to what it is now. Everyone liked the new one better and so much for that."},
{"name":"Minion","nicename":"minion","history":" The original version of this was a \"choose one\" card with three messy abilities. It was too messy and also too narrow, and so left. Later on I was looking for an attack to replace another attack that hadn't worked out, and thought of this. Originally the \"discard, draw 4\" ability only worked on yourself, but it seemed like it would make a cute attack if it hit everybody. The problem was that it was still too narrow - you would not always have a combo that made that exciting enough. The solution, proposed by Chris West, was to have the card be a combo with itself. You can play a couple copies for +$2, and then play one to get a fresh hand. For simplicity there is no 3rd ability."},
{"name":"During development I had some games where it was clear that this card was too annoying. The \"discard, draw 4\" ability had no \"5 or more cards\" clause. So you would sometimes draw your whole deck... and also make everyone else draw their whole deck. So you'd make everyone else shuffle on each of your turns. As an attack it gets no worse if it just hits everyone else once, and it's way less annoying. We tested both and went with the less annoying version.","nicename":"","history":"During development I had some games where it was clear that this card was too annoying. The \"discard, draw 4\" ability had no \"5 or more cards\" clause. So you would sometimes draw your whole deck... and also make everyone else draw their whole deck. So you'd make everyone else shuffle on each of your turns. As an attack it gets no worse if it just hits everyone else once, and it's way less annoying. We tested both and went with the less annoying version."},
{"name":"Nobles","nicename":"nobles","history":" One of the oldest cards in the set. Originally it was \"+2 actions or +2 cards.\" It just didn't get any love when Harem was out. I tried \"+3 actions or +3 cards\" and it stayed like that for a long time. It was clearly too good though - now Harem was getting left out. You can see how it ended up. +3 Actions seems worth putting on a card someday, but it's much more interesting on a card that you buy specifically to get lots of Actions, rather than on a card that's just gravy eight ways from Sunday."},
{"name":"Pawn","nicename":"pawn","history":" A very early card that never changed (except the name - it was originally called Spare Room). It was considered for the main set for a while, but left because it slowed down new players too much. You play Pawn, stare at the card for forever, trying to make sure you've considered all of the possibilities, then finally pick +1 card +1 action. The card you draw is another Pawn and somehow you have to reconsider everything. It's one of my personal favorites, but really had to wait for an expansion, so that most players will have played a bunch already."},
{"name":"Saboteur","nicename":"saboteur","history":" This is one end result in the quest for a working version of \"each other player trashes the top card of their deck.\" That concept, as I have previously mentioned, has three problems: 1) it's often weak, trashing Coppers and Estates; 2) it's too random, sometimes trashing one player's Copper and another's Province; 3) it can lead to a weird game state in which everyone only has 5 cards left and can't get anywhere, which is cool if it just happens once ever, but bad if it happens every time a particular card is on the table.\n \n2nd Edition:\nLong ago my pick for worst card relative to its cost. It's got three huge problems: some people hate that it's an attack that doesn't otherwise help you; it's weak; and it's crazy wordy. On top of that some people just don't like trashing attacks, and the set already has Swindler. Some people do like them, but did I mention that the set has Swindler?"},
{"name":"Saboteur solves all of those problems. It can't hit Coppers or Estates; it has a much more even effect on your opponents; and the weird game state is much harder to achieve. And all it took was lots of tiny text!","nicename":"","history":"Saboteur solves all of those problems. It can't hit Coppers or Estates; it has a much more even effect on your opponents; and the weird game state is much harder to achieve. And all it took was lots of tiny text!"},
{"name":"Scout","nicename":"scout","history":" One of the cards added when going to 25 cards. It was another previously untried idea from the files. I picked it out as it interacted with the victory-cards-that-do-something. It does a few other tricks too.\n \n2nd Edition:\nPeople often cite this as the weakest card in the game. I dunno, there are different metrics. There's \"how often do I get it,\" there's \"how sad am I when you give me one with Ambassador.\" You know. I'd rather your Ambassador gave me a Scout than a Thief. In all-Intrigue games, Scout gets to draw you some Harems and Nobles and Great Halls. New players like it; it's all upside, right? It is pretty weak though. And I could preserve the premise on its replacement."},
{"name":"Secret Chamber","nicename":"secret-chamber","history":" The set had a reaction early on, but had lost it by the time development started. Dale wanted another reaction, and the set had space, due to going up to 25 cards. I didn't want to just stop attacks flat-out again, so this card instead does something odd that's useful against lots of attacks. You'll have to consider the individual cases for yourself, but really, it does show a lot of attacks what for. The non-reaction part had been a card in the main set in the murky past, which had left due to being too weak. It seemed good enough here with the reaction tacked onto it, and cute because it helps vs. Curses, which the reaction part doesn't. As with the similar nixed card described in the Courtyard entry, this can cause some AP, but it's not as bad because the attack gives you some direction and it isn't your turn.\n \n2nd Edition\nPeople don't cite this one anywhere near as often as Scout or Thief, but I actually get it even less often. The reaction is confusing and rarely useful; the top part is a fine ability but very weak, it wants to come with more stuff."},
{"name":"Shanty Town","nicename":"shanty-town","history":" I took this from the ruins of the 7th expansion. The 7th expansion didn't have a strong mechanical theme to make me leave its cards alone. It had a theme, but you know, just not the kind of thing that meant there was a pile of cards that had to wait in order to do the theme all at once. Plus it had a lot of good cards and well there were earlier expansions that wanted them. So it lost card after card, until eventually it dissolved completely; the theme itself was taken as a sub-theme for another expansion. This particular card made it here because I wanted another Village and this was a cool one."},
{"name":"Steward","nicename":"steward","history":" The first version of this gave you a choice between +2 Actions/Buys/Cards/coins. It wasn't interesting enough, so I traded in the Actions and Buys for trashing two cards.\nI changed a few card names late in the process, to synch things up better with the Intrigue theme, and confuse the playtesters. This card had been named Butler. As it happens, a medieval butler was a wine guy. A steward was the guy who ran your castle. Anyway when the art came in for Steward, it showed a guy with some serving dishes. Like a steward on an airplane. Also Pawn came in showing someone being forced to sign something. As you can see, we got replacement art. As of Seaside we are providing notes on what the card names mean for the artists. These aren't always just your everyday words here."},
{"name":"Swindler","nicename":"swindler","history":" A cursing attack that cost $3 didn't make the grade, and I needed a replacement. This card from the 4th set fit the bill. Originally it was \"Each other player trashes the top card of their deck and gains a card costing 2 less that you choose.\" Hitting Copper all the time made it very weak. I changed it to \"a card with the same cost\" and that made it a lot better - now Coppers turn into Curses. That's the version that got added to Intrigue, and it was tested a bit like that but was still pretty weak. I made it good enough by adding the +2 coins. The attack part is nice but needs that much help."},
{"name":"Torturer","nicename":"torturer","history":" One of the cards added when going up to 25. I had a \"decisions\" theme, and wanted a card that gave your opponents a decision. This is a pretty basic implementation of that concept. The set had had another such card in Envoy, but that left for being too redundant with Smithy. This card also gives you +3 Cards like Smithy, but adds something to the game in a way that Envoy didn't.\nI am avoiding giving strategy advice in general, but I am going to have to give some here. I had a game in which one of my friends stood up, enraged, and went into the other room to calm down. This card was the reason. Don't let it happen to you! The secret to happiness is, do not simply refuse to take a Curse no matter what. Sometimes, you have to take that Curse. Discarding five cards and passing is not the path to greatness. You've been warned!"},
{"name":"Trading Post","nicename":"trading-post","history":" This was originally in the main set, from way back when. When the main set went from 25 cards down to 20 cards, I cut this as being somewhat redundant with Mine. When we went back up to 25, I didn't add this back in; I wanted more variety. It does not seem nearly as redundant here. It's not the Smithy / Envoy problem; Trading Post and Mine are plenty different, they're just both ways to improve your money. It's more of a Smithy / Library / Council Room deal. But you know there was only so much space in the main set.\nThis card started out as \"trash a card from your hand; gain another card with the same cost.\" That's incredibly weak, which was immediately obvious. After a few quick iterations I ended up with Trading Post as it exists today."},
{"name":"Tribute","nicename":"tribute","history":" I took this from the 4th set, as a natural fit here due to the cards with two types. The original version had each adjacent player reveal their top card. I changed that to one player so it would work in 2-player games, and then changed it to discard when Thief changed to discard. Once it changed to discarding it could have gone back to hitting adjacent players and would have worked in 2-player games. I kept this version though, because it seemed a little more interesting, and because the player to your left is more likely to not be shuffling. Also the original didn't say \"differently named,\" but that was essential to keep the card from being too strong early in a game.\n \n2nd Edition:\nThis isn't that good, but is better than most of these cards. It's not popular though. Hosing Nobles / Harem / Great Hall is not great. Some people feel like it's attacking them, since it can flip over good cards; I think it tends to help as much as hurt, but so what, I don't need people to feel bad over a non-attack. I'll say it for everyone: it wasn't the greatest card in the world; it was just Tribute."},
{"name":"Upgrade","nicename":"upgrade","history":" A very old card. I explained how it once cost 4 in the entry for Great Hall. The \"exactly\" part actually makes the card better, as it lets you trash Curse and Copper without gaining anything."},
{"name":"Wishing Well","nicename":"wishing-well","history":" Taken from the original 3rd set. I don't remember why I moved this here, but I do like it here."},
{"name":"Courtier","nicename":"courtier","history":" I wanted yet another card that was good with Nobles / Harem / Mill. Counting types was a way to trigger off of those cards, but would also work with Attacks, Reactions, Durations, and other things. In a few cases you can get to three, and one card takes you to four (Dame Josephine). To stop it from going crazy when it gets to three, there are two strong options and two weaker ones. All four get used though."},
{"name":"Diplomat","nicename":"diplomat","history":" I needed a new Reaction. As with Secret Chamber it sounded nice to have the top deal with some Attacks while the bottom dealt with others (though it didn't end up like that). The top originally only gave +1 Action as the bonus for a small hand; that was still a nice bonus, but one day I thought of giving you +2 Actions and that seemed fun. Some games that's your Village, and you go for combos that will make it work, or else hope they attack you. The bottom originally gave a Silver when you gained or trashed a card. You had to discard it, so you couldn't gain the pile instantly (a once-per-turn approach was another option). I realized that discarding Reactions was not great, due to issues with early versions of Charm in Empires. Once-per-turn would have been okay but it got me thinking about, could I do better than this Silver thing. I had always wanted a Reaction that gave you a new hand when attacked, and tried a version of that, then tweaked it into what you see. When they attack, you use the ability (unless your hand is too good), and while you end up with just 4 cards in hand, on your turn you play Diplomat and are back to 5, with the +2 Actions."},
{"name":"Lurker","nicename":"lurker","history":" I needed a new $2, since my new Reaction was going to cost $4. I also needed an interactive card to replace Tribute. Somehow I hit on this half-Workshop. Trashing from the Supply never worked before (except on Salt the Earth and Gladiator, from around the same time period), but this time it did. The card originally didn't have +1 Action but needed that; one nice thing is, now you can just play two Lurkers to get whatever you want. The player interaction is great. Some people will put good stuff in the trash despite the risk that you'll get to it first; some will refuse, but still get a Lurker to try to leech off of you. Good cards find their way into the trash other ways for you too - Intrigue itself has Swindler, Upgrade, Replace, and Mining Village."},
{"name":"Mill","nicename":"mill","history":" This of course replaces Great Hall. It's a Great Hall that does something. And that something also replaces Secret Chamber. Originally it was the same - discard X cards for +$X - but the tracking is simpler if the amount is always $0 or $2 (bump the card up from the line of played cards if it made the $2). I first tried it without the VP, before realizing it was a good candidate for the new Great Hall."},
{"name":"Patrol","nicename":"patrol","history":" This replaces Scout. Pretty directly really; it can also get Curses, and instead of +1 Action it's +3 Cards, and it costs $5 instead of $4. For a while it gave +1 Action and +$1 per different type in your top 3 cards, and only Scouted 3 deep; then it gave a fixed +1 Action +$2, but I didn't like having both that and Minion; then I tried giving you an Attack a Reaction and a Victory card, rather than all the Victory cards and Curses; then I tried looking at 4 cards and taking the Victory/Curse cards plus two more."},
{"name":"Replace","nicename":"replace","history":" An attack, so ostensibly replacing Saboteur. A Remodel that gave bonuses based on what was trashed/gained was an old idea. Prior to that I had a bonus based on the types of the first card you bought; that was fun but the delay in-between playing it and it doing something was poor. Making it a Remodel fixed that. I tried different bonuses for the three types, but it was too wordy. I tried giving you a copy of the card if it was an Action or Treasure; that was too strong. The Cursing part stayed constant. It's cool that it's a Witch that doesn't hit for a while - unless they are willing to gain an Estate to hit you, or this is one of those games with Nobles or Harem or Mill."},
{"name":"Secret Passage","nicename":"secret-passage","history":" I had been thinking about trying to get in another Wishing Well combo, but it's tricky, because Wishing Well draws a card prior to the wish. Changing the top card just isn't enough. I thought of this and it was love at first sight. It does lots of neat little tricks. When it can't do those tricks, it's still useful, just for putting bad cards on the bottom of your deck (where you hope they miss a shuffle)."},
{"name":"Adventurer","nicename":"adventurer","history":" For a while the main set did not have an action costing 6. I thought it would be good if it did. At some point we decided to go with 25 Kingdom cards (it was 25, then 20, then 25 again), so there was space for a 6, and I went looking through the expansions for the most appropriate one - something interesting but not too weird that wasn't too tied to its expansion. I took Adventurer from the 7th expansion. I don't know how many expansions Dominion will actually get, all printed and everything, but my friends were insatiable, so I cranked out a lot of cards.\n \n2nd Edition:\nThis was the 6th card cut. My playtesters were pretty sure they didn't need to see more of it, and then I played some games with it, and man, it was not good. For casual players, it costs $6, Gold costs $6, if you want Adventurer you often want Gold first, maybe you never get around to Adventurer. Expert players will instead cite, it draws two cards and only gets Treasures, Smithy is cheaper, draws three, and can get Actions too."},
{"name":"Bureaucrat","nicename":"bureaucrat","history":" Okay there's a long story here.\nFor a long time the main set had an attack that read \"trash the top card of each other player's deck.\" As related in the BGN interview, it had 3 big problems: 1) adds way too much randomness, 2) can result in everyone stuck with a 5-card deck, 3) is otherwise weak. When it left during development, I tried replacing it with an expansion card called Militia: \"Each other player reveals their top card. If no-one revealed Copper, trash those cards. Otherwise, gain a Silver card.\" This fixed the weird-game-state problem of the previous card, and was less random, but still could make for some really unfun moments. Also it had a weird interaction with Moat, the way Moat worked at the time. It made you need to resolve the attack in slo-mo. Anyway it was no good. We quickly playtested a bunch of variations on Militia and the previous card, before I realized we could go with a discard-based attack instead, and that would make Valerie a lot happier - she hated the Militia variants.\nThe main set already had a discard-based attack. I had started with a 3rd expansion card, Bureaucracy: \"+2 coins. Each other player puts a card from his hand on top of his deck.\" So it turns out there's a basic problem with discard-based attacks in Dominion. Consider \"each other player discards a card.\" If that gets played once against you in a round, it tends to do nothing at all. Twice and it ranges from mildly annoying to annoying. Three times and it's devastating. It just nukes your turn. Now, you can get the effect three times by say having each opponent in a 4-player game play it once. You don't even need Villages and Throne Rooms. This effect naturally ranges from incredibly weak to incredibly broken."},
{"name":"There are solutions of course. My first solution was to go with \"each other player discards down to 3 cards.\" That card, with +2 coins, made it into the set with the name Bureaucracy.\nNow that I needed an attack to replace Militia, I took Bureaucracy a different direction. I kept the Silver-gaining of Militia, but had it go on top of your deck to make it more interesting, and went with a discard effect that only hit Victory cards, as another way to limit how devastating the discard can be. I used the \"on top of your deck\" part of the original Bureaucracy to make it more different from the card then called Bureaucracy. We already had art commissioned for a card called Militia, so this card was called Militia.\nThe original Bureaucracy had a flavor justification - putting a card back is like, you know, red tape. Bureaucracy. Slowing you down. So at this point the titles of the two cards were reversed. So we swapped them. Then, the other attacks were all guys, so Bureaucracy became Bureaucrat.","nicename":"","history":"There are solutions of course. My first solution was to go with \"each other player discards down to 3 cards.\" That card, with +2 coins, made it into the set with the name Bureaucracy.\nNow that I needed an attack to replace Militia, I took Bureaucracy a different direction. I kept the Silver-gaining of Militia, but had it go on top of your deck to make it more interesting, and went with a discard effect that only hit Victory cards, as another way to limit how devastating the discard can be. I used the \"on top of your deck\" part of the original Bureaucracy to make it more different from the card then called Bureaucracy. We already had art commissioned for a card called Militia, so this card was called Militia.\nThe original Bureaucracy had a flavor justification - putting a card back is like, you know, red tape. Bureaucracy. Slowing you down. So at this point the titles of the two cards were reversed. So we swapped them. Then, the other attacks were all guys, so Bureaucracy became Bureaucrat."},
{"name":"Cellar","nicename":"cellar","history":" The oldest version of this didn't give you +1 Action. It obviously needed it, got it early on, and survived unscathed since."},
{"name":"Chancellor","nicename":"chancellor","history":" When Valerie got her copy of the game at Origins 2007, she also got a copy of the first expansion as I had it then. So when cards left the main set, she knew all about those expansion cards, and on one occasion nominated this card to be swapped into the main set. I think she was looking for another +coins card, to provide another anti-Thief option. I really like having the card in the main set, as it's simple but subtle. New players are always like, huh? Why would I want to do that?\n \n2nd Edition:\nThis is both confusing and weak. The ability is totally worth having, if you can spare an action to play it; but the odds are that something else is a better use of your action and so much for that. One trick is, a $3 terminal action is actually competing with $5 terminal actions. I mean they both use up an action. So being cheaper isn't enough; you'd rather get Silver now and wait and get the $5. There is still room for terminal actions that cost $3, but Chancellor, not so much."},
{"name":"Chapel","nicename":"chapel","history":" This started out \"trash any number of cards\" and went to the ever-so-slightly weaker \"trash up to 4 cards.\" I tested a version with \"trash up to 3 cards.\" It was horrible. Just, way slower than the current version, like you wouldn't believe."},
{"name":"Council Room","nicename":"council-room","history":" Originally the 4th expansion had a \"non-attack player interaction\" sub-theme. It was easily the best expansion, and it became clear that I should split that sucker up. The main set got this card."},
{"name":"Feast","nicename":"feast","history":" At one point the 1st expansion had a \"one-shot\" theme. I eventually realized that that was a bad theme because some players don't like those cards. They don't like how the card doesn't stay in their deck, or something. I'm not too clear on it but I know there are haters out there. So I split that theme up, with some of the cards going into limbo. One-shots are different enough that I think they're worth doing sometimes, and well some people like them fine. But I might not even do one per set. The main set got this one as it's the least offensive; you do get to hold onto the card you fetch with it.\n \n2nd Edition:\nFeast is fine but really dull. It just adds nothing to the game; you consider buying it, but whether you do or not, your deck ends up whatever it was going to be anyway. Feast just doesn't change anything. I always point out, if I open Silver/Silver and you open Silver/Feast, and on turn three I draw 3 Coppers and Silver and buy a $5, and on turn three you draw 3 Coppers and Feast, trash Feast for that $5 and buy Silver, at that point our decks are the same. Okay so you can Workshop them and you can Throne Room them. The Workshop thing is fine but not enough to feel like I have to have the card. The Throne Room / Feast combo is the number one rules question in Dominion. Man let's just get rid of that."},
{"name":"Festival","nicename":"festival","history":" When the set went (back) up to 25 cards, it needed another Village-type card, and this was a simple one from the 6th expansion. It was originally called Circus. I think Dale suggested the name Festival. This is the only other name change that occurred during development (besides Bureaucrat / Militia). If I had it to do again, I might put a little more work into these names; a lot of them are fine - Thief steals treasures, Moat stops attacks, and while at first you figure, I guess the Thief can't swim, later you see the Moat art and realize it's not the kind of Moat that's swimmable - but some are odd - Feast is a big Workshop that only works once? See, you're talking shop at the feast. Names were just not an issue we looked at. Everything seemed fine because it had been called whatever for so long. It's the Raiders of the Lost Ark phenomenon. Raiders of the Lost Ark? Some thieves robbing a boat? But once you get used to it, it's Raiders, that movie. Anyway I have spent more time on expansion card names since."},
{"name":"Gardens","nicename":"gardens","history":" Originally the main set had a different special victory card. I swapped this in, taking it from the 6th expansion, because this one was less narrow - there are more \"tables\" (sets of 10 kingdom cards) that make Gardens a viable strategy. At one point Valerie put this on a list of cards she thought could leave the main set, but I defended it and she didn't fight it."},
{"name":"Laboratory","nicename":"laboratory","history":" A very early card that looked like this for forever."},
{"name":"Library","nicename":"library","history":" When I nabbed Festival from the 6th expansion, I took Library with it, since to me they went together. Actually it was a 3-card package, but the other card did not make the grade. Library seemed like a fine card to have around, so why not. At one point it came under fire for having confusing text, and could conceivably have gotten booted. We fixed up the text and ended up deciding it wasn't too complicated after all."},
{"name":"Market","nicename":"market","history":" This started out with a mere \"+1 Buy\" on that first evening of Dominion, and gradually accumulated the rest of the +'s over a couple evenings. If I left it at that you might think the first version was cheaper than 5, but no, it was 5. Before playing that first game, I had no idea what card costs should be, and my guesses were not always in the ballpark. Drawing Market meant you had fewer cards in hand to actually spend on that buy, so it obviously needed some money to go with it; and then there was another card that gave you a free coin, and I merged them."},
{"name":"Militia","nicename":"militia","history":" I already told the story of this one under Bureaucrat. If you skipped ahead to get to the Militia story, go back."},
{"name":"Mine","nicename":"mine","history":" Of the 10 Actions in the first game ever of Dominion, this has changed the least. It always cost 5, and always let you trade Copper for Silver or Silver for Gold. The only difference is that now it phrases this as \"gain a Treasure costing up to 3 more,\" as if someday there might be other treasures that this would also work with."},
{"name":"Moat","nicename":"moat","history":" The very first Moat just stopped one attack and was discarded. That was pretty weak, so I gradually improved it. Also I felt like it was important that you be able to do something with Moat even if no attacks were on the table, for people who wanted to just deal out 10 random cards and play with them. When Valerie got her copy, the card either drew 2 cards or was discarded to stop an attack, but during the time between then and when development started, I changed it so you just revealed it to stop attacks - you could stop multiple attacks with it, and then still play it to draw cards on your turn. For a while Valerie or Dale thought this might be too good, and we tested a version you had to discard, but eventually the stronger version won out."},
{"name":"Moneylender","nicename":"moneylender","history":" An old card that I don't think ever changed."},
{"name":"Remodel","nicename":"remodel","history":" Another very early card with no story."},
{"name":"Smithy","nicename":"smithy","history":" Another early card that never changed. It wasn't one of the first 10 cards though. At the beginning I was worried that drawing your whole deck would be bad. Soon I realized it was in fact fun."},
{"name":"Spy","nicename":"spy","history":" I made this for the 4th expansion during development of the main set, and almost immediately stole it for the main set. It was just too perfect; it's an attack that doesn't feel like the other ones, it interacts with a bunch of things, it's hard to evaluate. It's \"free\" (it has +1 card, +1 action, so playing it doesn't use up your action and it doesn't take up space in your hand), and those cards are hot tickets.\n \n2nd Edition:\nThis is both weak and slow. Make one decision per player; now play another Spy and make another decision per player. These days I prefer Spies to look more like Rabble and Fortune Teller: no +1 Action, no decision. I thought I would replace Spy with something like Rabble, but as you can see I didn't. Dominion itself is joining the ranks of the later expansions, that go lighter on attacks and heavier on non-attack interaction."},
{"name":"Thief","nicename":"thief","history":" This is the only card that Valerie and Dale changed (other than non-functional wording changes). Which is of course just the way I would have wanted things - I mean who wouldn't? They had no compulsion to make changes for the sake of changing things; they complained about a few weak/confusing cards that just left, and everything else but Thief ended up the way I made it. Anyway Thief originally revealed the top 2 cards, then put the untrashed ones back. Valerie didn't like how, if you got hit with Thief and your top 2 cards were non-Treasures, then subsequent Thieves would also get nothing. Also there was the issue of remembering the order to put the cards back. So they changed it from reveal to reveal-then-discard. I was initially skeptical but in the end I think it was a good change.\n \n2nd Edition:\nThis is one of the weakest cards in the game. I mean you knew going into this that some of these cards were going to have to be some of the weakest cards, that was a reason for replacing them, but well Thief is way down there. New players are scared of it, maybe it will eat all of their Treasures and shut them out. Then you realize you aren't choosing to gain the Coppers and in fact are happy to lose them. Then you stop buying Thief. It ends up sometimes useful in games where you actually want Copper (e.g. multiplayer Gardens games), or games where your opponent is relying on Treasure but trashed their Coppers, or sometimes with special Treasures in expansions. But uh, most games it just sits there. I could do better. You can argue that Thief provides a certain learning experience, that there's real gameplay in learning that the card is weak the hard way; but other cards can provide learning experiences that leave the cards contributing more once they're figured out."},
{"name":"Throne Room","nicename":"throne-room","history":" For most of its life this card cost 3. My feeling was that you didn't want to buy two on turns 1 and 2, and probably didn't want to buy one on either of those turns (except with the Feast combo). Later in the game it doesn't matter as much whether it costs 3 or 4. So why not 3? In general, if a card can be cheaper, I make it cheaper. I want the cards as cheap as possible without breaking the game, rather than as expensive as possible without going unplayed. So, I knew Throne Room was good, but it seemed like 3 was okay.\nWell late in development there was a game where no-one fought me for the Throne Rooms and I had a turn where I chained 6 of them. \"I play Throne Room. First I Throne Room a Throne Room; for that one first I Throne Room a Smithy, then a Throne Room; for that one first I Throne Room a Throne Room...\" I had a big cloud of actions on the table (we use a binary tree in these ridiculous situations). It's not just powerful; it's messy. I thought, hmm, maybe this could stand being 4 after all. It makes it just a bit harder to get a million of them; you don't go, \"Market, buy two Throne Rooms\" nearly as often. There was some worry that now there weren't enough 3's, but we decided we could live with just having four. There's Silver at 3, so it's fine to sometimes deal out a random 10 and not get a 3."},
{"name":"Village","nicename":"village","history":" This got better and better during the very early days of the game. One of my friends always went for Village and could not win a game. So over the first few weeks I gradually improved it to its current level. It's cool to see people arguing about whether it's too good or not and well I guess to keep that interesting I should avoid commenting myself. *whistles*"},
{"name":"Witch","nicename":"witch","history":" In the very first game of Dominion, this cost 3 but didn't draw you cards. It quickly shot up to 5, then gained the penalty of \"pay one coin.\" That's how much people hated Witch. It stayed like that until around when development started. When I started doing more testing of the main set cards (as opposed to expansions), it was obvious that Witch was weak. First it lost the penalty, then gained +1 Card, then +2 Cards. It costs 5; there is some tough competition there."},
{"name":"Woodcutter","nicename":"woodcutter","history":" At some point I wanted another +Buy card in the main set. I tried several things that were Woodcutter plus a small bonus, and the small bonuses kept being too wonky. Finally I went with the plain Woodcutter. Then I swapped it out for a more interesting +Buy card, but Valerie or Dale didn't like that one, so eventually we swapped Woodcutter back in. It's contributing to keeping complexity down in the main set.\nIn the beginning +1 Buy was written out - \"You may buy an additional card this turn.\" When there was a second one of those cards, I changed it to \"+1 Purchase,\" then \"+1 Build,\" and at last \"+1 Buy.\" +1 Action was also initially written out, but it never had any other name. During development we considered and rejected using icons instead. What do you do for your Action icon? Nothing good, is what I thought. And it's not like it actually simplifies anything. \"Action\" and \"Buy\" are text icons. Anyway for those of you who are wondering, why does a Woodcutter get you an extra Buy, that's why - I named that card when it was called \"+1 Build,\" and never thought of changing it later.\n \n2nd Edition:\nWoodcutter is fine, it's totally fine. It's just, the main set had six vanilla cards, and did it need six? Cards that do things are more interesting. I felt like five would be enough. The card to take out wanted to be one of the +Buy cards, since I thought having three of those was better than having four (even if all three cost $5, which is what happened). Market is way more beloved so Woodcutter was the card to cut."},
{"name":"Workshop","nicename":"workshop","history":" The very first version of this card was \"+1 Action. -1 Buy. Gain a card costing up to 3.\" Hey, \"-1 Buy,\" what's up with that? I was trying to design a card explicitly for a moneyless deck. It worked too - once in a while. Most games it was unplayable. Everyone hated it but me. Eventually I relented and dropped the -1 Buy. That version was still too narrow and well you know what it looks like now."},
{"name":"Estate, Duchy, Copper, Silver, Gold","nicename":"estate","history":" These cards are unchanged from day one. You could argue that the actions got tweaked to fit the treasures. The treasure pile sizes changed to match different estimates for the total set size, and ended up generous on all counts. In development the issue of the names for these came up - is it simpler if it's Copper Mine rather than Copper? In the end you can see that Copper won out. It just makes it a lot easier to name action cards if the treasures are treasures rather than mines."},
{"name":"Estate, Duchy, Copper, Silver, Gold","nicename":"duchy","history":" These cards are unchanged from day one. You could argue that the actions got tweaked to fit the treasures. The treasure pile sizes changed to match different estimates for the total set size, and ended up generous on all counts. In development the issue of the names for these came up - is it simpler if it's Copper Mine rather than Copper? In the end you can see that Copper won out. It just makes it a lot easier to name action cards if the treasures are treasures rather than mines."},
{"name":"Estate, Duchy, Copper, Silver, Gold","nicename":"copper","history":" These cards are unchanged from day one. You could argue that the actions got tweaked to fit the treasures. The treasure pile sizes changed to match different estimates for the total set size, and ended up generous on all counts. In development the issue of the names for these came up - is it simpler if it's Copper Mine rather than Copper? In the end you can see that Copper won out. It just makes it a lot easier to name action cards if the treasures are treasures rather than mines."},
{"name":"Estate, Duchy, Copper, Silver, Gold","nicename":"silver","history":" These cards are unchanged from day one. You could argue that the actions got tweaked to fit the treasures. The treasure pile sizes changed to match different estimates for the total set size, and ended up generous on all counts. In development the issue of the names for these came up - is it simpler if it's Copper Mine rather than Copper? In the end you can see that Copper won out. It just makes it a lot easier to name action cards if the treasures are treasures rather than mines."},
{"name":"Estate, Duchy, Copper, Silver, Gold","nicename":"gold","history":" These cards are unchanged from day one. You could argue that the actions got tweaked to fit the treasures. The treasure pile sizes changed to match different estimates for the total set size, and ended up generous on all counts. In development the issue of the names for these came up - is it simpler if it's Copper Mine rather than Copper? In the end you can see that Copper won out. It just makes it a lot easier to name action cards if the treasures are treasures rather than mines."},
{"name":"Province","nicename":"province","history":" As mentioned in the BGN article, we changed this from 5 VP to 6 VP during development, as part of the fix to the Duchy rush. The Duchy rush was, you buy nothing but Silver and Duchies. At the time the game ended when any Victory pile ran out. If one person went for the Duchy rush you could beat them, but if two people did, you had to join them. My friends found this strategy, but it didn't seem like a problem. It was a boring strategy, so the only reason to play it was if you thought it would win for you. It wouldn't though; it would win for someone at random, since we would all follow suit. You could make the game suck but that's it. So we never did it.\nWell would you believe, being able to make the game suck is not so hot. Furthermore, if you're a new player, the Duchy rush may elevate your chance of winning from zero to even. So it was in fact a problem. An anonymous playtester realized this, Valerie and Dale raised the alarm, and in the end, Province changed from 5 VP to 6 VP and the end condition changed from \"any empty victory pile\" (the end condition we were using at the time, but not the original one, which was \"any empty pile\") to the one you know. We tried ideas that Valerie or Dale came up with, but in the end happened to go with something that I suggested (which is why I didn't count this when I mentioned Thief as the only card they changed). These two changes were easily the most important changes during development."},
{"name":"Curse","nicename":"curse","history":" Originally this was a \"Token\" (you know, on the bottom line). There were both Curse and Confusion cards, and I wanted a name that didn't suggest a penalty, since who knows, maybe I would eventually make a non-penalty card like that. And I felt like maybe I would want to refer to these cards, so they needed a category. But with just Curse, and no need to refer to the cards, the name \"Token\" just looked weird. \"Curse\" was the easy out. It isn't a Victory card because that would cause some poor card interactions eventually.\nPre-development, you could get Curses from the trash. Also treasures. I forgot all about that when doing that BGN interview; this is another change Valerie and Dale made. They changed it to, once trashed, gone forever. My original thought was, I would have an infinite pile of Silvers if I could, but it's a physical game so what can you do. Getting them from the trash stretched out the supply just slightly. But it's simpler not to, nice to have those piles count towards the end condition, and man getting hit 10 times with Witch (the maximum if there's no Moat) is plenty.\nThe total number of Curses also changed. For a while there were 45. You could really get Cursed bad. Also you didn't always vary the pile size with the number of players. That's there of course to stop Witch from getting ridiculous with 2 players (or from being negligible with 4, if you fix it for 2)."},
{"name":"Artisan","nicename":"artisan","history":" For a while this was, cost $5, discard down to 2 cards in hand, gain a card costing up to $5. The idea was that the ability was strong enough that it was worth jumping through hoops for. But in games without combos, it wasn't very good, and when you did have the combos, Library was better. I gave it +$1 and still wasn't impressed. Meanwhile I had had a card in Empires (gain a Gold to your hand, put a card from your hand on your deck, each other player gets +1 VP) that hadn't worked out but had seemed promising, and I tried versions of it with different penalties. Finally one day I realized that costing $6 would be more fun than having a (second) penalty. Which means the set still has a card for $6, hooray."},
{"name":"Bandit","nicename":"bandit","history":" This of course replaces Thief. You gain a Gold so that it's always doing something useful. It doesn't trash Coppers, so it both doesn't have that huge penalty, and can't threaten new players with eating all of their Treasures."},
{"name":"Harbinger: One day I thought, do I have any published cards that are really different from everything else in the set, that I could make new very simple versions of? I found two good candidates: Scavenger (from Dark Ages) and Herald (from Guilds). The Scavenger part I liked was getting a card from your discard pile; so Harbinger does that, with +1 Card +1 Action instead of +$2, and without the Chancellor part (phew). This was called Courier for a while, but people complained about there being both Courier and Courtier.","nicename":"","history":"Harbinger: One day I thought, do I have any published cards that are really different from everything else in the set, that I could make new very simple versions of? I found two good candidates: Scavenger (from Dark Ages) and Herald (from Guilds). The Scavenger part I liked was getting a card from your discard pile; so Harbinger does that, with +1 Card +1 Action instead of +$2, and without the Chancellor part (phew). This was called Courier for a while, but people complained about there being both Courier and Courtier."},
{"name":"Merchant","nicename":"merchant","history":" A card that rewards you for having some Silvers. I tried something that gave the +$1 on having an Action in play (and another version that wanted an Action in hand), and that was nice, but I didn't want something too much like Conspirator. So, Silver. Then for a long time it said \"the next time\" instead of \"the first time.\" \"First\" is simpler except with Black Market, Storyteller, and Villa. Simpler is better and people with just the main set do not have those cards (a promo, a card from the 9th expansion, a card from the 10th expansion)."},
{"name":"Poacher","nicename":"poacher","history":" This is in a player interaction slot, vacated by Spy. I thought of having some vanilla bonuses with the penalty of discarding a card per empty pile. The vanilla bonuses had to be essentially fair at the price of the card, since you might never empty a pile until the game was over. So really it required a vanilla card I hadn't made yet. Well there was one of those, and it was +1 Card +1 Action +$1 for $4. So there it is. Avoiding making that card all these years finally paid off."},
{"name":"Sentry","nicename":"sentry","history":" One goal was to have another trasher in the main set; another was to have a cantrip $5. This card just came from combining those things. It's a mini-Cartographer that can also trash."},
{"name":"Vassal","nicename":"vassal","history":" This is the new Herald. Herald is +1 Card +1 Action, so Vassal is +$2; a mirror image of what I did for Harbinger. Originally it left the card on top, but discarding it is usually better and made the text simpler."},
{"name":"Acting Troupe","nicename":"acting-troupe","history":"Here you go, some villagers. At first this gave +5 Villagers. Too many."},
{"name":"Border Guard","nicename":"border-guard","history":"For a while this had no Artifacts. I wanted more Artifacts and saw that I could add one here, which was Lantern. Then I needed to put another Artifact somewhere and saw that this could have two Artifacts, so it got Horn."},
{"name":"Cargo Ship","nicename":"cargo-ship","history":"The concept debuted on a 2-sided State, limited to Treasures. The first version as a card set aside all gains, and doled them out at one per turn, like Archive. Then it was just one card, and that was better but weak - it cost $5. I tried it with +2 Coffers, then just lowered it to costing $4 and then $3."},
{"name":"Ducat","nicename":"ducat","history":"A late card. I needed a $2, and a +1 Buy card. Matt suggested making it a Treasure and there it is. It didn't change, but it did get argued about. Adam felt like it was \"strictly better\" than Candlestick Maker. I am pretty sure it isn't. What feels better is when you trash a Copper with it... which effectively costs you $3. But any which way, one is a Treasure and one an Action, and various things make those categories matter. It and Candlestick Maker are more similar than most pairs of cards, and well, twelfth expansion, trying to have simple cards, no regrets."},
{"name":"Experiment","nicename":"experiment","history":"We tried several versions of this. After a bit as a Smithy (based on another card that died), it switched to a Lab, because that way there's usually no tracking (it uses an Action but gives +1 Action, so when it vanishes your play area still tells you the whole story, yes unless you Throne it or something). For a bit they both went to the same place - e.g. if you used Sculptor to gain Experiment, both Experiments went to your hand. That was too confusing for how often it came up. There was a version that was two different cards, the first gained you a copy of the second (the second being non-supply); there was a version that was three one-shot Labs instead of two; there was one that was like Border Village, it got you a cheaper card instead of another Experiment. In the end it's two one-shot Labs, which it was early on, but with a better wording."},
{"name":"Flag Bearer","nicename":"flag-bearer","history":"Originally you took the Flag when you played it. Well at some point maybe you are drawing your decks and you just pass it back and forth. That isn't so great. I briefly tried only getting the Flag if Flag Bearer was your first play of the turn; then if you're drawing your decks it just sits there on the player who got lucky. Also bad. Changing it to when-gain/trash fixed it up every which way; anyone could take it on their turn, so it's not \"those two are fighting over that, let them,\" and yet the cost varies (maybe this turn you have $5) and gets higher over time (how many of these Flag Bearers can my deck really handle)."},
{"name":"Hideout","nicename":"hideout","history":"One of the first cards in the set, and it never changed."},
{"name":"Improve","nicename":"improve","history":"Ben and Steveie requested I make a new card that gave you card progression reminiscent of Procession. At first it cost $4, and triggered when discarding a card from play. It shifted to the start of Clean-up in order to avoid having it be possible for every effect in Dominion to happen in the middle of discarding your cards."},
{"name":"Inventor","nicename":"inventor","history":"One of the 2-sided State cards was a Workshop that could get you a Scheme-a-turn that turned into Citadel (but it worked on Treasures too). For some reason I added a Bridge effect to it, while it still used a State. Then I decided the State needed a different card, but kept the Workshop plus Bridge card sans States. We also tried it at $5 with the bottom part of Silk Merchant, but that was too helpful. Inventor does mega-turns, and ideally you don't always have just what you need there."},
{"name":"Lackeys","nicename":"lackeys","history":"Originally it was +2 Cards, turn over your thing that gets you +1 Action half the time. It went straight from that to the final version."},
{"name":"Mountain Village","nicename":"mountain-village","history":"The last card added. An early village with a negative Artifact didn't work out; then I made a new village with two Artifacts that also didn't work out. I decided the move was to just try to have a cool village, and not care about the Artifact being tacked-on, and this was the stand-out from the things I tried. At first you got an Artifact if your discard pile was empty; then I tried giving you the Artifact and +1 Card, and finally moved the Artifact to Recruiter (not what it did, but just, having an Artifact) (and of course Recruiter didn't keep it)."},
{"name":"Patron","nicename":"patron","history":"The first version had a two-sided State (it was a Cathedral that turned into a Cargo Ship for Treasures if you trashed a $5+ card). When those went away, I preserved the top and added the reaction. I fiddled with the wording some, to try to make it clear, but the idea stayed the same."},
{"name":"Priest","nicename":"priest","history":"This started out giving you an Artifact if you trashed a card costing $3 or more; the Artifact had you draw a card each time you trashed a card. Sometimes the Artifact felt really important, and it sucked to have to eat your deck to fight over it. I tried changing the condition to \"if you trashed a card that hadn't been trashed yet,\" then dropped the Artifact, and switched to getting a bonus per trash right on the card. The bonus was +$2 first, but I also tried +1 Coffers for comparison. It gets rid of some tracking but I liked +$2 better."},
{"name":"Old Witch","nicename":"old-witch","history":"For a while the set's Witch was \"Choose one: +3 Cards; or take the Evil Eye; or each other player gains a Curse.\" The Evil Eye was an Artifact that had you Curse the other players whenever gaining VP. We had fun with it for a while. Going for Evil Eye early and hard didn't work, but when someone did take the Evil Eye at a reasonable time, they would suddenly hand out so many Curses. Another issue was, wait, if you Moat this, they can't take the Artifact from you? Matt suggested it not being an Attack, which would have had a certain something - Young Witch has a built-in Moat, Old Witch is un-Moat-able. In the end I gave up on it and replaced it with this, the Witch that only temporarily gives you Curses."},
{"name":"Recruiter","nicename":"recruiter","history":"I tried trashing a card for +Coffers, and for a mix of +Coffers and +Villagers. It turned out to be too good of a strategy by itself - just madly convert your cards into tokens. But +Villagers by itself wouldn't have that problem, so I made that card and it was great. A kind of inverse Apprentice. Then at the last minute it got an Artifact, in order to not have the Artifact on Mountain Village. Then at the very last minute I moved the Artifact to Border Guard. We'd been happy with Recruiter, and this way I avoided having another card with multiple mechanics."},
{"name":"Research","nicename":"research","history":"Gradually, the set developed an at-first unintentional trash-for-benefit theme - cards that do something when gained or trashed, plus nice ways to trash them. So when I was filling the last few slots, I tried to get in some more of that. This is like Apprentice, but you get the cards next turn, and since they're set aside you have to have cards left to set aside for it."},
{"name":"Scepter","nicename":"scepter","history":"A way to replay actions was an old idea. Well Royal Carriage does it but you know, as a card you played. Royal Carriage happened, but this did not, because what if this game there's no card with +1 Action? You couldn't play your after-the-fact Throne Room. A fix is to make it a Treasure, and that card tried out for Nocturne. Well first it was a Night card, and both the Night and Treasure actually returned you to your Action phase, so that most effects would be meaningful. I didn't feel like it was adding much, and changed it to a Treasure that didn't change phases, which meant that many cards were now no good with it. Which I liked; it made it more of a combo card. It was a poor fit for a set with a lot of Night cards though. It made a list of cards to try in the next set, and when the time came, we tried it again, and then I made it both weaker when strong and stronger when weak, by changing it from always making $1, to either making $2 or replaying a card."},
{"name":"Scholar","nicename":"scholar","history":"This never changed. A poster child for the set being simple."},
{"name":"Sculptor","nicename":"sculptor","history":"One of the first cards in the set. It used the \"+1 Action every other time\" thing like Lackeys, then switched to +1 Villager, and that's that."},
{"name":"Seer","nicename":"seer","history":" At first it got you cards costing $2 or less, but that was too strong early on. Then $2 or $3, then $2-$4."},
{"name":"Silk Merchant","nicename":"silk merchant","history":"Briefly this was like a Pawn when gained/trashed, only with tokens in place of +$1 and +1 Action. I always like the idea of a when-gain that can draw cards, but it never survives, for the same reason: in the default situation, you don't want the cards. And then the triggered +1 Buy was problematic. So, no choice, it just gives you the other two."},
{"name":"Spices","nicename":"spices","history":" Briefly there was a treasure that gave you your choice of a mix of 2 tokens when you played it - Coffers, Villagers, or the +Buy mat. Then, a treasure worth $2 that gave you +2 Coffers and +1 Buy mat token when gained; this was somewhat inspired by a card of Matt's. Then I got rid of the +Buy mat, but moved the +Buy to the top of the card."},
{"name":"Swashbuckler","nicename":"swashbuckler","history":"An early poster child for the 2-sided States gave +3 Cards and added a token to the State (or took it if you didn't have it); when one side got 3 tokens it flipped over and gave you +3 Villagers, and when the other side got 3 tokens it flipped over and got you +3 Coffers and 3 Golds. It was called Jungle Explorer, and the state was Base Camp / Ancient Ruins. When the 2-sided States died, I tried to capture at least some of the spirit of the card, and this is how I did it."},
{"name":"Treasurer","nicename":"treasurer","history":" Initially this couldn't get stuff from the trash. That change gave it combos and was great. Late in the going I wanted to try to have more Artifacts and squeezed the Key onto this. It didn't need it to be good enough; it was just a place that I could reasonably fit an Artifact."},
{"name":"Villain","nicename":"villain","history":"I tried a few different Militias before getting here. When it got close to what it is, there were versions that looked for cards costing $3+ or $5+, versions that made you discard all copies of what you discarded, and versions that only attacked if you had enough Coffers tokens."},
{"name":"Academy","nicename":"academy","history":"Unchanged, though there were many unrelated cards called Academy."},
{"name":"Barracks","nicename":"barracks","history":"One of the first Projects, and it never changed."},
{"name":"Canal","nicename":"canal","history":" Unchanged. A lot of these ideas were just fine from the get-go."},
{"name":"Capitalism","nicename":"capitalism","history":"There was a thing that made your Silvers be Peddlers in your Action phase, then a thing that tried making your Treasures into Actions. It just isn't useful often enough. Once I hit on this, it was a question, should it be \"+$ amounts\" or specific ones, e.g. \"+$2 or +$3.\" We tried it both ways."},
{"name":"Cathedral","nicename":"cathedral","history":" This started as the front of a 2-sided State, that turned over if you trashed a card costing $5+. Once it became a Project, it didn't change."},
{"name":"Citadel","nicename":"citadel","history":" This also started as part of a 2-sided State, though it was the harder-to-get 2nd side. It originally replayed your first play each turn, which could be Action, Treasure or Night; this was just too confusing though, everyone just mentally thought it only worked on Actions. Spelling it out was poor, so, it just works on Actions. So much for the sneaky Throne Room for Night cards."},
{"name":"City Gate","nicename":"city gate","history":" The last Project. Unchanged."},
{"name":"Crop Rotation","nicename":"crop-rotation","history":"This was $5 and \"discard an Action,\" then $5 and \"Victory,\" then the final version."},
{"name":"Exploration","nicename":"exploration","history":"At first this gave +2 Coffers. Ben demonstrated that it was too strong with a bot."},
{"name":"Fair","nicename":"fair","history":" Another early Project that never changed."},
{"name":"Guildhall","nicename":"guildhall","history":"Unchanged."},
{"name":"Fleet","nicename":"fleet","history":"This started and ended at $5, but went up to $8 in the middle. I messed with the wording so that the turn order would be natural."},
{"name":"Innovation","nicename":"innovation","history":"This started at $5."},
{"name":"Pageant","nicename":"pageant","history":"This cost $2 at first, but a Project can't cost $2 (unless it has a penalty) - you just automatically buy it sometimes."},
{"name":"Piazza","nicename":"piazza","history":" Unchanged. Werothegreat suggested doing a one-card Golem Project; Matt pitched it as a Vassal; there it is."},
{"name":"Road Network","nicename":"road-network","history":"Unchanged."},
{"name":"Sewers","nicename":"sewers","history":"Unchanged."},
{"name":"Silos","nicename":"silos","history":"Unchanged."},
{"name":"Sinister Plot","nicename":"sinister-plot","history":"Early on I had a Duration card that sat there accumulating Coffers tokens until you popped it. There were a few versions. It's no fun seeing a giant pile of tokens on the other side of the table, so these died. Then I brought it back as the same thing but for +Cards. Somehow way more tolerable. So one day, you'd have a big turn. This was in the set for a while. Then I turned it into a Project, which only takes one card instead of eleven. As a Project there's the concern of, can we all keep our tokens separate, and well, we always managed."},
{"name":"Star Chart","nicename":"star-chart","history":"We tried several versions of a card that gained you a card each time you shuffled. It had problems every which way. This was a better fit for \"thing to do when you shuffle.\""}
]}
